/* automatically generated by rust-bindgen */

pub const _LIBC_LIMITS_H_: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 31;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __LONG_DOUBLE_USES_FLOAT128: u32 = 0;
pub const __HAVE_GENERIC_SELECTION: u32 = 1;
pub const __GLIBC_USE_LIB_EXT2: u32 = 0;

pub const OCI_LCR_ATTR_ROW_ID: &'static [u8; 7usize] = b"ROW_ID\0";
pub const OCI_LCR_ATTR_SESSION_NO: &'static [u8; 9usize] = b"SESSION#\0";
pub const OCI_LCR_ATTR_SERIAL_NO: &'static [u8; 8usize] = b"SERIAL#\0";
pub const OCI_LCR_ATTR_USERNAME: &'static [u8; 9usize] = b"USERNAME\0";
pub const OCI_LCR_ATTR_TX_NAME: &'static [u8; 8usize] = b"TX_NAME\0";
pub const OCI_LCR_ATTR_EDITION_NAME: &'static [u8; 13usize] = b"EDITION_NAME\0";
pub const OCI_LCR_ATTR_MESSAGE_TRACKING_LABEL: &'static [u8; 23usize] = b"MESSAGE_TRACKING_LABEL\0";
pub const OCI_LCR_ATTR_CURRENT_USER: &'static [u8; 13usize] = b"CURRENT_USER\0";
pub const OCI_LCR_ATTR_ROOT_NAME: &'static [u8; 10usize] = b"ROOT_NAME\0";
pub const OCI_LCR_ATTR_OLD_OWNER: &'static [u8; 10usize] = b"OLD_OWNER\0";
pub const OCI_LCR_ATTR_OLD_ONAME: &'static [u8; 10usize] = b"OLD_ONAME\0";
pub const OCI_LCR_ROW_COLVAL_OLD: u32 = 0;
pub const OCI_LCR_ROW_COLVAL_NEW: u32 = 1;
pub const OCI_LCR_MAX_POSITION_LEN: u32 = 64;
pub const OCI_LCR_MAX_TXID_LEN: u32 = 128;
pub const OCI_LCR_COLUMN_LOB_DATA: u32 = 1;
pub const OCI_LCR_COLUMN_LONG_DATA: u32 = 2;
pub const OCI_LCR_COLUMN_EMPTY_LOB: u32 = 4;
pub const OCI_LCR_COLUMN_LAST_CHUNK: u32 = 8;
pub const OCI_LCR_COLUMN_AL16UTF16: u32 = 16;
pub const OCI_LCR_COLUMN_NCLOB: u32 = 32;
pub const OCI_LCR_COLUMN_XML_DATA: u32 = 64;
pub const OCI_LCR_COLUMN_XML_DIFF: u32 = 128;
pub const OCI_LCR_COLUMN_ENCRYPTED: u32 = 256;
pub const OCI_LCR_COLUMN_UPDATED: u32 = 512;
pub const OCI_LCR_COLUMN_32K_DATA: u32 = 1024;
pub const OCI_LCR_COLUMN_OBJ_XML: u32 = 2048;
pub const OCI_ROWLCR_HAS_ID_KEY_ONLY: u32 = 1;
pub const OCI_ROWLCR_SEQ_LCR: u32 = 16;
pub const OCI_ROWLCR_IS_INFLIGHT_TXN: u32 = 32;
pub const OCI_LCR_APPCON_REPLAY: u32 = 4096;
pub const OCI_XSTREAM_MORE_ROW_DATA: u32 = 1;
pub const OCILCR_NEW_ONLY_MODE: u32 = 1;
pub const OCIXSTREAM_IN_FLUSH_WAIT_FOR_COMPLETE: u32 = 1;
pub const OCIXSTREAM_IN_FLUSH_RESERVED_1: u32 = 2;
pub const OCIXSTREAM_SESSION_SET_MAX_PARAM_LEN: u32 = 128;
pub const OCIXSTREAM_ATTR_ATTACH_TIMEOUT: &'static [u8; 20usize] = b"ATTACH_TIMEOUT_SECS\0";
pub const OCIXSTREAM_ATTR_MAX_ATTACH_RETRIES: &'static [u8; 19usize] = b"MAX_ATTACH_RETRIES\0";
pub const OCI_LCRID_V1: u32 = 1;
pub const OCI_LCRID_V2: u32 = 2;
pub const OCIXSTREAM_OUT_ATTACH_RESERVED_1: u32 = 1;
pub const OCIXSTREAM_OUT_ATTACH_APP_FREE_LCR: u32 = 2;
pub const OCIXSTREAM_OUT_ATTACH_APP_CONTAINER: u32 = 256;
pub const OCIXSTREAM_OUT_ATTACH_EXTENDED_TXID: u32 = 512;
pub const OCIXSTREAM_IN_ATTACH_RESTART_INBOUND: u32 = 1;
pub const OCIXSTREAM_IN_DETACH_RESTART_INBOUND: u32 = 1;
pub type size_t = ::std::os::raw::c_ulong;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
pub type ub1 = ::std::os::raw::c_uchar;
pub type sb1 = ::std::os::raw::c_schar;
pub type eb1 = ::std::os::raw::c_char;
pub type b1 = sb1;
pub type ub2 = ::std::os::raw::c_ushort;
pub type sb2 = ::std::os::raw::c_short;
pub type eb2 = ::std::os::raw::c_short;
pub type b2 = sb2;
pub type ub4 = ::std::os::raw::c_uint;
pub type sb4 = ::std::os::raw::c_int;
pub type eb4 = ::std::os::raw::c_int;
pub type oraub8 = ::std::os::raw::c_ulong;
pub type orasb8 = ::std::os::raw::c_long;
pub type ub8 = oraub8;
pub type sb8 = orasb8;
pub type b4 = sb4;
pub type oratext = ::std::os::raw::c_uchar;
pub type text = oratext;
pub type OraText = oratext;
pub type string = *mut OraText;
pub type utext = ::std::os::raw::c_ushort;
pub type boolean = ::std::os::raw::c_int;
pub type eword = ::std::os::raw::c_int;
pub type uword = ::std::os::raw::c_uint;
pub type sword = ::std::os::raw::c_int;
pub type ubig_ora = ::std::os::raw::c_ulong;
pub type sbig_ora = ::std::os::raw::c_long;
pub type lgenfp_t = ::std::option::Option<unsafe extern "C" fn()>;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type ssize_t = __ssize_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fd_set>())).__fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_slist>())).__next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cda_head {
    pub v2_rc: sb2,
    pub ft: ub2,
    pub rpc: ub4,
    pub peo: ub2,
    pub fc: ub1,
    pub rcs1: ub1,
    pub rc: ub2,
    pub wrn: ub1,
    pub rcs2: ub1,
    pub rcs3: sword,
    pub rid: cda_head__bindgen_ty_1,
    pub ose: sword,
    pub chk: ub1,
    pub rcsp: *mut ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cda_head__bindgen_ty_1 {
    pub rd: cda_head__bindgen_ty_1__bindgen_ty_1,
    pub rcs7: ub4,
    pub rcs8: ub2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cda_head__bindgen_ty_1__bindgen_ty_1 {
    pub rcs4: ub4,
    pub rcs5: ub2,
    pub rcs6: ub1,
}
#[test]
fn bindgen_test_layout_cda_head__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<cda_head__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(cda_head__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<cda_head__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(cda_head__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cda_head__bindgen_ty_1__bindgen_ty_1>())).rcs4 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(rcs4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cda_head__bindgen_ty_1__bindgen_ty_1>())).rcs5 as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(rcs5)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cda_head__bindgen_ty_1__bindgen_ty_1>())).rcs6 as *const _
                as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(rcs6)
        )
    );
}
#[test]
fn bindgen_test_layout_cda_head__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<cda_head__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(cda_head__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<cda_head__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(cda_head__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_head__bindgen_ty_1>())).rd as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head__bindgen_ty_1),
            "::",
            stringify!(rd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_head__bindgen_ty_1>())).rcs7 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head__bindgen_ty_1),
            "::",
            stringify!(rcs7)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_head__bindgen_ty_1>())).rcs8 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head__bindgen_ty_1),
            "::",
            stringify!(rcs8)
        )
    );
}
#[test]
fn bindgen_test_layout_cda_head() {
    assert_eq!(
        ::std::mem::size_of::<cda_head>(),
        56usize,
        concat!("Size of: ", stringify!(cda_head))
    );
    assert_eq!(
        ::std::mem::align_of::<cda_head>(),
        8usize,
        concat!("Alignment of ", stringify!(cda_head))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_head>())).v2_rc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head),
            "::",
            stringify!(v2_rc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_head>())).ft as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head),
            "::",
            stringify!(ft)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_head>())).rpc as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head),
            "::",
            stringify!(rpc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_head>())).peo as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head),
            "::",
            stringify!(peo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_head>())).fc as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head),
            "::",
            stringify!(fc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_head>())).rcs1 as *const _ as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head),
            "::",
            stringify!(rcs1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_head>())).rc as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head),
            "::",
            stringify!(rc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_head>())).wrn as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head),
            "::",
            stringify!(wrn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_head>())).rcs2 as *const _ as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head),
            "::",
            stringify!(rcs2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_head>())).rcs3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head),
            "::",
            stringify!(rcs3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_head>())).rid as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head),
            "::",
            stringify!(rid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_head>())).ose as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head),
            "::",
            stringify!(ose)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_head>())).chk as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head),
            "::",
            stringify!(chk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_head>())).rcsp as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_head),
            "::",
            stringify!(rcsp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cda_def {
    pub v2_rc: sb2,
    pub ft: ub2,
    pub rpc: ub4,
    pub peo: ub2,
    pub fc: ub1,
    pub rcs1: ub1,
    pub rc: ub2,
    pub wrn: ub1,
    pub rcs2: ub1,
    pub rcs3: sword,
    pub rid: cda_def__bindgen_ty_1,
    pub ose: sword,
    pub chk: ub1,
    pub rcsp: *mut ::std::os::raw::c_void,
    pub rcs9: [ub1; 8usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cda_def__bindgen_ty_1 {
    pub rd: cda_def__bindgen_ty_1__bindgen_ty_1,
    pub rcs7: ub4,
    pub rcs8: ub2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cda_def__bindgen_ty_1__bindgen_ty_1 {
    pub rcs4: ub4,
    pub rcs5: ub2,
    pub rcs6: ub1,
}
#[test]
fn bindgen_test_layout_cda_def__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<cda_def__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(cda_def__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<cda_def__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(cda_def__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cda_def__bindgen_ty_1__bindgen_ty_1>())).rcs4 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(rcs4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cda_def__bindgen_ty_1__bindgen_ty_1>())).rcs5 as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(rcs5)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cda_def__bindgen_ty_1__bindgen_ty_1>())).rcs6 as *const _
                as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(rcs6)
        )
    );
}
#[test]
fn bindgen_test_layout_cda_def__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<cda_def__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(cda_def__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<cda_def__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(cda_def__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_def__bindgen_ty_1>())).rd as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def__bindgen_ty_1),
            "::",
            stringify!(rd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_def__bindgen_ty_1>())).rcs7 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def__bindgen_ty_1),
            "::",
            stringify!(rcs7)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_def__bindgen_ty_1>())).rcs8 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def__bindgen_ty_1),
            "::",
            stringify!(rcs8)
        )
    );
}
#[test]
fn bindgen_test_layout_cda_def() {
    assert_eq!(
        ::std::mem::size_of::<cda_def>(),
        64usize,
        concat!("Size of: ", stringify!(cda_def))
    );
    assert_eq!(
        ::std::mem::align_of::<cda_def>(),
        8usize,
        concat!("Alignment of ", stringify!(cda_def))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_def>())).v2_rc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def),
            "::",
            stringify!(v2_rc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_def>())).ft as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def),
            "::",
            stringify!(ft)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_def>())).rpc as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def),
            "::",
            stringify!(rpc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_def>())).peo as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def),
            "::",
            stringify!(peo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_def>())).fc as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def),
            "::",
            stringify!(fc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_def>())).rcs1 as *const _ as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def),
            "::",
            stringify!(rcs1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_def>())).rc as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def),
            "::",
            stringify!(rc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_def>())).wrn as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def),
            "::",
            stringify!(wrn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_def>())).rcs2 as *const _ as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def),
            "::",
            stringify!(rcs2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_def>())).rcs3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def),
            "::",
            stringify!(rcs3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_def>())).rid as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def),
            "::",
            stringify!(rid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_def>())).ose as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def),
            "::",
            stringify!(ose)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_def>())).chk as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def),
            "::",
            stringify!(chk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_def>())).rcsp as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def),
            "::",
            stringify!(rcsp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cda_def>())).rcs9 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(cda_def),
            "::",
            stringify!(rcs9)
        )
    );
}
pub type Cda_Def = cda_def;
pub type Lda_Def = cda_def;
pub type Hda_AlignType = ub8;
pub type Hda_Def = [Hda_AlignType; 32usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIEnv {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIError {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCISvcCtx {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIStmt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIBind {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIDefine {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIDescribe {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIServer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCISession {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIComplexObject {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCITrans {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCISecurity {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCISubscription {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCICPool {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCISPool {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIAuthInfo {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIAdmin {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIEvent {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCISnapshot {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIResult {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCILobLocator {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCILobRegion {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIParam {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIComplexObjectComp {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIRowid {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIDateTime {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIInterval {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIUcb {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIServerDNs {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIShardingKey {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIShardInst {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIAQEnqOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIAQDeqOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIAQMsgProperties {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIAQAgent {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIAQNfyDescriptor {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIAQSignature {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIAQListenOpts {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIAQLisMsgProps {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIAQJmsgProperties {
    _unused: [u8; 0],
}
pub type OCIClobLocator = OCILobLocator;
pub type OCIBlobLocator = OCILobLocator;
pub type OCIBFileLocator = OCILobLocator;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCISodaColl {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCISodaDoc {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCISodaDocCursor {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCISodaOperationOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCISodaOutputOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCISodaMetadata {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCISodaCollCursor {
    _unused: [u8; 0],
}
pub type OCILobOffset = ub4;
pub type OCILobLength = ub4;
pub const OCILobMode_OCI_LOBMODE_READONLY: OCILobMode = 1;
pub const OCILobMode_OCI_LOBMODE_READWRITE: OCILobMode = 2;
pub type OCILobMode = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIPicklerTdsCtx {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIPicklerTds {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIPicklerImage {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIPicklerFdo {
    _unused: [u8; 0],
}
pub type OCIPicklerTdsElement = ub4;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIAnyData {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIAnyDataSet {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIAnyDataCtx {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIMsg {
    _unused: [u8; 0],
}
pub type OCIWchar = ub4;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIIOV {
    pub bfp: *mut ::std::os::raw::c_void,
    pub bfl: ub4,
}
#[test]
fn bindgen_test_layout_OCIIOV() {
    assert_eq!(
        ::std::mem::size_of::<OCIIOV>(),
        16usize,
        concat!("Size of: ", stringify!(OCIIOV))
    );
    assert_eq!(
        ::std::mem::align_of::<OCIIOV>(),
        8usize,
        concat!("Alignment of ", stringify!(OCIIOV))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OCIIOV>())).bfp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OCIIOV),
            "::",
            stringify!(bfp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OCIIOV>())).bfl as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OCIIOV),
            "::",
            stringify!(bfl)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIFileObject {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIThreadContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIThreadMutex {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIThreadKey {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIThreadId {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIThreadHandle {
    _unused: [u8; 0],
}
pub type OCIThreadKeyDestFunc =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIRef {
    _unused: [u8; 0],
}
pub type OCIInd = sb2;
pub const OCIPinOpt_OCI_PIN_DEFAULT: OCIPinOpt = 1;
pub const OCIPinOpt_OCI_PIN_ANY: OCIPinOpt = 3;
pub const OCIPinOpt_OCI_PIN_RECENT: OCIPinOpt = 4;
pub const OCIPinOpt_OCI_PIN_LATEST: OCIPinOpt = 5;
pub type OCIPinOpt = u32;
pub const OCILockOpt_OCI_LOCK_NONE: OCILockOpt = 1;
pub const OCILockOpt_OCI_LOCK_X: OCILockOpt = 2;
pub const OCILockOpt_OCI_LOCK_X_NOWAIT: OCILockOpt = 3;
pub type OCILockOpt = u32;
pub const OCIMarkOpt_OCI_MARK_DEFAULT: OCIMarkOpt = 1;
pub const OCIMarkOpt_OCI_MARK_NONE: OCIMarkOpt = 1;
pub const OCIMarkOpt_OCI_MARK_UPDATE: OCIMarkOpt = 2;
pub type OCIMarkOpt = u32;
pub type OCIDuration = ub2;
pub const OCIObjectProperty_OCI_OBJECTPROP_DIRTIED: OCIObjectProperty = 1;
pub const OCIObjectProperty_OCI_OBJECTPROP_LOADED: OCIObjectProperty = 2;
pub const OCIObjectProperty_OCI_OBJECTPROP_LOCKED: OCIObjectProperty = 3;
#[doc = "  DO NOT USE OCIObjectProperty. IT IS UNSUPPORTED                          **"]
#[doc = "  WILL BE REMOVED/CHANGED IN A FUTURE RELEASE                              **"]
pub type OCIObjectProperty = u32;
pub const OCIRefreshOpt_OCI_REFRESH_LOADED: OCIRefreshOpt = 1;
pub type OCIRefreshOpt = u32;
pub const OCIObjectEvent_OCI_OBJECTEVENT_BEFORE_FLUSH: OCIObjectEvent = 1;
pub const OCIObjectEvent_OCI_OBJECTEVENT_AFTER_FLUSH: OCIObjectEvent = 2;
pub const OCIObjectEvent_OCI_OBJECTEVENT_BEFORE_REFRESH: OCIObjectEvent = 3;
pub const OCIObjectEvent_OCI_OBJECTEVENT_AFTER_REFRESH: OCIObjectEvent = 4;
pub const OCIObjectEvent_OCI_OBJECTEVENT_WHEN_MARK_UPDATED: OCIObjectEvent = 5;
pub const OCIObjectEvent_OCI_OBJECTEVENT_WHEN_MARK_DELETED: OCIObjectEvent = 6;
pub const OCIObjectEvent_OCI_OBJECTEVENT_WHEN_UNMARK: OCIObjectEvent = 7;
pub const OCIObjectEvent_OCI_OBJECTEVENT_WHEN_LOCK: OCIObjectEvent = 8;
#[doc = "  DO NOT USE OCIObjectEvent. IT IS UNSUPPORTED                             **"]
#[doc = "  WILL BE REMOVED/CHANGED IN A FUTURE RELEASE                              **"]
pub type OCIObjectEvent = u32;
pub type OCIObjectPropId = ub1;
pub const OCIObjectLifetime_OCI_OBJECT_PERSISTENT: OCIObjectLifetime = 1;
pub const OCIObjectLifetime_OCI_OBJECT_TRANSIENT: OCIObjectLifetime = 2;
pub const OCIObjectLifetime_OCI_OBJECT_VALUE: OCIObjectLifetime = 3;
pub type OCIObjectLifetime = u32;
pub type OCIObjectMarkStatus = uword;
pub type OCITypeCode = ub2;
pub const OCITypeGetOpt_OCI_TYPEGET_HEADER: OCITypeGetOpt = 0;
pub const OCITypeGetOpt_OCI_TYPEGET_ALL: OCITypeGetOpt = 1;
pub type OCITypeGetOpt = u32;
pub const OCITypeEncap_OCI_TYPEENCAP_PRIVATE: OCITypeEncap = 0;
pub const OCITypeEncap_OCI_TYPEENCAP_PUBLIC: OCITypeEncap = 1;
pub type OCITypeEncap = u32;
pub const OCITypeMethodFlag_OCI_TYPEMETHOD_INLINE: OCITypeMethodFlag = 1;
pub const OCITypeMethodFlag_OCI_TYPEMETHOD_CONSTANT: OCITypeMethodFlag = 2;
pub const OCITypeMethodFlag_OCI_TYPEMETHOD_VIRTUAL: OCITypeMethodFlag = 4;
pub const OCITypeMethodFlag_OCI_TYPEMETHOD_CONSTRUCTOR: OCITypeMethodFlag = 8;
pub const OCITypeMethodFlag_OCI_TYPEMETHOD_DESTRUCTOR: OCITypeMethodFlag = 16;
pub const OCITypeMethodFlag_OCI_TYPEMETHOD_OPERATOR: OCITypeMethodFlag = 32;
pub const OCITypeMethodFlag_OCI_TYPEMETHOD_SELFISH: OCITypeMethodFlag = 64;
pub const OCITypeMethodFlag_OCI_TYPEMETHOD_MAP: OCITypeMethodFlag = 128;
pub const OCITypeMethodFlag_OCI_TYPEMETHOD_ORDER: OCITypeMethodFlag = 256;
pub const OCITypeMethodFlag_OCI_TYPEMETHOD_RNDS: OCITypeMethodFlag = 512;
pub const OCITypeMethodFlag_OCI_TYPEMETHOD_WNDS: OCITypeMethodFlag = 1024;
pub const OCITypeMethodFlag_OCI_TYPEMETHOD_RNPS: OCITypeMethodFlag = 2048;
pub const OCITypeMethodFlag_OCI_TYPEMETHOD_WNPS: OCITypeMethodFlag = 4096;
pub const OCITypeMethodFlag_OCI_TYPEMETHOD_ABSTRACT: OCITypeMethodFlag = 8192;
pub const OCITypeMethodFlag_OCI_TYPEMETHOD_OVERRIDING: OCITypeMethodFlag = 16384;
pub const OCITypeMethodFlag_OCI_TYPEMETHOD_PIPELINED: OCITypeMethodFlag = 32768;
pub type OCITypeMethodFlag = u32;
pub const OCITypeParamMode_OCI_TYPEPARAM_IN: OCITypeParamMode = 0;
pub const OCITypeParamMode_OCI_TYPEPARAM_OUT: OCITypeParamMode = 1;
pub const OCITypeParamMode_OCI_TYPEPARAM_INOUT: OCITypeParamMode = 2;
pub const OCITypeParamMode_OCI_TYPEPARAM_BYREF: OCITypeParamMode = 3;
pub const OCITypeParamMode_OCI_TYPEPARAM_OUTNCPY: OCITypeParamMode = 4;
pub const OCITypeParamMode_OCI_TYPEPARAM_INOUTNCPY: OCITypeParamMode = 5;
pub type OCITypeParamMode = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIType {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCITypeElem {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCITypeMethod {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCITypeIter {
    _unused: [u8; 0],
}
extern "C" {
    pub fn OCITypeIterNew(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tdo: *mut OCIType,
        iterator_ort: *mut *mut OCITypeIter,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeIterSet(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tdo: *mut OCIType,
        iterator_ort: *mut OCITypeIter,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeIterFree(
        env: *mut OCIEnv,
        err: *mut OCIError,
        iterator_ort: *mut OCITypeIter,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeByName(
        env: *mut OCIEnv,
        err: *mut OCIError,
        svc: *const OCISvcCtx,
        schema_name: *const oratext,
        s_length: ub4,
        type_name: *const oratext,
        t_length: ub4,
        version_name: *const oratext,
        v_length: ub4,
        pin_duration: OCIDuration,
        get_option: OCITypeGetOpt,
        tdo: *mut *mut OCIType,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeArrayByName(
        env: *mut OCIEnv,
        err: *mut OCIError,
        svc: *const OCISvcCtx,
        array_len: ub4,
        schema_name: *mut *const oratext,
        s_length: *mut ub4,
        type_name: *mut *const oratext,
        t_length: *mut ub4,
        version_name: *mut *const oratext,
        v_length: *mut ub4,
        pin_duration: OCIDuration,
        get_option: OCITypeGetOpt,
        tdo: *mut *mut OCIType,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeByFullName(
        env: *mut OCIEnv,
        err: *mut OCIError,
        svc: *const OCISvcCtx,
        full_type_name: *const oratext,
        full_type_name_length: ub4,
        version_name: *const oratext,
        version_name_length: ub4,
        pin_duration: OCIDuration,
        get_option: OCITypeGetOpt,
        tdo: *mut *mut OCIType,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeArrayByFullName(
        env: *mut OCIEnv,
        err: *mut OCIError,
        svc: *const OCISvcCtx,
        array_len: ub4,
        full_type_name: *mut *const oratext,
        full_type_name_length: *mut ub4,
        version_name: *mut *const oratext,
        version_name_length: *mut ub4,
        pin_duration: OCIDuration,
        get_option: OCITypeGetOpt,
        tdo: *mut *mut OCIType,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeByRef(
        env: *mut OCIEnv,
        err: *mut OCIError,
        type_ref: *const OCIRef,
        pin_duration: OCIDuration,
        get_option: OCITypeGetOpt,
        tdo: *mut *mut OCIType,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeArrayByRef(
        env: *mut OCIEnv,
        err: *mut OCIError,
        array_len: ub4,
        type_ref: *mut *const OCIRef,
        pin_duration: OCIDuration,
        get_option: OCITypeGetOpt,
        tdo: *mut *mut OCIType,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeName(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tdo: *const OCIType,
        n_length: *mut ub4,
    ) -> *mut oratext;
}
extern "C" {
    pub fn OCITypeSchema(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tdo: *const OCIType,
        n_length: *mut ub4,
    ) -> *mut oratext;
}
extern "C" {
    pub fn OCITypePackage(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tdo: *const OCIType,
        n_length: *mut ub4,
    ) -> *mut oratext;
}
extern "C" {
    pub fn OCITypeTypeCode(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tdo: *const OCIType,
    ) -> OCITypeCode;
}
extern "C" {
    pub fn OCITypeCollTypeCode(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tdo: *const OCIType,
    ) -> OCITypeCode;
}
extern "C" {
    pub fn OCITypeVersion(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tdo: *const OCIType,
        v_length: *mut ub4,
    ) -> *mut oratext;
}
extern "C" {
    pub fn OCITypeAttrs(env: *mut OCIEnv, err: *mut OCIError, tdo: *const OCIType) -> ub4;
}
extern "C" {
    pub fn OCITypeMethods(env: *mut OCIEnv, err: *mut OCIError, tdo: *const OCIType) -> ub4;
}
extern "C" {
    pub fn OCITypeElemName(
        env: *mut OCIEnv,
        err: *mut OCIError,
        elem: *const OCITypeElem,
        n_length: *mut ub4,
    ) -> *mut oratext;
}
extern "C" {
    pub fn OCITypeElemTypeCode(
        env: *mut OCIEnv,
        err: *mut OCIError,
        elem: *const OCITypeElem,
    ) -> OCITypeCode;
}
extern "C" {
    pub fn OCITypeElemType(
        env: *mut OCIEnv,
        err: *mut OCIError,
        elem: *const OCITypeElem,
        elem_tdo: *mut *mut OCIType,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeElemFlags(env: *mut OCIEnv, err: *mut OCIError, elem: *const OCITypeElem) -> ub4;
}
extern "C" {
    pub fn OCITypeElemNumPrec(
        env: *mut OCIEnv,
        err: *mut OCIError,
        elem: *const OCITypeElem,
    ) -> ub1;
}
extern "C" {
    pub fn OCITypeElemNumScale(
        env: *mut OCIEnv,
        err: *mut OCIError,
        elem: *const OCITypeElem,
    ) -> sb1;
}
extern "C" {
    pub fn OCITypeElemLength(env: *mut OCIEnv, err: *mut OCIError, elem: *const OCITypeElem)
        -> ub4;
}
extern "C" {
    pub fn OCITypeElemCharSetID(
        env: *mut OCIEnv,
        err: *mut OCIError,
        elem: *const OCITypeElem,
    ) -> ub2;
}
extern "C" {
    pub fn OCITypeElemCharSetForm(
        env: *mut OCIEnv,
        err: *mut OCIError,
        elem: *const OCITypeElem,
    ) -> ub2;
}
extern "C" {
    pub fn OCITypeElemParameterizedType(
        env: *mut OCIEnv,
        err: *mut OCIError,
        elem: *const OCITypeElem,
        type_stored: *mut *mut OCIType,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeElemExtTypeCode(
        env: *mut OCIEnv,
        err: *mut OCIError,
        elem: *const OCITypeElem,
    ) -> OCITypeCode;
}
extern "C" {
    pub fn OCITypeAttrByName(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tdo: *const OCIType,
        name: *const oratext,
        n_length: ub4,
        elem: *mut *mut OCITypeElem,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeAttrNext(
        env: *mut OCIEnv,
        err: *mut OCIError,
        iterator_ort: *mut OCITypeIter,
        elem: *mut *mut OCITypeElem,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeCollElem(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tdo: *const OCIType,
        element: *mut *mut OCITypeElem,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeCollSize(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tdo: *const OCIType,
        num_elems: *mut ub4,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeCollExtTypeCode(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tdo: *const OCIType,
        sqt_code: *mut OCITypeCode,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeMethodOverload(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tdo: *const OCIType,
        method_name: *const oratext,
        m_length: ub4,
    ) -> ub4;
}
extern "C" {
    pub fn OCITypeMethodByName(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tdo: *const OCIType,
        method_name: *const oratext,
        m_length: ub4,
        mdos: *mut *mut OCITypeMethod,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeMethodNext(
        env: *mut OCIEnv,
        err: *mut OCIError,
        iterator_ort: *mut OCITypeIter,
        mdo: *mut *mut OCITypeMethod,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeMethodName(
        env: *mut OCIEnv,
        err: *mut OCIError,
        mdo: *const OCITypeMethod,
        n_length: *mut ub4,
    ) -> *mut oratext;
}
extern "C" {
    pub fn OCITypeMethodEncap(
        env: *mut OCIEnv,
        err: *mut OCIError,
        mdo: *const OCITypeMethod,
    ) -> OCITypeEncap;
}
extern "C" {
    pub fn OCITypeMethodFlags(
        env: *mut OCIEnv,
        err: *mut OCIError,
        mdo: *const OCITypeMethod,
    ) -> OCITypeMethodFlag;
}
extern "C" {
    pub fn OCITypeMethodMap(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tdo: *const OCIType,
        mdo: *mut *mut OCITypeMethod,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeMethodOrder(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tdo: *const OCIType,
        mdo: *mut *mut OCITypeMethod,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeMethodParams(
        env: *mut OCIEnv,
        err: *mut OCIError,
        mdo: *const OCITypeMethod,
    ) -> ub4;
}
extern "C" {
    pub fn OCITypeResult(
        env: *mut OCIEnv,
        err: *mut OCIError,
        mdo: *const OCITypeMethod,
        elem: *mut *mut OCITypeElem,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeParamByPos(
        env: *mut OCIEnv,
        err: *mut OCIError,
        mdo: *const OCITypeMethod,
        position: ub4,
        elem: *mut *mut OCITypeElem,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeParamByName(
        env: *mut OCIEnv,
        err: *mut OCIError,
        mdo: *const OCITypeMethod,
        name: *const oratext,
        n_length: ub4,
        elem: *mut *mut OCITypeElem,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeParamPos(
        env: *mut OCIEnv,
        err: *mut OCIError,
        mdo: *const OCITypeMethod,
        name: *const oratext,
        n_length: ub4,
        position: *mut ub4,
        elem: *mut *mut OCITypeElem,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeElemParamMode(
        env: *mut OCIEnv,
        err: *mut OCIError,
        elem: *const OCITypeElem,
    ) -> OCITypeParamMode;
}
extern "C" {
    pub fn OCITypeElemDefaultValue(
        env: *mut OCIEnv,
        err: *mut OCIError,
        elem: *const OCITypeElem,
        d_v_length: *mut ub4,
    ) -> *mut oratext;
}
extern "C" {
    pub fn OCITypeVTInit(env: *mut OCIEnv, err: *mut OCIError) -> sword;
}
extern "C" {
    pub fn OCITypeVTInsert(
        env: *mut OCIEnv,
        err: *mut OCIError,
        schema_name: *const oratext,
        s_n_length: ub4,
        type_name: *const oratext,
        t_n_length: ub4,
        user_version: *const oratext,
        u_v_length: ub4,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeVTSelect(
        env: *mut OCIEnv,
        err: *mut OCIError,
        schema_name: *const oratext,
        s_n_length: ub4,
        type_name: *const oratext,
        t_n_length: ub4,
        user_version: *mut *mut oratext,
        u_v_length: *mut ub4,
        version: *mut ub2,
    ) -> sword;
}
extern "C" {
    pub fn ortgcty(
        env: *mut OCIEnv,
        err: *mut OCIError,
        coll_tdo: *mut OCIType,
        collelem_tdo: *mut *mut OCIType,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeBeginCreate(
        svchp: *mut OCISvcCtx,
        errhp: *mut OCIError,
        tc: OCITypeCode,
        dur: OCIDuration,
        type_: *mut *mut OCIType,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeSetCollection(
        svchp: *mut OCISvcCtx,
        errhp: *mut OCIError,
        type_: *mut OCIType,
        collelem_info: *mut OCIParam,
        coll_count: ub4,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeSetBuiltin(
        svchp: *mut OCISvcCtx,
        errhp: *mut OCIError,
        type_: *mut OCIType,
        builtin_info: *mut OCIParam,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeAddAttr(
        svchp: *mut OCISvcCtx,
        errhp: *mut OCIError,
        type_: *mut OCIType,
        a_name: *const oratext,
        a_length: ub4,
        attr_info: *mut OCIParam,
    ) -> sword;
}
extern "C" {
    pub fn OCITypeEndCreate(
        svchp: *mut OCISvcCtx,
        errhp: *mut OCIError,
        type_: *mut OCIType,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectNew(
        env: *mut OCIEnv,
        err: *mut OCIError,
        svc: *const OCISvcCtx,
        typecode: OCITypeCode,
        tdo: *mut OCIType,
        table: *mut ::std::os::raw::c_void,
        duration: OCIDuration,
        value: boolean,
        instance: *mut *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectPin(
        env: *mut OCIEnv,
        err: *mut OCIError,
        object_ref: *mut OCIRef,
        corhdl: *mut OCIComplexObject,
        pin_option: OCIPinOpt,
        pin_duration: OCIDuration,
        lock_option: OCILockOpt,
        object: *mut *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectUnpin(
        env: *mut OCIEnv,
        err: *mut OCIError,
        object: *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectPinCountReset(
        env: *mut OCIEnv,
        err: *mut OCIError,
        object: *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectLock(
        env: *mut OCIEnv,
        err: *mut OCIError,
        object: *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectLockNoWait(
        env: *mut OCIEnv,
        err: *mut OCIError,
        object: *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectMarkUpdate(
        env: *mut OCIEnv,
        err: *mut OCIError,
        object: *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectUnmark(
        env: *mut OCIEnv,
        err: *mut OCIError,
        object: *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectUnmarkByRef(env: *mut OCIEnv, err: *mut OCIError, ref_: *mut OCIRef) -> sword;
}
extern "C" {
    pub fn OCIObjectFree(
        env: *mut OCIEnv,
        err: *mut OCIError,
        instance: *mut ::std::os::raw::c_void,
        flags: ub2,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectMarkDeleteByRef(
        env: *mut OCIEnv,
        err: *mut OCIError,
        object_ref: *mut OCIRef,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectMarkDelete(
        env: *mut OCIEnv,
        err: *mut OCIError,
        instance: *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectFlush(
        env: *mut OCIEnv,
        err: *mut OCIError,
        object: *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectRefresh(
        env: *mut OCIEnv,
        err: *mut OCIError,
        object: *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectCopy(
        env: *mut OCIEnv,
        err: *mut OCIError,
        svc: *const OCISvcCtx,
        source: *mut ::std::os::raw::c_void,
        null_source: *mut ::std::os::raw::c_void,
        target: *mut ::std::os::raw::c_void,
        null_target: *mut ::std::os::raw::c_void,
        tdo: *mut OCIType,
        duration: OCIDuration,
        option: ub1,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectGetTypeRef(
        env: *mut OCIEnv,
        err: *mut OCIError,
        instance: *mut ::std::os::raw::c_void,
        type_ref: *mut OCIRef,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectGetObjectRef(
        env: *mut OCIEnv,
        err: *mut OCIError,
        object: *mut ::std::os::raw::c_void,
        object_ref: *mut OCIRef,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectMakeObjectRef(
        env: *mut OCIEnv,
        err: *mut OCIError,
        svc: *const OCISvcCtx,
        table: *mut ::std::os::raw::c_void,
        values: *mut *mut ::std::os::raw::c_void,
        array_len: ub4,
        object_ref: *mut OCIRef,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectGetPrimaryKeyTypeRef(
        env: *mut OCIEnv,
        err: *mut OCIError,
        svc: *const OCISvcCtx,
        table: *mut ::std::os::raw::c_void,
        type_ref: *mut OCIRef,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectGetInd(
        env: *mut OCIEnv,
        err: *mut OCIError,
        instance: *mut ::std::os::raw::c_void,
        null_struct: *mut *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectExists(
        env: *mut OCIEnv,
        err: *mut OCIError,
        ins: *mut ::std::os::raw::c_void,
        exist: *mut boolean,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectGetProperty(
        envh: *mut OCIEnv,
        errh: *mut OCIError,
        obj: *const ::std::os::raw::c_void,
        propertyId: OCIObjectPropId,
        property: *mut ::std::os::raw::c_void,
        size: *mut ub4,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectIsLocked(
        env: *mut OCIEnv,
        err: *mut OCIError,
        ins: *mut ::std::os::raw::c_void,
        lock: *mut boolean,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectIsDirty(
        env: *mut OCIEnv,
        err: *mut OCIError,
        ins: *mut ::std::os::raw::c_void,
        dirty: *mut boolean,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectPinTable(
        env: *mut OCIEnv,
        err: *mut OCIError,
        svc: *const OCISvcCtx,
        schema_name: *const oratext,
        s_n_length: ub4,
        object_name: *const oratext,
        o_n_length: ub4,
        scope_obj_ref: *const OCIRef,
        pin_duration: OCIDuration,
        object: *mut *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectArrayPin(
        env: *mut OCIEnv,
        err: *mut OCIError,
        ref_array: *mut *mut OCIRef,
        array_size: ub4,
        cor_array: *mut *mut OCIComplexObject,
        cor_array_size: ub4,
        pin_option: OCIPinOpt,
        pin_duration: OCIDuration,
        lock: OCILockOpt,
        obj_array: *mut *mut ::std::os::raw::c_void,
        pos: *mut ub4,
    ) -> sword;
}
extern "C" {
    pub fn OCICacheFlush(
        env: *mut OCIEnv,
        err: *mut OCIError,
        svc: *const OCISvcCtx,
        context: *mut ::std::os::raw::c_void,
        get: ::std::option::Option<
            unsafe extern "C" fn(
                context: *mut ::std::os::raw::c_void,
                last: *mut ub1,
            ) -> *mut OCIRef,
        >,
        ref_: *mut *mut OCIRef,
    ) -> sword;
}
extern "C" {
    pub fn OCICacheRefresh(
        env: *mut OCIEnv,
        err: *mut OCIError,
        svc: *const OCISvcCtx,
        option: OCIRefreshOpt,
        context: *mut ::std::os::raw::c_void,
        get: ::std::option::Option<
            unsafe extern "C" fn(context: *mut ::std::os::raw::c_void) -> *mut OCIRef,
        >,
        ref_: *mut *mut OCIRef,
    ) -> sword;
}
extern "C" {
    pub fn OCICacheUnpin(env: *mut OCIEnv, err: *mut OCIError, svc: *const OCISvcCtx) -> sword;
}
extern "C" {
    pub fn OCICacheFree(env: *mut OCIEnv, err: *mut OCIError, svc: *const OCISvcCtx) -> sword;
}
extern "C" {
    pub fn OCICacheUnmark(env: *mut OCIEnv, err: *mut OCIError, svc: *const OCISvcCtx) -> sword;
}
extern "C" {
    pub fn OCIDurationBegin(
        env: *mut OCIEnv,
        err: *mut OCIError,
        svc: *const OCISvcCtx,
        parent: OCIDuration,
        dur: *mut OCIDuration,
    ) -> sword;
}
extern "C" {
    pub fn OCIDurationEnd(
        env: *mut OCIEnv,
        err: *mut OCIError,
        svc: *const OCISvcCtx,
        duration: OCIDuration,
    ) -> sword;
}
extern "C" {
    #[doc = "          DO  NOT  USE  THE  FUNCTIONS  BELOW!                             **"]
    #[doc = "          UNSUPPORTED INTERFACE                                            **"]
    #[doc = "          WILL BE REMOVED/CHANGED IN A FUTURE RELEASE                      **"]
    pub fn OCIDurationGetParent(
        env: *mut OCIEnv,
        err: *mut OCIError,
        duration: OCIDuration,
        parent: *mut OCIDuration,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectAlwaysLatest(
        env: *mut OCIEnv,
        err: *mut OCIError,
        object: *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectNotAlwaysLatest(
        env: *mut OCIEnv,
        err: *mut OCIError,
        object: *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectFlushRefresh(
        env: *mut OCIEnv,
        err: *mut OCIError,
        object: *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectIsLoaded(
        env: *mut OCIEnv,
        err: *mut OCIError,
        ins: *mut ::std::os::raw::c_void,
        load: *mut boolean,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectIsDirtied(
        env: *mut OCIEnv,
        err: *mut OCIError,
        ins: *mut ::std::os::raw::c_void,
        dirty: *mut boolean,
    ) -> sword;
}
extern "C" {
    pub fn OCICacheGetObjects(
        env: *mut OCIEnv,
        err: *mut OCIError,
        svc: *const OCISvcCtx,
        property: OCIObjectProperty,
        client_context: *mut ::std::os::raw::c_void,
        client_callback: ::std::option::Option<
            unsafe extern "C" fn(
                client_context: *mut ::std::os::raw::c_void,
                object: *mut ::std::os::raw::c_void,
            ),
        >,
    ) -> sword;
}
extern "C" {
    pub fn OCICacheRegister(
        env: *mut OCIEnv,
        err: *mut OCIError,
        event: OCIObjectEvent,
        client_context: *mut ::std::os::raw::c_void,
        client_callback: ::std::option::Option<
            unsafe extern "C" fn(
                client_context: *mut ::std::os::raw::c_void,
                event: OCIObjectEvent,
                object: *mut ::std::os::raw::c_void,
            ),
        >,
    ) -> sword;
}
extern "C" {
    pub fn OCICacheFlushRefresh(
        env: *mut OCIEnv,
        err: *mut OCIError,
        svc: *const OCISvcCtx,
        context: *mut ::std::os::raw::c_void,
        get: ::std::option::Option<
            unsafe extern "C" fn(
                context: *mut ::std::os::raw::c_void,
                last: *mut ub1,
            ) -> *mut OCIRef,
        >,
        ref_: *mut *mut OCIRef,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectSetData(
        env: *mut OCIEnv,
        err: *mut OCIError,
        obj_hdr: *mut ::std::os::raw::c_void,
        data: *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCIObjectGetNewOID(
        env: *mut OCIEnv,
        err: *mut OCIError,
        svc: *mut OCISvcCtx,
        oid: *mut ub1,
    ) -> sword;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCINumber {
    pub OCINumberPart: [ub1; 22usize],
}
#[test]
fn bindgen_test_layout_OCINumber() {
    assert_eq!(
        ::std::mem::size_of::<OCINumber>(),
        22usize,
        concat!("Size of: ", stringify!(OCINumber))
    );
    assert_eq!(
        ::std::mem::align_of::<OCINumber>(),
        1usize,
        concat!("Alignment of ", stringify!(OCINumber))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OCINumber>())).OCINumberPart as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OCINumber),
            "::",
            stringify!(OCINumberPart)
        )
    );
}
extern "C" {
    pub fn OCINumberInc(err: *mut OCIError, number: *mut OCINumber) -> sword;
}
extern "C" {
    pub fn OCINumberDec(err: *mut OCIError, number: *mut OCINumber) -> sword;
}
extern "C" {
    pub fn OCINumberSetZero(err: *mut OCIError, num: *mut OCINumber);
}
extern "C" {
    pub fn OCINumberSetPi(err: *mut OCIError, num: *mut OCINumber);
}
extern "C" {
    pub fn OCINumberAdd(
        err: *mut OCIError,
        number1: *const OCINumber,
        number2: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberSub(
        err: *mut OCIError,
        number1: *const OCINumber,
        number2: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberMul(
        err: *mut OCIError,
        number1: *const OCINumber,
        number2: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberDiv(
        err: *mut OCIError,
        number1: *const OCINumber,
        number2: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberMod(
        err: *mut OCIError,
        number1: *const OCINumber,
        number2: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberIntPower(
        err: *mut OCIError,
        base: *const OCINumber,
        exp: sword,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberShift(
        err: *mut OCIError,
        number: *const OCINumber,
        nDig: sword,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberNeg(
        err: *mut OCIError,
        number: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberToText(
        err: *mut OCIError,
        number: *const OCINumber,
        fmt: *const oratext,
        fmt_length: ub4,
        nls_params: *const oratext,
        nls_p_length: ub4,
        buf_size: *mut ub4,
        buf: *mut oratext,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberFromText(
        err: *mut OCIError,
        str: *const oratext,
        str_length: ub4,
        fmt: *const oratext,
        fmt_length: ub4,
        nls_params: *const oratext,
        nls_p_length: ub4,
        number: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberToInt(
        err: *mut OCIError,
        number: *const OCINumber,
        rsl_length: uword,
        rsl_flag: uword,
        rsl: *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberFromInt(
        err: *mut OCIError,
        inum: *const ::std::os::raw::c_void,
        inum_length: uword,
        inum_s_flag: uword,
        number: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberToReal(
        err: *mut OCIError,
        number: *const OCINumber,
        rsl_length: uword,
        rsl: *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberToRealArray(
        err: *mut OCIError,
        number: *mut *const OCINumber,
        elems: uword,
        rsl_length: uword,
        rsl: *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberFromReal(
        err: *mut OCIError,
        rnum: *const ::std::os::raw::c_void,
        rnum_length: uword,
        number: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberCmp(
        err: *mut OCIError,
        number1: *const OCINumber,
        number2: *const OCINumber,
        result: *mut sword,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberSign(err: *mut OCIError, number: *const OCINumber, result: *mut sword)
        -> sword;
}
extern "C" {
    pub fn OCINumberIsZero(
        err: *mut OCIError,
        number: *const OCINumber,
        result: *mut boolean,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberIsInt(
        err: *mut OCIError,
        number: *const OCINumber,
        result: *mut boolean,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberAssign(err: *mut OCIError, from: *const OCINumber, to: *mut OCINumber)
        -> sword;
}
extern "C" {
    pub fn OCINumberAbs(
        err: *mut OCIError,
        number: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberCeil(
        err: *mut OCIError,
        number: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberFloor(
        err: *mut OCIError,
        number: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberSqrt(
        err: *mut OCIError,
        number: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberTrunc(
        err: *mut OCIError,
        number: *const OCINumber,
        decplace: sword,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberPower(
        err: *mut OCIError,
        base: *const OCINumber,
        number: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberRound(
        err: *mut OCIError,
        number: *const OCINumber,
        decplace: sword,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberPrec(
        err: *mut OCIError,
        number: *const OCINumber,
        nDigs: sword,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberSin(
        err: *mut OCIError,
        number: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberArcSin(
        err: *mut OCIError,
        number: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberHypSin(
        err: *mut OCIError,
        number: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberCos(
        err: *mut OCIError,
        number: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberArcCos(
        err: *mut OCIError,
        number: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberHypCos(
        err: *mut OCIError,
        number: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberTan(
        err: *mut OCIError,
        number: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberArcTan(
        err: *mut OCIError,
        number: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberArcTan2(
        err: *mut OCIError,
        number1: *const OCINumber,
        number2: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberHypTan(
        err: *mut OCIError,
        number: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberExp(
        err: *mut OCIError,
        number: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberLn(
        err: *mut OCIError,
        number: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
extern "C" {
    pub fn OCINumberLog(
        err: *mut OCIError,
        base: *const OCINumber,
        number: *const OCINumber,
        result: *mut OCINumber,
    ) -> sword;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCITime {
    pub OCITimeHH: ub1,
    pub OCITimeMI: ub1,
    pub OCITimeSS: ub1,
}
#[test]
fn bindgen_test_layout_OCITime() {
    assert_eq!(
        ::std::mem::size_of::<OCITime>(),
        3usize,
        concat!("Size of: ", stringify!(OCITime))
    );
    assert_eq!(
        ::std::mem::align_of::<OCITime>(),
        1usize,
        concat!("Alignment of ", stringify!(OCITime))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OCITime>())).OCITimeHH as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OCITime),
            "::",
            stringify!(OCITimeHH)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OCITime>())).OCITimeMI as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(OCITime),
            "::",
            stringify!(OCITimeMI)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OCITime>())).OCITimeSS as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(OCITime),
            "::",
            stringify!(OCITimeSS)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIDate {
    pub OCIDateYYYY: sb2,
    pub OCIDateMM: ub1,
    pub OCIDateDD: ub1,
    pub OCIDateTime: OCITime,
}
#[test]
fn bindgen_test_layout_OCIDate() {
    assert_eq!(
        ::std::mem::size_of::<OCIDate>(),
        8usize,
        concat!("Size of: ", stringify!(OCIDate))
    );
    assert_eq!(
        ::std::mem::align_of::<OCIDate>(),
        2usize,
        concat!("Alignment of ", stringify!(OCIDate))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OCIDate>())).OCIDateYYYY as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OCIDate),
            "::",
            stringify!(OCIDateYYYY)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OCIDate>())).OCIDateMM as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(OCIDate),
            "::",
            stringify!(OCIDateMM)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OCIDate>())).OCIDateDD as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(OCIDate),
            "::",
            stringify!(OCIDateDD)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OCIDate>())).OCIDateTime as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OCIDate),
            "::",
            stringify!(OCIDateTime)
        )
    );
}
extern "C" {
    pub fn OCIDateAssign(err: *mut OCIError, from: *const OCIDate, to: *mut OCIDate) -> sword;
}
extern "C" {
    pub fn OCIDateToText(
        err: *mut OCIError,
        date: *const OCIDate,
        fmt: *const oratext,
        fmt_length: ub1,
        lang_name: *const oratext,
        lang_length: ub4,
        buf_size: *mut ub4,
        buf: *mut oratext,
    ) -> sword;
}
extern "C" {
    pub fn OCIDateFromText(
        err: *mut OCIError,
        date_str: *const oratext,
        d_str_length: ub4,
        fmt: *const oratext,
        fmt_length: ub1,
        lang_name: *const oratext,
        lang_length: ub4,
        date: *mut OCIDate,
    ) -> sword;
}
extern "C" {
    pub fn OCIDateCompare(
        err: *mut OCIError,
        date1: *const OCIDate,
        date2: *const OCIDate,
        result: *mut sword,
    ) -> sword;
}
extern "C" {
    pub fn OCIDateAddMonths(
        err: *mut OCIError,
        date: *const OCIDate,
        num_months: sb4,
        result: *mut OCIDate,
    ) -> sword;
}
extern "C" {
    pub fn OCIDateAddDays(
        err: *mut OCIError,
        date: *const OCIDate,
        num_days: sb4,
        result: *mut OCIDate,
    ) -> sword;
}
extern "C" {
    pub fn OCIDateLastDay(
        err: *mut OCIError,
        date: *const OCIDate,
        last_day: *mut OCIDate,
    ) -> sword;
}
extern "C" {
    pub fn OCIDateDaysBetween(
        err: *mut OCIError,
        date1: *const OCIDate,
        date2: *const OCIDate,
        num_days: *mut sb4,
    ) -> sword;
}
extern "C" {
    pub fn OCIDateZoneToZone(
        err: *mut OCIError,
        date1: *const OCIDate,
        zon1: *const oratext,
        zon1_length: ub4,
        zon2: *const oratext,
        zon2_length: ub4,
        date2: *mut OCIDate,
    ) -> sword;
}
extern "C" {
    pub fn OCIDateNextDay(
        err: *mut OCIError,
        date: *const OCIDate,
        day_p: *const oratext,
        day_length: ub4,
        next_day: *mut OCIDate,
    ) -> sword;
}
extern "C" {
    pub fn OCIDateCheck(err: *mut OCIError, date: *const OCIDate, valid: *mut uword) -> sword;
}
extern "C" {
    pub fn OCIDateSysDate(err: *mut OCIError, sys_date: *mut OCIDate) -> sword;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIString {
    _unused: [u8; 0],
}
extern "C" {
    pub fn OCIStringAssign(
        env: *mut OCIEnv,
        err: *mut OCIError,
        rhs: *const OCIString,
        lhs: *mut *mut OCIString,
    ) -> sword;
}
extern "C" {
    pub fn OCIStringAssignText(
        env: *mut OCIEnv,
        err: *mut OCIError,
        rhs: *const oratext,
        rhs_len: ub4,
        lhs: *mut *mut OCIString,
    ) -> sword;
}
extern "C" {
    pub fn OCIStringResize(
        env: *mut OCIEnv,
        err: *mut OCIError,
        new_size: ub4,
        str: *mut *mut OCIString,
    ) -> sword;
}
extern "C" {
    pub fn OCIStringSize(env: *mut OCIEnv, vs: *const OCIString) -> ub4;
}
extern "C" {
    pub fn OCIStringPtr(env: *mut OCIEnv, vs: *const OCIString) -> *mut oratext;
}
extern "C" {
    pub fn OCIStringAllocSize(
        env: *mut OCIEnv,
        err: *mut OCIError,
        vs: *const OCIString,
        allocsize: *mut ub4,
    ) -> sword;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIRaw {
    _unused: [u8; 0],
}
extern "C" {
    pub fn OCIRawAssignRaw(
        env: *mut OCIEnv,
        err: *mut OCIError,
        rhs: *const OCIRaw,
        lhs: *mut *mut OCIRaw,
    ) -> sword;
}
extern "C" {
    pub fn OCIRawAssignBytes(
        env: *mut OCIEnv,
        err: *mut OCIError,
        rhs: *const ub1,
        rhs_len: ub4,
        lhs: *mut *mut OCIRaw,
    ) -> sword;
}
extern "C" {
    pub fn OCIRawResize(
        env: *mut OCIEnv,
        err: *mut OCIError,
        new_size: ub4,
        raw: *mut *mut OCIRaw,
    ) -> sword;
}
extern "C" {
    pub fn OCIRawSize(env: *mut OCIEnv, raw: *const OCIRaw) -> ub4;
}
extern "C" {
    pub fn OCIRawPtr(env: *mut OCIEnv, raw: *const OCIRaw) -> *mut ub1;
}
extern "C" {
    pub fn OCIRawAllocSize(
        env: *mut OCIEnv,
        err: *mut OCIError,
        raw: *const OCIRaw,
        allocsize: *mut ub4,
    ) -> sword;
}
extern "C" {
    pub fn OCIRefClear(env: *mut OCIEnv, ref_: *mut OCIRef);
}
extern "C" {
    pub fn OCIRefAssign(
        env: *mut OCIEnv,
        err: *mut OCIError,
        source: *const OCIRef,
        target: *mut *mut OCIRef,
    ) -> sword;
}
extern "C" {
    pub fn OCIRefIsEqual(env: *mut OCIEnv, x: *const OCIRef, y: *const OCIRef) -> boolean;
}
extern "C" {
    pub fn OCIRefIsNull(env: *mut OCIEnv, ref_: *const OCIRef) -> boolean;
}
extern "C" {
    pub fn OCIRefHexSize(env: *mut OCIEnv, ref_: *const OCIRef) -> ub4;
}
extern "C" {
    pub fn OCIRefFromHex(
        env: *mut OCIEnv,
        err: *mut OCIError,
        svc: *const OCISvcCtx,
        hex: *const oratext,
        length: ub4,
        ref_: *mut *mut OCIRef,
    ) -> sword;
}
extern "C" {
    pub fn OCIRefToHex(
        env: *mut OCIEnv,
        err: *mut OCIError,
        ref_: *const OCIRef,
        hex: *mut oratext,
        hex_length: *mut ub4,
    ) -> sword;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIColl {
    _unused: [u8; 0],
}
pub type OCIArray = OCIColl;
pub type OCITable = OCIColl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIIter {
    _unused: [u8; 0],
}
extern "C" {
    pub fn OCICollSize(
        env: *mut OCIEnv,
        err: *mut OCIError,
        coll: *const OCIColl,
        size: *mut sb4,
    ) -> sword;
}
extern "C" {
    pub fn OCICollMax(env: *mut OCIEnv, coll: *const OCIColl) -> sb4;
}
extern "C" {
    pub fn OCICollGetElem(
        env: *mut OCIEnv,
        err: *mut OCIError,
        coll: *const OCIColl,
        index: sb4,
        exists: *mut boolean,
        elem: *mut *mut ::std::os::raw::c_void,
        elemind: *mut *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCICollGetElemArray(
        env: *mut OCIEnv,
        err: *mut OCIError,
        coll: *const OCIColl,
        index: sb4,
        exists: *mut boolean,
        elem: *mut *mut ::std::os::raw::c_void,
        elemind: *mut *mut ::std::os::raw::c_void,
        nelems: *mut uword,
    ) -> sword;
}
extern "C" {
    pub fn OCICollAssignElem(
        env: *mut OCIEnv,
        err: *mut OCIError,
        index: sb4,
        elem: *const ::std::os::raw::c_void,
        elemind: *const ::std::os::raw::c_void,
        coll: *mut OCIColl,
    ) -> sword;
}
extern "C" {
    pub fn OCICollAssign(
        env: *mut OCIEnv,
        err: *mut OCIError,
        rhs: *const OCIColl,
        lhs: *mut OCIColl,
    ) -> sword;
}
extern "C" {
    pub fn OCICollAppend(
        env: *mut OCIEnv,
        err: *mut OCIError,
        elem: *const ::std::os::raw::c_void,
        elemind: *const ::std::os::raw::c_void,
        coll: *mut OCIColl,
    ) -> sword;
}
extern "C" {
    pub fn OCICollTrim(
        env: *mut OCIEnv,
        err: *mut OCIError,
        trim_num: sb4,
        coll: *mut OCIColl,
    ) -> sword;
}
extern "C" {
    pub fn OCICollIsLocator(
        env: *mut OCIEnv,
        err: *mut OCIError,
        coll: *const OCIColl,
        result: *mut boolean,
    ) -> sword;
}
extern "C" {
    pub fn OCIIterCreate(
        env: *mut OCIEnv,
        err: *mut OCIError,
        coll: *const OCIColl,
        itr: *mut *mut OCIIter,
    ) -> sword;
}
extern "C" {
    pub fn OCIIterDelete(env: *mut OCIEnv, err: *mut OCIError, itr: *mut *mut OCIIter) -> sword;
}
extern "C" {
    pub fn OCIIterInit(
        env: *mut OCIEnv,
        err: *mut OCIError,
        coll: *const OCIColl,
        itr: *mut OCIIter,
    ) -> sword;
}
extern "C" {
    pub fn OCIIterGetCurrent(
        env: *mut OCIEnv,
        err: *mut OCIError,
        itr: *const OCIIter,
        elem: *mut *mut ::std::os::raw::c_void,
        elemind: *mut *mut ::std::os::raw::c_void,
    ) -> sword;
}
extern "C" {
    pub fn OCIIterNext(
        env: *mut OCIEnv,
        err: *mut OCIError,
        itr: *mut OCIIter,
        elem: *mut *mut ::std::os::raw::c_void,
        elemind: *mut *mut ::std::os::raw::c_void,
        eoc: *mut boolean,
    ) -> sword;
}
extern "C" {
    pub fn OCIIterPrev(
        env: *mut OCIEnv,
        err: *mut OCIError,
        itr: *mut OCIIter,
        elem: *mut *mut ::std::os::raw::c_void,
        elemind: *mut *mut ::std::os::raw::c_void,
        boc: *mut boolean,
    ) -> sword;
}
extern "C" {
    pub fn OCITableSize(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tbl: *const OCITable,
        size: *mut sb4,
    ) -> sword;
}
extern "C" {
    pub fn OCITableExists(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tbl: *const OCITable,
        index: sb4,
        exists: *mut boolean,
    ) -> sword;
}
extern "C" {
    pub fn OCITableDelete(
        env: *mut OCIEnv,
        err: *mut OCIError,
        index: sb4,
        tbl: *mut OCITable,
    ) -> sword;
}
extern "C" {
    pub fn OCITableFirst(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tbl: *const OCITable,
        index: *mut sb4,
    ) -> sword;
}
extern "C" {
    pub fn OCITableLast(
        env: *mut OCIEnv,
        err: *mut OCIError,
        tbl: *const OCITable,
        index: *mut sb4,
    ) -> sword;
}
extern "C" {
    pub fn OCITableNext(
        env: *mut OCIEnv,
        err: *mut OCIError,
        index: sb4,
        tbl: *const OCITable,
        next_index: *mut sb4,
        exists: *mut boolean,
    ) -> sword;
}
extern "C" {
    pub fn OCITablePrev(
        env: *mut OCIEnv,
        err: *mut OCIError,
        index: sb4,
        tbl: *const OCITable,
        prev_index: *mut sb4,
        exists: *mut boolean,
    ) -> sword;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIXMLType {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIDOMDocument {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIBinXmlReposCtx {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCIExtProcContext {
    _unused: [u8; 0],
}
extern "C" {
    pub fn ociepacm(
        with_context: *mut OCIExtProcContext,
        amount: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ocieperr(
        with_context: *mut OCIExtProcContext,
        error_number: ::std::os::raw::c_int,
    ) -> size_t;
}
extern "C" {
    pub fn ociepmsg(
        with_context: *mut OCIExtProcContext,
        error_number: ::std::os::raw::c_int,
        error_message: *mut oratext,
        len: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn ociepgoe(
        with_context: *mut OCIExtProcContext,
        envh: *mut *mut OCIEnv,
        svch: *mut *mut OCISvcCtx,
        errh: *mut *mut OCIError,
    ) -> sword;
}
extern "C" {
    pub fn obindps(
        cursor: *mut cda_def,
        opcode: ub1,
        sqlvar: *mut OraText,
        sqlvl: sb4,
        pvctx: *mut ub1,
        progvl: sb4,
        ftype: sword,
        scale: sword,
        indp: *mut sb2,
        alen: *mut ub2,
        arcode: *mut ub2,
        pv_skip: sb4,
        ind_skip: sb4,
        alen_skip: sb4,
        rc_skip: sb4,
        maxsiz: ub4,
        cursiz: *mut ub4,
        fmt: *mut OraText,
        fmtl: sb4,
        fmtt: sword,
    ) -> sword;
}
extern "C" {
    pub fn obreak(lda: *mut cda_def) -> sword;
}
extern "C" {
    pub fn ocan(cursor: *mut cda_def) -> sword;
}
extern "C" {
    pub fn oclose(cursor: *mut cda_def) -> sword;
}
extern "C" {
    pub fn ocof(lda: *mut cda_def) -> sword;
}
extern "C" {
    pub fn ocom(lda: *mut cda_def) -> sword;
}
extern "C" {
    pub fn ocon(lda: *mut cda_def) -> sword;
}
extern "C" {
    pub fn odefinps(
        cursor: *mut cda_def,
        opcode: ub1,
        pos: sword,
        bufctx: *mut ub1,
        bufl: sb4,
        ftype: sword,
        scale: sword,
        indp: *mut sb2,
        fmt: *mut OraText,
        fmtl: sb4,
        fmtt: sword,
        rlen: *mut ub2,
        rcode: *mut ub2,
        pv_skip: sb4,
        ind_skip: sb4,
        alen_skip: sb4,
        rc_skip: sb4,
    ) -> sword;
}
extern "C" {
    pub fn odessp(
        cursor: *mut cda_def,
        objnam: *mut OraText,
        onlen: size_t,
        rsv1: *mut ub1,
        rsv1ln: size_t,
        rsv2: *mut ub1,
        rsv2ln: size_t,
        ovrld: *mut ub2,
        pos: *mut ub2,
        level: *mut ub2,
        argnam: *mut *mut OraText,
        arnlen: *mut ub2,
        dtype: *mut ub2,
        defsup: *mut ub1,
        mode: *mut ub1,
        dtsiz: *mut ub4,
        prec: *mut sb2,
        scale: *mut sb2,
        radix: *mut ub1,
        spare: *mut ub4,
        arrsiz: *mut ub4,
    ) -> sword;
}
extern "C" {
    pub fn odescr(
        cursor: *mut cda_def,
        pos: sword,
        dbsize: *mut sb4,
        dbtype: *mut sb2,
        cbuf: *mut sb1,
        cbufl: *mut sb4,
        dsize: *mut sb4,
        prec: *mut sb2,
        scale: *mut sb2,
        nullok: *mut sb2,
    ) -> sword;
}
extern "C" {
    pub fn oerhms(lda: *mut cda_def, rcode: sb2, buf: *mut OraText, bufsiz: sword) -> sword;
}
extern "C" {
    pub fn oermsg(rcode: sb2, buf: *mut OraText) -> sword;
}
extern "C" {
    pub fn oexec(cursor: *mut cda_def) -> sword;
}
extern "C" {
    pub fn oexfet(cursor: *mut cda_def, nrows: ub4, cancel: sword, exact: sword) -> sword;
}
extern "C" {
    pub fn oexn(cursor: *mut cda_def, iters: sword, rowoff: sword) -> sword;
}
extern "C" {
    pub fn ofen(cursor: *mut cda_def, nrows: sword) -> sword;
}
extern "C" {
    pub fn ofetch(cursor: *mut cda_def) -> sword;
}
extern "C" {
    pub fn oflng(
        cursor: *mut cda_def,
        pos: sword,
        buf: *mut ub1,
        bufl: sb4,
        dtype: sword,
        retl: *mut ub4,
        offset: sb4,
    ) -> sword;
}
extern "C" {
    pub fn ogetpi(
        cursor: *mut cda_def,
        piecep: *mut ub1,
        ctxpp: *mut *mut ::std::os::raw::c_void,
        iterp: *mut ub4,
        indexp: *mut ub4,
    ) -> sword;
}
extern "C" {
    pub fn oopt(cursor: *mut cda_def, rbopt: sword, waitopt: sword) -> sword;
}
extern "C" {
    pub fn opinit(mode: ub4) -> sword;
}
extern "C" {
    pub fn olog(
        lda: *mut cda_def,
        hda: *mut ub1,
        uid: *mut OraText,
        uidl: sword,
        pswd: *mut OraText,
        pswdl: sword,
        conn: *mut OraText,
        connl: sword,
        mode: ub4,
    ) -> sword;
}
extern "C" {
    pub fn ologof(lda: *mut cda_def) -> sword;
}
extern "C" {
    pub fn oopen(
        cursor: *mut cda_def,
        lda: *mut cda_def,
        dbn: *mut OraText,
        dbnl: sword,
        arsize: sword,
        uid: *mut OraText,
        uidl: sword,
    ) -> sword;
}
extern "C" {
    pub fn oparse(
        cursor: *mut cda_def,
        sqlstm: *mut OraText,
        sqllen: sb4,
        defflg: sword,
        lngflg: ub4,
    ) -> sword;
}
extern "C" {
    pub fn orol(lda: *mut cda_def) -> sword;
}
extern "C" {
    pub fn osetpi(
        cursor: *mut cda_def,
        piece: ub1,
        bufp: *mut ::std::os::raw::c_void,
        lenp: *mut ub4,
    ) -> sword;
}
extern "C" {
    pub fn sqlld2(lda: *mut cda_def, cname: *mut OraText, cnlen: *mut sb4);
}
extern "C" {
    pub fn sqllda(lda: *mut cda_def);
}
extern "C" {
    pub fn onbset(lda: *mut cda_def) -> sword;
}
extern "C" {
    pub fn onbtst(lda: *mut cda_def) -> sword;
}
extern "C" {
    pub fn onbclr(lda: *mut cda_def) -> sword;
}
extern "C" {
    pub fn ognfd(lda: *mut cda_def, fdp: *mut ::std::os::raw::c_void) -> sword;
}
extern "C" {
    pub fn obndra(
        cursor: *mut cda_def,
        sqlvar: *mut OraText,
        sqlvl: sword,
        progv: *mut ub1,
        progvl: sword,
        ftype: sword,
        scale: sword,
        indp: *mut sb2,
        alen: *mut ub2,
        arcode: *mut ub2,
        maxsiz: ub4,
        cursiz: *mut ub4,
        fmt: *mut OraText,
        fmtl: sword,
        fmtt: sword,
    ) -> sword;
}
extern "C" {
    pub fn obndrn(
        cursor: *mut cda_def,
        sqlvn: sword,
        progv: *mut ub1,
        progvl: sword,
        ftype: sword,
        scale: sword,
        indp: *mut sb2,
        fmt: *mut OraText,
        fmtl: sword,
        fmtt: sword,
    ) -> sword;
}
extern "C" {
    pub fn obndrv(
        cursor: *mut cda_def,
        sqlvar: *mut OraText,
        sqlvl: sword,
        progv: *mut ub1,
        progvl: sword,
        ftype: sword,
        scale: sword,
        indp: *mut sb2,
        fmt: *mut OraText,
        fmtl: sword,
        fmtt: sword,
    ) -> sword;
}
extern "C" {
    pub fn odefin(
        cursor: *mut cda_def,
        pos: sword,
        buf: *mut ub1,
        bufl: sword,
        ftype: sword,
        scale: sword,
        indp: *mut sb2,
        fmt: *mut OraText,
        fmtl: sword,
        fmtt: sword,
        rlen: *mut ub2,
        rcode: *mut ub2,
    ) -> sword;
}
extern "C" {
    pub fn oname(
        cursor: *mut cda_def,
        pos: sword,
        tbuf: *mut sb1,
        tbufl: *mut sb2,
        buf: *mut sb1,
        bufl: *mut sb2,
    ) -> sword;
}
extern "C" {
    pub fn orlon(
        lda: *mut cda_def,
        hda: *mut ub1,
        uid: *mut OraText,
        uidl: sword,
        pswd: *mut OraText,
        pswdl: sword,
        audit: sword,
    ) -> sword;
}
extern "C" {
    pub fn olon(
        lda: *mut cda_def,
        uid: *mut OraText,
        uidl: sword,
        pswd: *mut OraText,
        pswdl: sword,
        audit: sword,
    ) -> sword;
}
extern "C" {
    pub fn osql3(cda: *mut cda_def, sqlstm: *mut OraText, sqllen: sword) -> sword;
}
extern "C" {
    pub fn odsc(
        cursor: *mut cda_def,
        pos: sword,
        dbsize: *mut sb2,
        fsize: *mut sb2,
        rcode: *mut sb2,
        dtype: *mut sb2,
        buf: *mut sb1,
        bufl: *mut sb2,
        dsize: *mut sb2,
    ) -> sword;
}
pub const nzerror_NZERROR_OK: nzerror = 0;
pub const nzerror_NZERROR_GENERIC: nzerror = 28750;
pub const nzerror_NZERROR_NO_MEMORY: nzerror = 28751;
pub const nzerror_NZERROR_DATA_SOURCE_INIT_FAILED: nzerror = 28752;
pub const nzerror_NZERROR_DATA_SOURCE_TERM_FAILED: nzerror = 28753;
pub const nzerror_NZERROR_OBJECT_STORE_FAILED: nzerror = 28754;
pub const nzerror_NZERROR_OBJECT_GET_FAILED: nzerror = 28755;
pub const nzerror_NZERROR_MEMORY_ALLOC_FAILED: nzerror = 28756;
pub const nzerror_NZERROR_MEMORY_ALLOC_0_BYTES: nzerror = 28757;
pub const nzerror_NZERROR_MEMORY_FREE_FAILED: nzerror = 28758;
pub const nzerror_NZERROR_FILE_OPEN_FAILED: nzerror = 28759;
pub const nzerror_NZERROR_LIST_CREATION_FAILED: nzerror = 28760;
pub const nzerror_NZERROR_NO_ELEMENT: nzerror = 28761;
pub const nzerror_NZERROR_ELEMENT_ADD_FAILED: nzerror = 28762;
pub const nzerror_NZERROR_PARAMETER_BAD_TYPE: nzerror = 28763;
pub const nzerror_NZERROR_PARAMETER_RETRIEVAL: nzerror = 28764;
pub const nzerror_NZERROR_NO_LIST: nzerror = 28765;
pub const nzerror_NZERROR_TERMINATE_FAIL: nzerror = 28766;
pub const nzerror_NZERROR_BAD_VERSION_NUMBER: nzerror = 28767;
pub const nzerror_NZERROR_BAD_MAGIC_NUMBER: nzerror = 28768;
pub const nzerror_NZERROR_METHOD_NOT_FOUND: nzerror = 28769;
pub const nzerror_NZERROR_ALREADY_INITIALIZED: nzerror = 28770;
pub const nzerror_NZERROR_NOT_INITIALIZED: nzerror = 28771;
pub const nzerror_NZERROR_BAD_FILE_ID: nzerror = 28772;
pub const nzerror_NZERROR_WRITE_MAGIC_VERSION: nzerror = 28773;
pub const nzerror_NZERROR_FILE_WRITE_FAILED: nzerror = 28774;
pub const nzerror_NZERROR_FILE_CLOSE_FAILED: nzerror = 28775;
pub const nzerror_NZERROR_OUTPUT_BUFFER_TOO_SMALL: nzerror = 28776;
pub const nzerror_NZERROR_BINDING_CREATION_FAILED: nzerror = 28777;
pub const nzerror_NZERROR_PARAMETER_MALFORMED: nzerror = 28778;
pub const nzerror_NZERROR_PARAMETER_NO_METHOD: nzerror = 28779;
pub const nzerror_NZERROR_BAD_PARAMETER_METHOD: nzerror = 28780;
pub const nzerror_NZERROR_PARAMETER_NO_DATA: nzerror = 28781;
pub const nzerror_NZERROR_NOT_ALLOCATED: nzerror = 28782;
pub const nzerror_NZERROR_INVALID_PARAMETER: nzerror = 28783;
pub const nzerror_NZERROR_FILE_NAME_TRANSLATION: nzerror = 28784;
pub const nzerror_NZERROR_NO_SUCH_PARAMETER: nzerror = 28785;
pub const nzerror_NZERROR_DECRYPT_FAILED: nzerror = 28786;
pub const nzerror_NZERROR_ENCRYPT_FAILED: nzerror = 28787;
pub const nzerror_NZERROR_INVALID_INPUT: nzerror = 28788;
pub const nzerror_NZERROR_NAME_TYPE_NOT_FOUND: nzerror = 28789;
pub const nzerror_NZERROR_NLS_STRING_OPEN_FAILED: nzerror = 28790;
pub const nzerror_NZERROR_CERTIFICATE_VERIFY: nzerror = 28791;
pub const nzerror_NZERROR_OCI_PLSQL_FAILED: nzerror = 28792;
pub const nzerror_NZERROR_OCI_BIND_FAILED: nzerror = 28793;
pub const nzerror_NZERROR_ATTRIBUTE_INIT: nzerror = 28794;
pub const nzerror_NZERROR_ATTRIBUTE_FINISH_FAILED: nzerror = 28795;
pub const nzerror_NZERROR_UNSUPPORTED_METHOD: nzerror = 28796;
pub const nzerror_NZERROR_INVALID_KEY_DATA_TYPE: nzerror = 28797;
pub const nzerror_NZEROR_BIND_SUBKEY_COUNT: nzerror = 28798;
pub const nzerror_NZERROR_AUTH_SHARED_MEMORY: nzerror = 28799;
pub const nzerror_NZERROR_RIO_OPEN: nzerror = 28800;
pub const nzerror_NZERROR_RIO_OBJECT_TYPE: nzerror = 28801;
pub const nzerror_NZERROR_RIO_MODE: nzerror = 28802;
pub const nzerror_NZERROR_RIO_IO: nzerror = 28803;
pub const nzerror_NZERROR_RIO_CLOSE: nzerror = 28804;
pub const nzerror_NZERROR_RIO_RETRIEVE: nzerror = 28805;
pub const nzerror_NZERROR_RIO_STORE: nzerror = 28806;
pub const nzerror_NZERROR_RIO_UPDATE: nzerror = 28807;
pub const nzerror_NZERROR_RIO_INFO: nzerror = 28808;
pub const nzerror_NZERROR_RIO_DELETE: nzerror = 28809;
pub const nzerror_NZERROR_KD_CREATE: nzerror = 28810;
pub const nzerror_NZERROR_RIO_ACCESS_DESCRIPTOR: nzerror = 28811;
pub const nzerror_NZERROR_RIO_RECORD: nzerror = 28812;
pub const nzerror_NZERROR_RIO_RECORD_TYPE: nzerror = 28813;
pub const nzerror_NZERROR_PLSQL_ORACLE_TO_REAL: nzerror = 28814;
pub const nzerror_NZERROR_PLSQL_REAL_TO_ORACLE: nzerror = 28815;
pub const nzerror_NZERROR_TK_PLSQL_NO_PASSWORD: nzerror = 28816;
pub const nzerror_NZERROR_TK_PLSQL_GENERIC: nzerror = 28817;
pub const nzerror_NZERROR_TK_PLSQL_NO_CONTEXT: nzerror = 28818;
pub const nzerror_NZERROR_TK_PLSQL_NO_DIST_NAME: nzerror = 28819;
pub const nzerror_NZERROR_TK_PLSQL_NO_STATE: nzerror = 28820;
pub const nzerror_NZERROR_TK_PLSQL_NO_INPUT: nzerror = 28821;
pub const nzerror_NZERROR_TK_PLSQL_NO_SEED: nzerror = 28822;
pub const nzerror_NZERROR_TK_PLSQL_NO_BYTES: nzerror = 28823;
pub const nzerror_NZERROR_TK_INVALID_STATE: nzerror = 28824;
pub const nzerror_NZERROR_TK_PLSQL_NO_ENG_FUNC: nzerror = 28825;
pub const nzerror_NZERROR_TK_INV_ENG_FUNC: nzerror = 28826;
pub const nzerror_NZERROR_TK_INV_CIPHR_TYPE: nzerror = 28827;
pub const nzerror_NZERROR_TK_INV_IDENT_TYPE: nzerror = 28828;
pub const nzerror_NZERROR_TK_PLSQL_NO_CIPHER_TYPE: nzerror = 28829;
pub const nzerror_NZERROR_TK_PLSQL_NO_IDENT_TYPE: nzerror = 28830;
pub const nzerror_NZERROR_TK_PLSQL_NO_DATA_FMT: nzerror = 28831;
pub const nzerror_NZERROR_TK_INV_DATA_FMT: nzerror = 28832;
pub const nzerror_NZERROR_TK_PLSQL_INSUFF_INFO: nzerror = 28833;
pub const nzerror_NZERROR_TK_PLSQL_BUF_TOO_SMALL: nzerror = 28834;
pub const nzerror_NZERROR_TK_PLSQL_INV_IDENT_DESC: nzerror = 28835;
pub const nzerror_NZERROR_TK_PLSQL_WALLET_NOTOPEN: nzerror = 28836;
pub const nzerror_NZERROR_TK_PLSQL_NO_WALLET: nzerror = 28837;
pub const nzerror_NZERROR_TK_PLSQL_NO_IDENTITY: nzerror = 28838;
pub const nzerror_NZERROR_TK_PLSQL_NO_PERSONA: nzerror = 28839;
pub const nzerror_NZERROR_TK_PLSQL_WALLET_OPEN: nzerror = 28840;
pub const nzerror_NZERROR_UNSUPPORTED: nzerror = 28841;
pub const nzerror_NZERROR_FILE_BAD_PERMISSION: nzerror = 28842;
pub const nzerror_NZERROR_FILE_OSD_ERROR: nzerror = 28843;
pub const nzerror_NZERROR_NO_WALLET: nzerror = 28844;
pub const nzerror_NZERROR_NO_CERTIFICATE_ALERT: nzerror = 28845;
pub const nzerror_NZERROR_NO_PRIVATE_KEY: nzerror = 28846;
pub const nzerror_NZERROR_NO_CLEAR_PRIVATE_KEY_FILE: nzerror = 28847;
pub const nzerror_NZERROR_NO_ENCRYPTED_PRIVATE_KEY_FILE: nzerror = 28848;
pub const nzerror_NZERROR_NO_TRUSTPOINTS: nzerror = 28849;
pub const nzerror_NZERROR_NO_CLEAR_TRUSTPOINT_FILE: nzerror = 28850;
pub const nzerror_NZERROR_NO_ENCRYPTED_TRUSTPOINT_FILE: nzerror = 28851;
pub const nzerror_NZERROR_BAD_PASSWORD: nzerror = 28852;
pub const nzerror_NZERROR_INITIALIZATION_FAILED: nzerror = 28853;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_SSLMemoryErr: nzerror = 28854;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_SSLUnsupportedErr: nzerror = 28855;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_SSLOverflowErr: nzerror = 28856;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_SSLUnknownErr: nzerror = 28857;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_SSLProtocolErr: nzerror = 28858;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_SSLNegotiationErr: nzerror = 28859;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_SSLFatalAlert: nzerror = 28860;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_SSLWouldBlockErr: nzerror = 28861;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_SSLIOErr: nzerror = 28862;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_SSLSessionNotFoundErr: nzerror = 28863;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_SSLConnectionClosedGraceful: nzerror = 28864;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_SSLConnectionClosedError: nzerror = 28865;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_ASNBadEncodingErr: nzerror = 28866;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_ASNIntegerTooBigErr: nzerror = 28867;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_X509CertChainInvalidErr: nzerror = 28868;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_X509CertExpiredErr: nzerror = 28869;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_X509NamesNotEqualErr: nzerror = 28870;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_X509CertChainIncompleteErr: nzerror = 28871;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_X509DataNotFoundErr: nzerror = 28872;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_SSLBadParameterErr: nzerror = 28873;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_SSLIOClosedOverrideGoodbyeKiss: nzerror = 28874;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_X509MozillaSGCErr: nzerror = 28875;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_X509IESGCErr: nzerror = 28876;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_ImproperServerCredentials: nzerror = 28877;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_ImproperClientCredentials: nzerror = 28878;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_NoProtocolSideSet: nzerror = 28879;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_setPersonaFailed: nzerror = 28880;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_setCertFailed: nzerror = 28881;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_setVKeyFailed: nzerror = 28882;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_setTPFailed: nzerror = 28883;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_BadCipherSuite: nzerror = 28884;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_NoKeyPairForKeyUsage: nzerror = 28885;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_EntrustLoginFailed: nzerror = 28890;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_EntrustGetInfoFailed: nzerror = 28891;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_EntrustLoadCertificateFailed: nzerror = 28892;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_EntrustGetNameFailed: nzerror = 28893;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_OPEN_WINDOWS_CERT_STORE_FAILED: nzerror = 28900;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CertNotInstalled: nzerror = 29000;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_BAD_DATETIME_FORMAT: nzerror = 29001;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_ServerDNMisMatched: nzerror = 29002;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_ServerDNMisConfigured: nzerror = 29003;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_ALERT_CB_FAILURE: nzerror = 29004;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_CERTIFICATE: nzerror = 29005;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_CERTIFICATE_REQUEST: nzerror = 29006;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_CLEAR_KEY_LEN: nzerror = 29007;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_DHPARAM_KEY_LENGTH: nzerror = 29008;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_ENCRYPTED_KEY_LEN: nzerror = 29009;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_EXPORT_KEY_LENGTH: nzerror = 29010;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_FINISHED_MESSAGE: nzerror = 29011;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_KEY_ARG_LEN: nzerror = 29012;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_MAC: nzerror = 29013;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_MAX_FRAGMENT_LENGTH_EXTENSION: nzerror = 29014;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_MESSAGE_LENGTH: nzerror = 29015;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_PKCS1_PADDING: nzerror = 29016;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_PREMASTER_SECRET_LENGTH: nzerror = 29017;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_PREMASTER_SECRET_VERSION: nzerror = 29018;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_PROTOCOL_VERSION: nzerror = 29019;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_RECORD_LENGTH: nzerror = 29020;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_SECRET_KEY_LEN: nzerror = 29021;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_SIDE: nzerror = 29022;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BUFFERS_NOT_EMPTY: nzerror = 29023;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_CERTIFICATE_VALIDATE_FAILED: nzerror = 29024;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_CERT_CHECK_CALLBACK: nzerror = 29025;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_DECRYPT_FAILED: nzerror = 29026;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_ENTROPY_COLLECTION: nzerror = 29027;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_FAIL_SERVER_VERIFY: nzerror = 29028;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_HANDSHAKE_ALREADY_COMPLETED: nzerror = 29029;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_HANDSHAKE_REQUESTED: nzerror = 29030;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_HANDSHAKE_REQUIRED: nzerror = 29031;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_INCOMPLETE_IDENTITY: nzerror = 29032;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_INVALID_PFX: nzerror = 29033;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_NEEDS_CIPHER_OR_CLIENTAUTH: nzerror = 29034;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_NEEDS_PRNG: nzerror = 29035;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_NOT_SUPPORTED: nzerror = 29036;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_NO_CERTIFICATE: nzerror = 29037;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_NO_MATCHING_CERTIFICATES: nzerror = 29038;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_NO_MATCHING_CIPHER_SUITES: nzerror = 29039;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_NO_SUPPORTED_CIPHER_SUITES: nzerror = 29040;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_NULL_CB: nzerror = 29041;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_READ_BUFFER_NOT_EMPTY: nzerror = 29042;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_READ_REQUIRED: nzerror = 29043;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_RENEGOTIATION_ALREADY_REQUESTED: nzerror = 29044;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_RENEGOTIATION_REFUSED: nzerror = 29045;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_RESUMABLE_SESSION: nzerror = 29046;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_TLS_EXTENSION_MISMATCH: nzerror = 29047;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_UNEXPECTED_MSG: nzerror = 29048;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_UNKNOWN_RECORD: nzerror = 29049;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_UNSUPPORTED_CLIENT_AUTH_MODE: nzerror = 29050;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_UNSUPPORTED_PUBKEY_TYPE: nzerror = 29051;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_WRITE_BUFFER_NOT_EMPTY: nzerror = 29052;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_PKCS12_MISSING_ALG: nzerror = 29053;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_PKCS_AUTH_FAILED: nzerror = 29054;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_PKCS_BAD_CONTENT_TYPE: nzerror = 29055;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_PKCS_BAD_INPUT: nzerror = 29056;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_PKCS_BAD_PADDING: nzerror = 29057;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_PKCS_BAD_SN: nzerror = 29058;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_PKCS_BAD_SN_LENGTH: nzerror = 29059;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_PKCS_BAD_VERSION: nzerror = 29060;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_PKCS_BASE: nzerror = 29061;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_PKCS_FIELD_NOT_PRESENT: nzerror = 29062;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_PKCS_NEED_CERTVAL: nzerror = 29063;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_PKCS_NEED_PASSWORD: nzerror = 29064;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_PKCS_NEED_PKC: nzerror = 29065;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_PKCS_NEED_PRV_KEY: nzerror = 29066;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_PKCS_NEED_TRUSTED: nzerror = 29067;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_PKCS_UNSUPPORTED_CERT_FORMAT: nzerror = 29068;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_PKCS_UNSUP_PRVKEY_TYPE: nzerror = 29069;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_CODING_BAD_PEM: nzerror = 29070;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_CODING_BASE: nzerror = 29071;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_DER_BAD_ENCODING: nzerror = 29072;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_DER_BAD_ENCODING_LENGTH: nzerror = 29073;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_DER_BASE: nzerror = 29074;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_DER_ELEMENT_TOO_LONG: nzerror = 29075;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_DER_INDEFINITE_LENGTH: nzerror = 29076;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_DER_NO_MORE_ELEMENTS: nzerror = 29077;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_DER_OBJECT_TOO_LONG: nzerror = 29078;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_DER_TAG_SIZE: nzerror = 29079;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_DER_TIME_OUT_OF_RANGE: nzerror = 29080;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_DER_UNUSED_BITS_IN_BIT_STR: nzerror = 29081;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_GENERAL_BASE: nzerror = 29082;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_HASH_BASE: nzerror = 29083;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_ILLEGAL_PARAM: nzerror = 29084;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_MEM_NOT_OURS: nzerror = 29085;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_MEM_OVERRUN: nzerror = 29086;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_MEM_UNDERRUN: nzerror = 29087;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_MEM_WAS_FREED: nzerror = 29088;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_NOT_FOUND: nzerror = 29090;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_NO_PTR: nzerror = 29091;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_TIMEOUT: nzerror = 29092;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_UNIT_MASK: nzerror = 29093;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_BAD_CTX: nzerror = 29094;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_BAD_INDEX: nzerror = 29095;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_BAD_LENGTH: nzerror = 29096;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_CODING_BAD_ENCODING: nzerror = 29097;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_NO_CLIENT_AUTH_MODES: nzerror = 29098;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_LOCKEYID_CREATE_FAILED: nzerror = 29100;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_ADD_PVTKEY_FAILED: nzerror = 29101;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_ADD_CERT_FAILED: nzerror = 29102;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_WLT_CREATE_FAILED: nzerror = 29103;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_ADD_CERTREQ_FAILED: nzerror = 29104;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_WLT_EXP_FAILED: nzerror = 29105;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_WLT_IMP_FAILED: nzerror = 29106;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_CREATE_FAILED: nzerror = 29107;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_DEST_FAILED: nzerror = 29107;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_RAND_ERROR: nzerror = 29108;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_PVTKEY_CRT_FAILED: nzerror = 29109;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_INVALID_BAG: nzerror = 29110;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_INVALID_INDEX: nzerror = 29111;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_GET_CERT_FAILED: nzerror = 29112;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_GET_PVTKEY_FAILED: nzerror = 29113;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_IMP_PVTKEY_FAILED: nzerror = 29114;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_EXP_PVTKEY_FAILED: nzerror = 29115;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_GET_ATTRIB_FAILED: nzerror = 29116;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_ADD_ATTRIB_FAILED: nzerror = 29117;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_CRT_ATTRIB_FAILED: nzerror = 29118;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_IMP_CERT_FAILED: nzerror = 29119;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_EXP_CERT_FAILED: nzerror = 29120;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_ADD_SECRET_FAILED: nzerror = 29121;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_ADD_PKCS11INFO_FAILED: nzerror = 29122;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_GET_PKCS11INFO_FAILED: nzerror = 29123;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_MULTIPLE_PKCS11_LIBNAME: nzerror = 29124;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_MULTIPLE_PKCS11_TOKENLABEL: nzerror = 29125;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_MULTIPLE_PKCS11_TOKENPASSPHRASE: nzerror = 29126;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_UNKNOWN_PKCS11INFO: nzerror = 29127;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_PKCS11_LIBNAME_NOT_SET: nzerror = 29128;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_PKCS11_TOKENLABEL_NOT_SET: nzerror = 29129;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_PKCS11_TOKENPASSPHRASE_NOT_SET: nzerror = 29130;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_P12_MULTIPLE_PKCS11_CERTLABEL: nzerror = 29131;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_RANDOM: nzerror = 29135;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SMALL_BUFFER: nzerror = 29136;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CIC_ERR_SSL_BAD_CONTEXT: nzerror = 29137;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_MUTEX_INITIALIZE_FAILED: nzerror = 29138;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_MUTEX_DESTROY_FAILED: nzerror = 29139;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_BS_CERTOBJ_CREAT_FAILED: nzerror = 29140;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_BS_DER_IMP_FAILED: nzerror = 29141;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CERT_NAME_ERROR: nzerror = 29142;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_EXT_ERROR: nzerror = 29143;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_DES_SELF_TEST_FAILED: nzerror = 29150;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_3DES_SELF_TEST_FAILED: nzerror = 29151;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_SHA_SELF_TEST_FAILED: nzerror = 29152;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_RSA_SELF_TEST_FAILED: nzerror = 29153;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_DRNG_SELF_TEST_FAILED: nzerror = 29154;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CKEYPAIR_SELF_TEST_FAILED: nzerror = 29155;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CRNG_SELF_TEST_FAILED: nzerror = 29156;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_FIPS_PATHNAME_ERROR: nzerror = 29157;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_FIPS_LIB_OPEN_FAILED: nzerror = 29158;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_FIPS_LIB_READ_ERROR: nzerror = 29159;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_FIPS_LIB_DIFFERS: nzerror = 29160;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_DAC_SELF_TEST_FAILED: nzerror = 29161;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_NONFIPS_CIPHERSUITE: nzerror = 29162;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_VENDOR_NOT_SUPPORTED_FIPS_MODE: nzerror = 29163;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_EXTERNAL_PKCS12_NOT_SUPPORTED_FIPS_MODE: nzerror = 29164;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_AES_SELF_TEST_FAILED: nzerror = 29165;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_FIPS_BAD_KEYSIZE: nzerror = 29166;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CRL_SIG_VERIFY_FAILED: nzerror = 29176;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CERT_NOT_IN_CRL: nzerror = 29177;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CERT_IN_CRL: nzerror = 29178;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CERT_IN_CRL_CHECK_FAILED: nzerror = 29179;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_INVALID_CERT_STATUS_PROTOCOL: nzerror = 29180;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_LDAP_OPEN_FAILED: nzerror = 29181;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_LDAP_BIND_FAILED: nzerror = 29182;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_LDAP_SEARCH_FAILED: nzerror = 29183;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_LDAP_RESULT_FAILED: nzerror = 29184;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_LDAP_FIRSTATTR_FAILED: nzerror = 29185;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_LDAP_GETVALUESLEN_FAILED: nzerror = 29186;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_LDAP_UNSUPPORTED_VALMEC: nzerror = 29187;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_LDAP_COUNT_ENTRIES_FAILED: nzerror = 29188;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_LDAP_NO_ENTRY_FOUND: nzerror = 29189;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_LDAP_MULTIPLE_ENTRIES_FOUND: nzerror = 29190;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_OID_INFO_NOT_SET: nzerror = 29191;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_LDAP_VALMEC_NOT_SET: nzerror = 29192;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CRLDP_NO_CRL_FOUND: nzerror = 29193;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CRL_NOT_IN_CACHE: nzerror = 29194;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CRL_EXPIRED: nzerror = 29195;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CRL_FILETOOBIG: nzerror = 29196;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CRL_CACHE_FULL: nzerror = 29197;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_DN_MATCH: nzerror = 29222;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CERT_CHAIN_CREATION: nzerror = 29223;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_NO_MATCHING_CERT_REQ: nzerror = 29224;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_CERT_ALREADY_INSTALLED: nzerror = 29225;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_NO_MATCHING_PRIVATE_KEY: nzerror = 29226;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_VALIDITY_EXPIRED: nzerror = 29227;
#[doc = " SSL ERRORS"]
pub const nzerror_NZERROR_TK_BYTES_NEEDED: nzerror = 29228;
pub const nzerror_NZERROR_TK_BAD_MAGIC_NUMBER: nzerror = 29229;
pub const nzerror_NZERROR_TK_BAD_HEADER_LENGTH: nzerror = 29230;
pub const nzerror_NZERROR_TK_CE_INIT: nzerror = 29231;
pub const nzerror_NZERROR_TK_CE_KEYINIT: nzerror = 29232;
pub const nzerror_NZERROR_TK_CE_ENCODE_KEY: nzerror = 29233;
pub const nzerror_NZERROR_TK_CE_DECODE_KEY: nzerror = 29234;
pub const nzerror_NZERROR_TK_CE_GEYKEYINFO: nzerror = 29235;
pub const nzerror_NZERROR_TK_SEED_RANDOM: nzerror = 29236;
pub const nzerror_NZERROR_TK_CE_ALGFINISH: nzerror = 29237;
pub const nzerror_NZERROR_TK_CE_ALGAPPLY: nzerror = 29238;
pub const nzerror_NZERROR_TK_CE_ALGINIT: nzerror = 29239;
pub const nzerror_NZERROR_TK_ALGORITHM: nzerror = 29240;
pub const nzerror_NZERROR_TK_CANNOT_GROW: nzerror = 29241;
pub const nzerror_NZERROR_TK_KEYSIZE: nzerror = 29242;
pub const nzerror_NZERROR_TK_KEYTYPE: nzerror = 29243;
pub const nzerror_NZERROR_TK_PLSQL_NO_WRL: nzerror = 29244;
pub const nzerror_NZERROR_TK_CE_FUNC: nzerror = 29245;
pub const nzerror_NZERROR_TK_TDU_FORMAT: nzerror = 29246;
pub const nzerror_NZERROR_TK_NOTOPEN: nzerror = 29247;
pub const nzerror_NZERROR_TK_WRLTYPE: nzerror = 29248;
pub const nzerror_NZERROR_TK_CE_STATE: nzerror = 29249;
pub const nzerror_NZERROR_PKCS11_LIBRARY_NOT_FOUND: nzerror = 43000;
pub const nzerror_NZERROR_PKCS11_TOKEN_NOT_FOUND: nzerror = 43001;
pub const nzerror_NZERROR_PKCS11_BAD_PASSPHRASE: nzerror = 43002;
pub const nzerror_NZERROR_PKCS11_GET_FUNC_LIST: nzerror = 43003;
pub const nzerror_NZERROR_PKCS11_INITIALIZE: nzerror = 43004;
pub const nzerror_NZERROR_PKCS11_NO_TOKENS_PRESENT: nzerror = 43005;
pub const nzerror_NZERROR_PKCS11_GET_SLOT_LIST: nzerror = 43006;
pub const nzerror_NZERROR_PKCS11_GET_TOKEN_INFO: nzerror = 43008;
pub const nzerror_NZERROR_PKCS11_SYMBOL_NOT_FOUND: nzerror = 43009;
pub const nzerror_NZERROR_PKCS11_TOKEN_LOGIN_FAILED: nzerror = 43011;
pub const nzerror_NZERROR_PKCS11_CHANGE_PROVIDERS_ERROR: nzerror = 43013;
pub const nzerror_NZERROR_PKCS11_GET_PRIVATE_KEY_ERROR: nzerror = 43014;
pub const nzerror_NZERROR_PKCS11_CREATE_KEYPAIR_ERROR: nzerror = 43015;
pub const nzerror_NZERROR_PKCS11_WALLET_CONTAINS_P11_INFO: nzerror = 43016;
pub const nzerror_NZERROR_PKCS11_NO_CERT_ON_TOKEN: nzerror = 43017;
pub const nzerror_NZERROR_PKCS11_NO_USER_CERT_ON_TOKEN: nzerror = 43018;
pub const nzerror_NZERROR_PKCS11_NO_CERT_ON_TOKEN_WITH_GIVEN_LABEL: nzerror = 43019;
pub const nzerror_NZERROR_PKCS11_MULTIPLE_CERTS_ON_TOKEN_WITH_GIVEN_LABEL: nzerror = 43020;
pub const nzerror_NZERROR_PKCS11_CERT_WITH_LABEL_NOT_USER_CERT: nzerror = 43021;
pub const nzerror_NZERROR_BIND_SERVICE_ERROR: nzerror = 43050;
pub const nzerror_NZERROR_CREATE_KEY_OBJ_ERROR: nzerror = 43051;
pub const nzerror_NZERROR_GET_CERT_FIELDS: nzerror = 43052;
pub const nzerror_NZERROR_CREATE_PKCS10_OBJECT: nzerror = 43053;
pub const nzerror_NZERROR_SET_PKCS10_FIELDS: nzerror = 43054;
pub const nzerror_NZERROR_SIGN_CERT_REQUEST: nzerror = 43055;
pub const nzerror_NZERROR_GET_PKCS10_DER: nzerror = 43056;
pub const nzerror_NZERROR_INITIALIZE_CERTC: nzerror = 43057;
pub const nzerror_NZERROR_INSERT_PRIVATE_KEY: nzerror = 43058;
pub const nzerror_NZERROR_RSA_ERROR: nzerror = 43059;
pub const nzerror_NZERROR_SLTSCTX_INIT_FAILED: nzerror = 43060;
pub const nzerror_NZERROR_SLTSKYC_FAILED: nzerror = 43061;
pub const nzerror_NZERROR_SLTSCTX_TERM_FAILED: nzerror = 43062;
pub const nzerror_NZERROR_SLTSKYS_FAILED: nzerror = 43063;
pub const nzerror_NZERROR_INVALID_HEADER_LENGTH: nzerror = 43070;
pub const nzerror_NZERROR_WALLET_CONTAINS_USER_CREDENTIALS: nzerror = 43071;
pub const nzerror_NZERROR_CANNOT_MODIFY_AL: nzerror = 43072;
pub const nzerror_NZERROR_FILE_LOCK_FAILED: nzerror = 43073;
pub const nzerror_NZERROR_MULTIPLE_MATCHING_CREDENTIALS: nzerror = 43080;
pub const nzerror_NZERROR_KEYPAIR_CHECK: nzerror = 43081;
pub const nzerror_NZERROR_SSL_DUPLICATE_RSA_CERTIFICATES: nzerror = 43082;
pub const nzerror_NZERROR_SSL_DUPLICATE_ECC_CURVE_CERTIFICATES: nzerror = 43083;
pub const nzerror_NZERROR_FORBIDDEN_SIGNATURE_ALGORITHM: nzerror = 43084;
pub const nzerror_NZERROR_CSF_ALIAS_INVALID: nzerror = 43100;
pub const nzerror_NZERROR_CSF_KEY_INVALID: nzerror = 43101;
pub const nzerror_NZERROR_CSF_CRED_NOT_SUPPORTED: nzerror = 43102;
pub const nzerror_NZERROR_CSF_HOSTNAME: nzerror = 43103;
pub const nzerror_NZERROR_CSF_XML: nzerror = 43104;
pub const nzerror_NZERROR_CSF_WALLET_NOT_SPECIFIED: nzerror = 43105;
pub const nzerror_NZERROR_CSF_MAP_NOT_IN_STORE: nzerror = 43106;
pub const nzerror_NZERROR_CSF_KEY_NOT_IN_STORE: nzerror = 43107;
pub const nzerror_NZERROR_CSF_ENTRY_EXISTS: nzerror = 43108;
pub const nzerror_NZERROR_CSF_BTSTRP_WLT_PATH_NOT_SET: nzerror = 43109;
pub const nzerror_NZERROR_CSF_BTSTRP_WLT_MAP_NOT_SET: nzerror = 43110;
pub const nzerror_NZERROR_CSF_BTSTRP_WLT_KEY_NOT_SET: nzerror = 43111;
pub const nzerror_NZERROR_CSF_LDAP_USERNAME_NOT_SET: nzerror = 43112;
pub const nzerror_NZERROR_CSF_LDAP_PWD_NOT_SET: nzerror = 43113;
pub const nzerror_NZERROR_CSF_LDAP_URL_NOT_SET: nzerror = 43114;
pub const nzerror_NZERROR_CSF_LDAP_PORT_NOT_SET: nzerror = 43115;
pub const nzerror_NZERROR_CSF_LDAP_FARMNAME_NOT_SET: nzerror = 43116;
pub const nzerror_NZERROR_CSF_LDAP_ROOTNAME_NOT_SET: nzerror = 43117;
pub const nzerror_NZERROR_SSL_UNSUPPORTED_CIPHER: nzerror = 43120;
pub const nzerror_NZERROR_SSL_BAD_ENCRYPTED_VAUE: nzerror = 43121;
pub const nzerror_NZERROR_SSL_ERR_SIGNATURE: nzerror = 43122;
pub const nzerror_NZERROR_SSL_HARDWARE_FAILURE: nzerror = 43123;
pub const nzerror_NZERROR_SSL_ERR_PKEY: nzerror = 43124;
pub const nzerror_NZERROR_SSL_HANDSHAKE_FAILED: nzerror = 43125;
pub const nzerror_NZERROR_SSL_BAD_CLIENT_HELLO: nzerror = 43126;
pub const nzerror_NZERROR_SSL_BAD_SERVER_HELLO: nzerror = 43127;
pub const nzerror_NZERROR_UNKNOWN_ECC_CURVE: nzerror = 43130;
pub const nzerror_NZERROR_ODBC_SQL_FAILED: nzerror = 43131;
pub const nzerror_NZERROR_CSF_DB_B64_DECODE_FAILED: nzerror = 43132;
pub const nzerror_NZERROR_CSF_DB_DEC_SPLIT_FAILED: nzerror = 43133;
pub const nzerror_NZERROR_CSF_DB_DECKEY_NULL: nzerror = 43134;
pub const nzerror_NZERROR_CSF_MAP_NOT_PRESENT: nzerror = 43135;
pub const nzerror_NZERROR_CSF_KEY_NOT_PRESENT: nzerror = 43136;
pub const nzerror_NZERROR_SET_ALPN_PROTOCOL_FAILED: nzerror = 43137;
pub const nzerror_NZERROR_GET_ALPN_PROTOCOL_FAILED: nzerror = 43138;
pub const nzerror_NZERROR_NO_COMMON_ALPN_PROTOCOL: nzerror = 43139;
pub const nzerror_NZERROR_HANDSHAKE_FAILED_NO_COMMON_ALPN_PROTOCOL: nzerror = 43140;
pub const nzerror_NZERROR_ALPN_FEATURE_NOT_SUPPORTED: nzerror = 43141;
pub const nzerror_NZERROR_CERT_CHAIN_TOO_BIG: nzerror = 43142;
pub const nzerror_NZERROR_LX_ERROR: nzerror = 43490;
pub const nzerror_NZERROR_LAST_ERROR: nzerror = 43499;
pub const nzerror_NZERROR_THIS_MUST_BE_LAST: nzerror = 43500;
pub type nzerror = u32;
pub type nzTrustFlag = ::std::os::raw::c_int;
pub const nzttwrl_NZTTWRL_DEFAULT: nzttwrl = 1;
pub const nzttwrl_NZTTWRL_SQLNET: nzttwrl = 2;
pub const nzttwrl_NZTTWRL_FILE: nzttwrl = 3;
pub const nzttwrl_NZTTWRL_ENTR: nzttwrl = 4;
pub const nzttwrl_NZTTWRL_MCS: nzttwrl = 5;
pub const nzttwrl_NZTTWRL_ORACLE: nzttwrl = 6;
pub const nzttwrl_NZTTWRL_NULL: nzttwrl = 7;
pub const nzttwrl_NZTTWRL_REGISTRY: nzttwrl = 8;
pub const nzttwrl_NZTTWRL_MEMORY: nzttwrl = 9;
pub type nzttwrl = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzctx {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzstrc {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzosContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzttIdentityPrivate {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzttPersonaPrivate {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzttWalletPrivate {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzttWalletObj {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzssEntry {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzpkcs11_Info {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzpkcs12_Info {
    _unused: [u8; 0],
}
pub const nzttces_NZTTCES_CONTINUE: nzttces = 1;
pub const nzttces_NZTTCES_END: nzttces = 2;
pub const nzttces_NZTTCES_RESET: nzttces = 3;
pub type nzttces = u32;
pub const nzttcef_NZTTCEF_DETACHEDSIGNATURE: nzttcef = 1;
pub const nzttcef_NZTTCEF_SIGNATURE: nzttcef = 2;
pub const nzttcef_NZTTCEF_ENVELOPING: nzttcef = 3;
pub const nzttcef_NZTTCEF_PKENCRYPTION: nzttcef = 4;
pub const nzttcef_NZTTCEF_ENCRYPTION: nzttcef = 5;
pub const nzttcef_NZTTCEF_KEYEDHASH: nzttcef = 6;
pub const nzttcef_NZTTCEF_HASH: nzttcef = 7;
pub const nzttcef_NZTTCEF_RANDOM: nzttcef = 8;
pub const nzttcef_NZTTCEF_LAST: nzttcef = 9;
pub type nzttcef = u32;
pub const nzttState_NZTTSTATE_EMPTY: nzttState = 0;
pub const nzttState_NZTTSTATE_REQUESTED: nzttState = 1;
pub const nzttState_NZTTSTATE_READY: nzttState = 2;
pub const nzttState_NZTTSTATE_INVALID: nzttState = 3;
pub const nzttState_NZTTSTATE_RENEWAL: nzttState = 4;
pub type nzttState = u32;
pub const nzttVersion_NZTTVERSION_X509v1: nzttVersion = 1;
pub const nzttVersion_NZTTVERSION_X509v3: nzttVersion = 2;
pub const nzttVersion_NZTTVERSION_INVALID_TYPE: nzttVersion = 3;
pub type nzttVersion = u32;
pub const nzttCipherType_NZTTCIPHERTYPE_INVALID: nzttCipherType = 0;
pub const nzttCipherType_NZTTCIPHERTYPE_RSA: nzttCipherType = 1;
pub const nzttCipherType_NZTTCIPHERTYPE_DES: nzttCipherType = 2;
pub const nzttCipherType_NZTTCIPHERTYPE_RC4: nzttCipherType = 3;
pub const nzttCipherType_NZTTCIPHERTYPE_MD5DES: nzttCipherType = 4;
pub const nzttCipherType_NZTTCIPHERTYPE_MD5RC2: nzttCipherType = 5;
pub const nzttCipherType_NZTTCIPHERTYPE_MD5: nzttCipherType = 6;
pub const nzttCipherType_NZTTCIPHERTYPE_SHA: nzttCipherType = 7;
pub const nzttCipherType_NZTTCIPHERTYPE_ECC: nzttCipherType = 8;
pub type nzttCipherType = u32;
pub const nztttdufmt_NZTTTDUFMT_PKCS7: nztttdufmt = 1;
pub const nztttdufmt_NZTTTDUFMT_RSAPAD: nztttdufmt = 2;
pub const nztttdufmt_NZTTTDUFMT_ORACLEv1: nztttdufmt = 3;
pub const nztttdufmt_NZTTTDUFMT_LAST: nztttdufmt = 4;
pub type nztttdufmt = u32;
pub const nzttValState_NZTTVALSTATE_NONE: nzttValState = 1;
pub const nzttValState_NZTTVALSTATE_GOOD: nzttValState = 2;
pub const nzttValState_NZTTVALSTATE_REVOKED: nzttValState = 3;
pub type nzttValState = u32;
pub const nzttPolicy_NZTTPOLICY_NONE: nzttPolicy = 0;
pub const nzttPolicy_NZTTPOLICY_RETRY_1: nzttPolicy = 1;
pub const nzttPolicy_NZTTPOLICY_RETRY_2: nzttPolicy = 2;
pub const nzttPolicy_NZTTPOLICY_RETRY_3: nzttPolicy = 3;
pub type nzttPolicy = u32;
pub type nzttID = [ub1; 16usize];
pub const nzttIdentType_NZTTIDENTITYTYPE_INVALID_TYPE: nzttIdentType = 0;
pub const nzttIdentType_NZTTIDENTITYTYPE_CERTIFICTAE: nzttIdentType = 1;
pub const nzttIdentType_NZTTIDENTITYTYPE_CERT_REQ: nzttIdentType = 2;
pub const nzttIdentType_NZTTIDENTITYTYPE_RENEW_CERT_REQ: nzttIdentType = 3;
pub const nzttIdentType_NZTTIDENTITYTYPE_CLEAR_ETP: nzttIdentType = 4;
pub const nzttIdentType_NZTTIDENTITYTYPE_CLEAR_UTP: nzttIdentType = 5;
pub const nzttIdentType_NZTTIDENTITYTYPE_CLEAR_PTP: nzttIdentType = 6;
pub type nzttIdentType = u32;
pub type nzttKPUsage = ub4;
pub type nzttTStamp = [ub1; 4usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzttBufferBlock {
    pub flags_nzttBufferBlock: uword,
    pub buflen_nzttBufferBlock: ub4,
    pub usedlen_nzttBufferBlock: ub4,
    pub buffer_nzttBufferBlock: *mut ub1,
}
#[test]
fn bindgen_test_layout_nzttBufferBlock() {
    assert_eq!(
        ::std::mem::size_of::<nzttBufferBlock>(),
        24usize,
        concat!("Size of: ", stringify!(nzttBufferBlock))
    );
    assert_eq!(
        ::std::mem::align_of::<nzttBufferBlock>(),
        8usize,
        concat!("Alignment of ", stringify!(nzttBufferBlock))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttBufferBlock>())).flags_nzttBufferBlock as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttBufferBlock),
            "::",
            stringify!(flags_nzttBufferBlock)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttBufferBlock>())).buflen_nzttBufferBlock as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttBufferBlock),
            "::",
            stringify!(buflen_nzttBufferBlock)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttBufferBlock>())).usedlen_nzttBufferBlock as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttBufferBlock),
            "::",
            stringify!(usedlen_nzttBufferBlock)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttBufferBlock>())).buffer_nzttBufferBlock as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttBufferBlock),
            "::",
            stringify!(buffer_nzttBufferBlock)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzttWallet {
    pub ldapName_nzttWallet: *mut ub1,
    pub ldapNamelen_nzttWallet: ub4,
    pub securePolicy_nzttWallet: nzttPolicy,
    pub openPolicy_nzttWallet: nzttPolicy,
    pub persona_nzttWallet: *mut nzttPersona,
    pub private_nzttWallet: *mut nzttWalletPrivate,
}
#[test]
fn bindgen_test_layout_nzttWallet() {
    assert_eq!(
        ::std::mem::size_of::<nzttWallet>(),
        40usize,
        concat!("Size of: ", stringify!(nzttWallet))
    );
    assert_eq!(
        ::std::mem::align_of::<nzttWallet>(),
        8usize,
        concat!("Alignment of ", stringify!(nzttWallet))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nzttWallet>())).ldapName_nzttWallet as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttWallet),
            "::",
            stringify!(ldapName_nzttWallet)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttWallet>())).ldapNamelen_nzttWallet as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttWallet),
            "::",
            stringify!(ldapNamelen_nzttWallet)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttWallet>())).securePolicy_nzttWallet as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttWallet),
            "::",
            stringify!(securePolicy_nzttWallet)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttWallet>())).openPolicy_nzttWallet as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttWallet),
            "::",
            stringify!(openPolicy_nzttWallet)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nzttWallet>())).persona_nzttWallet as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttWallet),
            "::",
            stringify!(persona_nzttWallet)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nzttWallet>())).private_nzttWallet as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttWallet),
            "::",
            stringify!(private_nzttWallet)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzttTrustInfo {
    pub serverAuthTFcount_nzttTrustInfo: ub4,
    pub clientAuthTFcount_nzttTrustInfo: ub4,
    pub peerAuthTFcount_nzttTrustInfo: ub4,
}
#[test]
fn bindgen_test_layout_nzttTrustInfo() {
    assert_eq!(
        ::std::mem::size_of::<nzttTrustInfo>(),
        12usize,
        concat!("Size of: ", stringify!(nzttTrustInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<nzttTrustInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(nzttTrustInfo))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttTrustInfo>())).serverAuthTFcount_nzttTrustInfo as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttTrustInfo),
            "::",
            stringify!(serverAuthTFcount_nzttTrustInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttTrustInfo>())).clientAuthTFcount_nzttTrustInfo as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttTrustInfo),
            "::",
            stringify!(clientAuthTFcount_nzttTrustInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttTrustInfo>())).peerAuthTFcount_nzttTrustInfo as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttTrustInfo),
            "::",
            stringify!(peerAuthTFcount_nzttTrustInfo)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzttPersona {
    pub genericName_nzttPersona: *mut ub1,
    pub genericNamelen_nzttPersona: ub4,
    pub private_nzttPersona: *mut nzttPersonaPrivate,
    pub mycertreqs_nzttPersona: *mut nzttIdentity,
    pub mycerts_nzttPersona: *mut nzttIdentity,
    pub mytps_nzttPersona: *mut nzttIdentity,
    pub mystore_nzttPersona: *mut nzssEntry,
    pub mypkcs11Info_nzttPersona: *mut nzpkcs11_Info,
    pub next_nzttPersona: *mut nzttPersona,
    pub bTrustFlagEnabled_nzttPersona: boolean,
    pub trustinfo: nzttTrustInfo,
    pub p12Info_nzttPersona: *mut nzpkcs12_Info,
}
#[test]
fn bindgen_test_layout_nzttPersona() {
    assert_eq!(
        ::std::mem::size_of::<nzttPersona>(),
        96usize,
        concat!("Size of: ", stringify!(nzttPersona))
    );
    assert_eq!(
        ::std::mem::align_of::<nzttPersona>(),
        8usize,
        concat!("Alignment of ", stringify!(nzttPersona))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttPersona>())).genericName_nzttPersona as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersona),
            "::",
            stringify!(genericName_nzttPersona)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttPersona>())).genericNamelen_nzttPersona as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersona),
            "::",
            stringify!(genericNamelen_nzttPersona)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nzttPersona>())).private_nzttPersona as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersona),
            "::",
            stringify!(private_nzttPersona)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttPersona>())).mycertreqs_nzttPersona as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersona),
            "::",
            stringify!(mycertreqs_nzttPersona)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nzttPersona>())).mycerts_nzttPersona as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersona),
            "::",
            stringify!(mycerts_nzttPersona)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nzttPersona>())).mytps_nzttPersona as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersona),
            "::",
            stringify!(mytps_nzttPersona)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nzttPersona>())).mystore_nzttPersona as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersona),
            "::",
            stringify!(mystore_nzttPersona)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttPersona>())).mypkcs11Info_nzttPersona as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersona),
            "::",
            stringify!(mypkcs11Info_nzttPersona)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nzttPersona>())).next_nzttPersona as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersona),
            "::",
            stringify!(next_nzttPersona)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttPersona>())).bTrustFlagEnabled_nzttPersona as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersona),
            "::",
            stringify!(bTrustFlagEnabled_nzttPersona)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nzttPersona>())).trustinfo as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersona),
            "::",
            stringify!(trustinfo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nzttPersona>())).p12Info_nzttPersona as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersona),
            "::",
            stringify!(p12Info_nzttPersona)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzttPersonaList {
    pub next_nzttPersonaList: *mut nzttPersonaList,
    pub mynzttPersona: *mut nzttPersona,
}
#[test]
fn bindgen_test_layout_nzttPersonaList() {
    assert_eq!(
        ::std::mem::size_of::<nzttPersonaList>(),
        16usize,
        concat!("Size of: ", stringify!(nzttPersonaList))
    );
    assert_eq!(
        ::std::mem::align_of::<nzttPersonaList>(),
        8usize,
        concat!("Alignment of ", stringify!(nzttPersonaList))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttPersonaList>())).next_nzttPersonaList as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersonaList),
            "::",
            stringify!(next_nzttPersonaList)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nzttPersonaList>())).mynzttPersona as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersonaList),
            "::",
            stringify!(mynzttPersona)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzttIdentity {
    pub dn_nzttIdentity: *mut text,
    pub dnlen_nzttIdentity: ub4,
    pub comment_nzttIdentity: *mut text,
    pub commentlen_nzttIdentity: ub4,
    pub private_nzttIdentity: *mut nzttIdentityPrivate,
    pub next_nzttIdentity: *mut nzttIdentity,
}
#[test]
fn bindgen_test_layout_nzttIdentity() {
    assert_eq!(
        ::std::mem::size_of::<nzttIdentity>(),
        48usize,
        concat!("Size of: ", stringify!(nzttIdentity))
    );
    assert_eq!(
        ::std::mem::align_of::<nzttIdentity>(),
        8usize,
        concat!("Alignment of ", stringify!(nzttIdentity))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nzttIdentity>())).dn_nzttIdentity as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttIdentity),
            "::",
            stringify!(dn_nzttIdentity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nzttIdentity>())).dnlen_nzttIdentity as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttIdentity),
            "::",
            stringify!(dnlen_nzttIdentity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttIdentity>())).comment_nzttIdentity as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttIdentity),
            "::",
            stringify!(comment_nzttIdentity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttIdentity>())).commentlen_nzttIdentity as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttIdentity),
            "::",
            stringify!(commentlen_nzttIdentity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttIdentity>())).private_nzttIdentity as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttIdentity),
            "::",
            stringify!(private_nzttIdentity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nzttIdentity>())).next_nzttIdentity as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttIdentity),
            "::",
            stringify!(next_nzttIdentity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzttB64Cert {
    pub b64Cert_nzttB64Cert: *mut ub1,
    pub b64Certlen_nzttB64Cert: ub4,
    pub next_nzttB64Cert: *mut nzttB64Cert,
}
#[test]
fn bindgen_test_layout_nzttB64Cert() {
    assert_eq!(
        ::std::mem::size_of::<nzttB64Cert>(),
        24usize,
        concat!("Size of: ", stringify!(nzttB64Cert))
    );
    assert_eq!(
        ::std::mem::align_of::<nzttB64Cert>(),
        8usize,
        concat!("Alignment of ", stringify!(nzttB64Cert))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nzttB64Cert>())).b64Cert_nzttB64Cert as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttB64Cert),
            "::",
            stringify!(b64Cert_nzttB64Cert)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttB64Cert>())).b64Certlen_nzttB64Cert as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttB64Cert),
            "::",
            stringify!(b64Certlen_nzttB64Cert)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nzttB64Cert>())).next_nzttB64Cert as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttB64Cert),
            "::",
            stringify!(next_nzttB64Cert)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzttPKCS7ProtInfo {
    pub mictype_nzttPKCS7ProtInfo: nzttCipherType,
    pub symmtype_nzttPKCS7ProtInfo: nzttCipherType,
    pub keylen_nzttPKCS7ProtInfo: ub4,
}
#[test]
fn bindgen_test_layout_nzttPKCS7ProtInfo() {
    assert_eq!(
        ::std::mem::size_of::<nzttPKCS7ProtInfo>(),
        12usize,
        concat!("Size of: ", stringify!(nzttPKCS7ProtInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<nzttPKCS7ProtInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(nzttPKCS7ProtInfo))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttPKCS7ProtInfo>())).mictype_nzttPKCS7ProtInfo as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPKCS7ProtInfo),
            "::",
            stringify!(mictype_nzttPKCS7ProtInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttPKCS7ProtInfo>())).symmtype_nzttPKCS7ProtInfo as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPKCS7ProtInfo),
            "::",
            stringify!(symmtype_nzttPKCS7ProtInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttPKCS7ProtInfo>())).keylen_nzttPKCS7ProtInfo as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPKCS7ProtInfo),
            "::",
            stringify!(keylen_nzttPKCS7ProtInfo)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union nzttProtInfo {
    pub pkcs7_nzttProtInfo: nzttPKCS7ProtInfo,
    _bindgen_union_align: [u32; 3usize],
}
#[test]
fn bindgen_test_layout_nzttProtInfo() {
    assert_eq!(
        ::std::mem::size_of::<nzttProtInfo>(),
        12usize,
        concat!("Size of: ", stringify!(nzttProtInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<nzttProtInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(nzttProtInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nzttProtInfo>())).pkcs7_nzttProtInfo as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttProtInfo),
            "::",
            stringify!(pkcs7_nzttProtInfo)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzttPersonaDesc {
    pub privlen_nzttPersonaDesc: ub4,
    pub priv_nzttPersonaDesc: *mut ub1,
    pub prllen_nzttPersonaDesc: ub4,
    pub prl_nzttPersonaDesc: *mut text,
    pub aliaslen_nzttPersonaDesc: ub4,
    pub alias_nzttPersonaDesc: *mut text,
    pub longlen_nzttPersonaDesc: ub4,
    pub long_nzttPersonaDesc: *mut text,
}
#[test]
fn bindgen_test_layout_nzttPersonaDesc() {
    assert_eq!(
        ::std::mem::size_of::<nzttPersonaDesc>(),
        64usize,
        concat!("Size of: ", stringify!(nzttPersonaDesc))
    );
    assert_eq!(
        ::std::mem::align_of::<nzttPersonaDesc>(),
        8usize,
        concat!("Alignment of ", stringify!(nzttPersonaDesc))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttPersonaDesc>())).privlen_nzttPersonaDesc as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersonaDesc),
            "::",
            stringify!(privlen_nzttPersonaDesc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttPersonaDesc>())).priv_nzttPersonaDesc as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersonaDesc),
            "::",
            stringify!(priv_nzttPersonaDesc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttPersonaDesc>())).prllen_nzttPersonaDesc as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersonaDesc),
            "::",
            stringify!(prllen_nzttPersonaDesc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttPersonaDesc>())).prl_nzttPersonaDesc as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersonaDesc),
            "::",
            stringify!(prl_nzttPersonaDesc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttPersonaDesc>())).aliaslen_nzttPersonaDesc as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersonaDesc),
            "::",
            stringify!(aliaslen_nzttPersonaDesc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttPersonaDesc>())).alias_nzttPersonaDesc as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersonaDesc),
            "::",
            stringify!(alias_nzttPersonaDesc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttPersonaDesc>())).longlen_nzttPersonaDesc as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersonaDesc),
            "::",
            stringify!(longlen_nzttPersonaDesc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttPersonaDesc>())).long_nzttPersonaDesc as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttPersonaDesc),
            "::",
            stringify!(long_nzttPersonaDesc)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nzttIdentityDesc {
    pub publen_nzttIdentityDesc: ub4,
    pub pub_nzttIdentityDesc: *mut ub1,
    pub dnlen_nzttIdentityDesc: ub4,
    pub dn_nzttIdentityDesc: *mut text,
    pub longlen_nzttIdentityDesc: ub4,
    pub long_nzttIdentityDesc: *mut text,
    pub quallen_nzttIdentityDesc: ub4,
    pub trustqual_nzttIdentityDesc: *mut text,
}
#[test]
fn bindgen_test_layout_nzttIdentityDesc() {
    assert_eq!(
        ::std::mem::size_of::<nzttIdentityDesc>(),
        64usize,
        concat!("Size of: ", stringify!(nzttIdentityDesc))
    );
    assert_eq!(
        ::std::mem::align_of::<nzttIdentityDesc>(),
        8usize,
        concat!("Alignment of ", stringify!(nzttIdentityDesc))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttIdentityDesc>())).publen_nzttIdentityDesc as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttIdentityDesc),
            "::",
            stringify!(publen_nzttIdentityDesc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttIdentityDesc>())).pub_nzttIdentityDesc as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttIdentityDesc),
            "::",
            stringify!(pub_nzttIdentityDesc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttIdentityDesc>())).dnlen_nzttIdentityDesc as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttIdentityDesc),
            "::",
            stringify!(dnlen_nzttIdentityDesc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttIdentityDesc>())).dn_nzttIdentityDesc as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttIdentityDesc),
            "::",
            stringify!(dn_nzttIdentityDesc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttIdentityDesc>())).longlen_nzttIdentityDesc as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttIdentityDesc),
            "::",
            stringify!(longlen_nzttIdentityDesc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttIdentityDesc>())).long_nzttIdentityDesc as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttIdentityDesc),
            "::",
            stringify!(long_nzttIdentityDesc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttIdentityDesc>())).quallen_nzttIdentityDesc as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttIdentityDesc),
            "::",
            stringify!(quallen_nzttIdentityDesc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nzttIdentityDesc>())).trustqual_nzttIdentityDesc as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(nzttIdentityDesc),
            "::",
            stringify!(trustqual_nzttIdentityDesc)
        )
    );
}
extern "C" {
    pub fn nztwOpenWallet(
        arg1: *mut nzctx,
        arg2: ub4,
        arg3: *mut text,
        arg4: ub4,
        arg5: *mut text,
        arg6: *mut nzttWallet,
    ) -> nzerror;
}
extern "C" {
    pub fn nztwCloseWallet(arg1: *mut nzctx, arg2: *mut nzttWallet) -> nzerror;
}
extern "C" {
    #[doc = "NOTE: This function is a temporary hack.****/"]
    pub fn nztwGetCertInfo(
        nz_context: *mut nzctx,
        nzosCtx: *mut nzosContext,
        walletRef: *mut nzttWallet,
        peerCert: *mut ::std::os::raw::c_void,
    ) -> nzerror;
}
extern "C" {
    pub fn nztwRetrievePersonaCopy(
        arg1: *mut nzctx,
        arg2: *mut nzttWallet,
        arg3: ub4,
        arg4: *mut *mut nzttPersona,
    ) -> nzerror;
}
extern "C" {
    pub fn nztwRetrievePersonaCopyByName(
        arg1: *mut nzctx,
        arg2: *mut nzttWallet,
        arg3: *mut ::std::os::raw::c_char,
        arg4: *mut *mut nzttPersona,
    ) -> nzerror;
}
extern "C" {
    pub fn nzteOpenPersona(arg1: *mut nzctx, arg2: *mut nzttPersona) -> nzerror;
}
extern "C" {
    pub fn nzteClosePersona(arg1: *mut nzctx, arg2: *mut nzttPersona) -> nzerror;
}
extern "C" {
    pub fn nzteDestroyPersona(arg1: *mut nzctx, arg2: *mut *mut nzttPersona) -> nzerror;
}
extern "C" {
    pub fn nzteRetrieveTrustedIdentCopy(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: ub4,
        arg4: *mut *mut nzttIdentity,
    ) -> nzerror;
}
extern "C" {
    pub fn nztePriKey(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: *mut *mut ub1,
        arg4: *mut ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nzteMyCert(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: *mut *mut ub1,
        arg4: *mut ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nzteX509CreatePersona(
        arg1: *mut nzctx,
        arg2: *mut ub1,
        arg3: ub4,
        arg4: *mut *mut nzttPersona,
    ) -> nzerror;
}
extern "C" {
    pub fn nztiCreateIdentity(
        arg1: *mut nzctx,
        arg2: nzttVersion,
        arg3: *mut nzttIdentityDesc,
        arg4: *mut *mut nzttIdentity,
    ) -> nzerror;
}
extern "C" {
    pub fn nztiAbortIdentity(arg1: *mut nzctx, arg2: *mut *mut nzttIdentity) -> nzerror;
}
extern "C" {
    pub fn nztific_FreeIdentityContent(ossctx: *mut nzctx, identity: *mut nzttIdentity) -> nzerror;
}
extern "C" {
    pub fn nztSign(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: nzttces,
        arg4: ub4,
        arg5: *mut ub1,
        arg6: *mut nzttBufferBlock,
    ) -> nzerror;
}
extern "C" {
    pub fn nztVerify(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: nzttces,
        arg4: ub4,
        arg5: *mut ub1,
        arg6: *mut nzttBufferBlock,
        arg7: *mut boolean,
        arg8: *mut boolean,
        arg9: *mut *mut nzttIdentity,
    ) -> nzerror;
}
extern "C" {
    pub fn nztValidate(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: *mut nzttIdentity,
        arg4: *mut boolean,
    ) -> nzerror;
}
extern "C" {
    pub fn nztsd_SignDetached(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: nzttces,
        arg4: ub4,
        arg5: *mut ub1,
        arg6: *mut nzttBufferBlock,
    ) -> nzerror;
}
extern "C" {
    pub fn nztved_VerifyDetached(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: nzttces,
        arg4: ub4,
        arg5: *mut ub1,
        arg6: ub4,
        arg7: *mut ub1,
        arg8: *mut boolean,
        arg9: *mut boolean,
        arg10: *mut *mut nzttIdentity,
    ) -> nzerror;
}
extern "C" {
    pub fn nztkec_PKEncrypt(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: ub4,
        arg4: *mut nzttIdentity,
        arg5: nzttces,
        arg6: ub4,
        arg7: *mut ub1,
        arg8: *mut nzttBufferBlock,
    ) -> nzerror;
}
extern "C" {
    pub fn nztxkec_PKEncryptExpansion(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: ub4,
        arg4: ub4,
        arg5: *mut ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nztkdc_PKDecrypt(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: nzttces,
        arg4: ub4,
        arg5: *mut ub1,
        arg6: *mut nzttBufferBlock,
    ) -> nzerror;
}
extern "C" {
    pub fn nztHash(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: nzttces,
        arg4: ub4,
        arg5: *mut ub1,
        arg6: *mut nzttBufferBlock,
    ) -> nzerror;
}
extern "C" {
    pub fn nztSeedRandom(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: ub4,
        arg4: *mut ub1,
    ) -> nzerror;
}
extern "C" {
    pub fn nztrb_RandomBytes(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: ub4,
        arg4: *mut nzttBufferBlock,
    ) -> nzerror;
}
extern "C" {
    pub fn nztrn_RandomNumber(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: *mut uword,
    ) -> nzerror;
}
extern "C" {
    pub fn nztbbInitBlock(arg1: *mut nzctx, arg2: *mut nzttBufferBlock) -> nzerror;
}
extern "C" {
    pub fn nztbbReuseBlock(arg1: *mut nzctx, arg2: *mut nzttBufferBlock) -> nzerror;
}
extern "C" {
    pub fn nztbbSizeBlock(arg1: *mut nzctx, arg2: ub4, arg3: *mut nzttBufferBlock) -> nzerror;
}
extern "C" {
    pub fn nztbbGrowBlock(arg1: *mut nzctx, arg2: ub4, arg3: *mut nzttBufferBlock) -> nzerror;
}
extern "C" {
    pub fn nztbbPurgeBlock(arg1: *mut nzctx, arg2: *mut nzttBufferBlock) -> nzerror;
}
extern "C" {
    pub fn nztbbSetBlock(
        arg1: *mut nzctx,
        arg2: uword,
        arg3: ub4,
        arg4: ub4,
        arg5: *mut ub1,
        arg6: *mut nzttBufferBlock,
    ) -> nzerror;
}
extern "C" {
    pub fn nztiGetSecInfo(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: *mut *mut text,
        arg4: *mut ub4,
        arg5: *mut *mut text,
        arg6: *mut ub4,
        arg7: *mut *mut ub1,
        arg8: *mut ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nztiGetDName(
        arg1: *mut nzctx,
        arg2: *mut nzttIdentity,
        arg3: *mut *mut text,
        arg4: *mut ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nztiGetIssuerName(
        arg1: *mut nzctx,
        arg2: *mut nzttIdentity,
        arg3: *mut *mut text,
        arg4: *mut ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nztgch_GetCertHash(
        arg1: *mut nzctx,
        arg2: *const nzttIdentity,
        arg3: *mut *mut ub1,
        arg4: *mut ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nztdbuf_DestroyBuf(arg1: *mut nzctx, arg2: *mut *mut ::std::os::raw::c_void) -> nzerror;
}
extern "C" {
    pub fn nztGetCertChain(arg1: *mut nzctx, arg2: *mut nzttWallet) -> nzerror;
}
extern "C" {
    pub fn nztCompareDN(
        arg1: *mut nzctx,
        arg2: *mut ub1,
        arg3: ub4,
        arg4: *mut ub1,
        arg5: ub4,
        arg6: *mut boolean,
    ) -> nzerror;
}
extern "C" {
    pub fn nztCheckValidity(arg1: *mut nzctx, arg2: ub4, arg3: ub4) -> nzerror;
}
extern "C" {
    pub fn nztCheckValidity_ext(arg1: *mut nzctx, arg2: ub8, arg3: ub8) -> nzerror;
}
extern "C" {
    pub fn nztwCreateWallet(
        arg1: *mut nzctx,
        arg2: ub4,
        arg3: *mut text,
        arg4: ub4,
        arg5: *mut text,
        arg6: *mut nzttWallet,
    ) -> nzerror;
}
extern "C" {
    pub fn nztwDestroyWallet(
        arg1: *mut nzctx,
        arg2: ub4,
        arg3: *mut text,
        arg4: ub4,
        arg5: *mut text,
    ) -> nzerror;
}
extern "C" {
    pub fn nzteStorePersona(
        arg1: *mut nzctx,
        arg2: *mut *mut nzttPersona,
        arg3: *mut nzttWallet,
    ) -> nzerror;
}
extern "C" {
    pub fn nzteRemovePersona(arg1: *mut nzctx, arg2: *mut *mut nzttPersona) -> nzerror;
}
extern "C" {
    pub fn nzteCreatePersona(
        arg1: *mut nzctx,
        arg2: nzttVersion,
        arg3: nzttCipherType,
        arg4: *mut nzttPersonaDesc,
        arg5: *mut *mut nzttPersona,
    ) -> nzerror;
}
extern "C" {
    pub fn nztiStoreTrustedIdentity(
        arg1: *mut nzctx,
        arg2: *mut *mut nzttIdentity,
        arg3: *mut nzttPersona,
    ) -> nzerror;
}
extern "C" {
    pub fn nzteSetProtection(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: nzttcef,
        arg4: nztttdufmt,
        arg5: *mut nzttProtInfo,
    ) -> nzerror;
}
extern "C" {
    pub fn nzteGetProtection(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: nzttcef,
        arg4: *mut nztttdufmt,
        arg5: *mut nzttProtInfo,
    ) -> nzerror;
}
extern "C" {
    pub fn nztiRemoveIdentity(arg1: *mut nzctx, arg2: *mut *mut nzttIdentity) -> nzerror;
}
extern "C" {
    pub fn nztifdn(
        ossctx: *mut nzctx,
        length: ub4,
        distinguished_name: *mut text,
        ppidentity: *mut *mut nzttIdentity,
    ) -> nzerror;
}
extern "C" {
    pub fn nztxSignExpansion(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: ub4,
        arg4: *mut ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nztxsd_SignDetachedExpansion(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: ub4,
        arg4: *mut ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nztEncrypt(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: nzttces,
        arg4: ub4,
        arg5: *mut ub1,
        arg6: *mut nzttBufferBlock,
    ) -> nzerror;
}
extern "C" {
    pub fn nztxEncryptExpansion(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: ub4,
        arg4: *mut ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nztDecrypt(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: nzttces,
        arg4: ub4,
        arg5: *mut ub1,
        arg6: *mut nzttBufferBlock,
    ) -> nzerror;
}
extern "C" {
    pub fn nztEnvelope(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: ub4,
        arg4: *mut nzttIdentity,
        arg5: nzttces,
        arg6: ub4,
        arg7: *mut ub1,
        arg8: *mut nzttBufferBlock,
    ) -> nzerror;
}
extern "C" {
    pub fn nztDeEnvelope(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: nzttces,
        arg4: ub4,
        arg5: *mut ub1,
        arg6: *mut nzttBufferBlock,
        arg7: *mut boolean,
        arg8: *mut boolean,
        arg9: *mut *mut nzttIdentity,
    ) -> nzerror;
}
extern "C" {
    pub fn nztKeyedHash(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: nzttces,
        arg4: ub4,
        arg5: *mut ub1,
        arg6: *mut nzttBufferBlock,
    ) -> nzerror;
}
extern "C" {
    pub fn nztxKeyedHashExpansion(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: ub4,
        arg4: *mut ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nztxHashExpansion(
        arg1: *mut nzctx,
        arg2: *mut nzttPersona,
        arg3: ub4,
        arg4: *mut ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nztiae_IsAuthEnabled(
        ctx: *mut nzctx,
        ncipher: ub2,
        authEnabled: *mut boolean,
    ) -> nzerror;
}
extern "C" {
    pub fn nztiee_IsEncrEnabled(
        ctx: *mut nzctx,
        ncipher: ub2,
        EncrEnabled: *mut boolean,
    ) -> nzerror;
}
extern "C" {
    pub fn nztihe_IsHashEnabled(
        ctx: *mut nzctx,
        ncipher: ub2,
        hashEnabled: *mut boolean,
    ) -> nzerror;
}
extern "C" {
    pub fn nztGetIssuerName(
        ctx: *mut nzctx,
        identity: *mut nzttIdentity,
        issuername: *mut *mut ub1,
        issuernamelen: *mut ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nztGetSubjectName(
        ctx: *mut nzctx,
        identity: *mut nzttIdentity,
        subjectname: *mut *mut ub1,
        subjectnamelen: *mut ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nztGetBase64Cert(
        ctx: *mut nzctx,
        identity: *mut nzttIdentity,
        b64cert: *mut *mut ub1,
        b64certlen: *mut ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nztGetSerialNumber(
        ctx: *mut nzctx,
        identity: *mut nzttIdentity,
        serialnum: *mut *mut ub1,
        serialnumlen: *mut ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nztSS_Serialnum_to_String(
        ctx: *mut nzctx,
        pSerialNum: *mut nzstrc,
        pCertserial: *mut ub1,
        certseriallen: ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nztGetValidDate(
        ctx: *mut nzctx,
        identity: *mut nzttIdentity,
        startdate: *mut ub4,
        enddate: *mut ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nztGetValidDate_ext(
        ctx: *mut nzctx,
        identity: *mut nzttIdentity,
        startdate: *mut ub8,
        enddate: *mut ub8,
    ) -> nzerror;
}
extern "C" {
    pub fn nztGetVersion(
        ctx: *mut nzctx,
        identity: *mut nzttIdentity,
        pVerStr: *mut nzstrc,
    ) -> nzerror;
}
extern "C" {
    pub fn nztGetPublicKey(
        ctx: *mut nzctx,
        identity: *mut nzttIdentity,
        pubKey: *mut *mut ub1,
        pubKeylen: *mut ub4,
    ) -> nzerror;
}
extern "C" {
    pub fn nztGenericDestroy(ctx: *mut nzctx, var: *mut *mut ub1) -> nzerror;
}
extern "C" {
    pub fn nztSetAppDefaultLocation(ctx: *mut nzctx, arg1: *mut text, arg2: size_t) -> nzerror;
}
extern "C" {
    pub fn nztSearchNZDefault(ctx: *mut nzctx, search: *mut boolean) -> nzerror;
}
extern "C" {
    pub fn nztSetLightWeight(ctx: *mut nzctx, flag: boolean) -> nzerror;
}
extern "C" {
    pub fn nzICE_Install_Cert_ext(
        oss_context: *mut nzctx,
        pWallet: *mut nzttWallet,
        pPersona: *mut nzttPersona,
        pCertbuf: *mut ub1,
        certbuflen: ub4,
        certtype: boolean,
        pIdtypestr: *mut nzstrc,
        trustflag: nzTrustFlag,
        ppCertOrTP: *mut *mut nzttIdentity,
    ) -> nzerror;
}
extern "C" {
    #[doc = " nzMF_Modify_TrustFlags"]
    pub fn nzMF_Modify_TrustFlags(
        oss_context: *mut nzctx,
        pWallet: *mut nzttWallet,
        pPersona: *mut nzttPersona,
        pCert: *mut nzttIdentity,
        trustflag: ::std::os::raw::c_int,
    ) -> nzerror;
}
#[doc = "DESCRIPTION"]
#[doc = ""]
#[doc = "Note: the descriptions of the functions are alphabetically arranged. Please"]
#[doc = "maintain the arrangement when adding a new function description. The actual"]
#[doc = "prototypes are below this comment section and donot follow any alphabetical"]
#[doc = "ordering."]
#[doc = ""]
#[doc = ""]
#[doc = "--------------------------------OCIAttrGet------------------------------------"]
#[doc = ""]
#[doc = "OCIAttrGet()"]
#[doc = "Name"]
#[doc = "OCI Attribute Get"]
#[doc = "Purpose"]
#[doc = "This call is used to get a particular attribute of a handle."]
#[doc = "Syntax"]
#[doc = "sword OCIAttrGet ( const void    *trgthndlp,"]
#[doc = "ub4            trghndltyp,"]
#[doc = "void          *attributep,"]
#[doc = "ub4            *sizep,"]
#[doc = "ub4            attrtype,"]
#[doc = "OCIError       *errhp );"]
#[doc = "Comments"]
#[doc = "This call is used to get a particular attribute of a handle."]
#[doc = "See Appendix B,  \"Handle Attributes\",  for a list of handle types and their"]
#[doc = "readable attributes."]
#[doc = "Parameters"]
#[doc = "trgthndlp (IN) - is the pointer to a handle type."]
#[doc = "trghndltyp (IN) - is the handle type."]
#[doc = "attributep (OUT) - is a pointer to the storage for an attribute value. The"]
#[doc = "attribute value is filled in."]
#[doc = "sizep (OUT) - is the size of the attribute value."]
#[doc = "This can be passed in as NULL for most parameters as the size is well known."]
#[doc = "For text* parameters, a pointer to a ub4 must be passed in to get the length"]
#[doc = "of the string."]
#[doc = "attrtype (IN) - is the type of attribute."]
#[doc = "errhp (IN/OUT) - an error handle which can be passed to OCIErrorGet() for"]
#[doc = "diagnostic information in the event of an error."]
#[doc = "Related Functions"]
#[doc = "OCIAttrSet()"]
#[doc = ""]
#[doc = "--------------------------------OCIAttrSet------------------------------------"]
#[doc = ""]
#[doc = ""]
#[doc = "OCIAttrSet()"]
#[doc = "Name"]
#[doc = "OCI Attribute Set"]
#[doc = "Purpose"]
#[doc = "This call is used to set a particular attribute of a handle or a descriptor."]
#[doc = "Syntax"]
#[doc = "sword OCIAttrSet ( void       *trgthndlp,"]
#[doc = "ub4         trghndltyp,"]
#[doc = "void       *attributep,"]
#[doc = "ub4         size,"]
#[doc = "ub4         attrtype,"]
#[doc = "OCIError    *errhp );"]
#[doc = "Comments"]
#[doc = "This call is used to set a particular attribute of a handle or a descriptor."]
#[doc = "See Appendix B for a list of handle types and their writeable attributes."]
#[doc = "Parameters"]
#[doc = "trghndlp (IN/OUT) - the pointer to a handle type whose attribute gets"]
#[doc = "modified."]
#[doc = "trghndltyp (IN/OUT) - is the handle type."]
#[doc = "attributep (IN) - a pointer to an attribute value."]
#[doc = "The attribute value is copied into the target handle. If the attribute value"]
#[doc = "is a pointer, then only the pointer is copied, not the contents of the pointer."]
#[doc = "size (IN) - is the size of an attribute value. This can be passed in as 0 for"]
#[doc = "most attributes as the size is already known by the OCI library. For text*"]
#[doc = "attributes, a ub4 must be passed in set to the length of the string."]
#[doc = "attrtype (IN) - the type of attribute being set."]
#[doc = "errhp (IN/OUT) - an error handle which can be passed to OCIErrorGet() for"]
#[doc = "diagnostic information in the event of an error."]
#[doc = "Related Functions"]
#[doc = "OCIAttrGet()"]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = "--------------------------------OCIBindArrayOfStruct--------------------------"]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = "OCIBindArrayOfStruct()"]
#[doc = "Name"]
#[doc = "OCI Bind for Array of Structures"]
#[doc = "Purpose"]
#[doc = "This call sets up the skip parameters for a static array bind."]
#[doc = "Syntax"]
#[doc = "sword OCIBindArrayOfStruct ( OCIBind     *bindp,"]
#[doc = "OCIError    *errhp,"]
#[doc = "ub4         pvskip,"]
#[doc = "ub4         indskip,"]
#[doc = "ub4         alskip,"]
#[doc = "ub4         rcskip );"]
#[doc = "Comments"]
#[doc = "This call sets up the skip parameters necessary for a static array bind."]
#[doc = "This call follows a call to OCIBindByName() or OCIBindByPos(). The bind"]
#[doc = "handle returned by that initial bind call is used as a parameter for the"]
#[doc = "OCIBindArrayOfStruct() call."]
#[doc = "For information about skip parameters, see the section \"Arrays of Structures\""]
#[doc = "on page 4-16."]
#[doc = "Parameters"]
#[doc = "bindp (IN) - the handle to a bind structure."]
#[doc = "errhp (IN) - an error handle which can be passed to OCIErrorGet() for"]
#[doc = "diagnostic information in the event of an error."]
#[doc = "pvskip (IN) - skip parameter for the next data value."]
#[doc = "indskip (IN) - skip parameter for the next indicator value or structure."]
#[doc = "alskip (IN) - skip parameter for the next actual length value."]
#[doc = "rcskip (IN) - skip parameter for the next column-level return code value."]
#[doc = "Related Functions"]
#[doc = "OCIAttrGet()"]
#[doc = ""]
#[doc = ""]
#[doc = "--------------------------------OCIBindByName---------------------------------"]
#[doc = ""]
#[doc = "OCIBindByName()"]
#[doc = "Name"]
#[doc = "OCI Bind by Name"]
#[doc = "Purpose"]
#[doc = "Creates an association between a program variable and a placeholder in a SQL"]
#[doc = "statement or PL/SQL block."]
#[doc = "Syntax"]
#[doc = "sword OCIBindByName ("]
#[doc = "OCIStmt       *stmtp,"]
#[doc = "OCIBind       **bindp,"]
#[doc = "OCIError      *errhp,"]
#[doc = "const OraText    *placeholder,"]
#[doc = "sb4           placeh_len,"]
#[doc = "void         *valuep,"]
#[doc = "sb4           value_sz,"]
#[doc = "ub2           dty,"]
#[doc = "void         *indp,"]
#[doc = "ub2           *alenp,"]
#[doc = "ub2           *rcodep,"]
#[doc = "ub4           maxarr_len,"]
#[doc = "ub4           *curelep,"]
#[doc = "ub4           mode );"]
#[doc = "Description"]
#[doc = "This call is used to perform a basic bind operation. The bind creates an"]
#[doc = "association between the address of a program variable and a placeholder in a"]
#[doc = "SQL statement or PL/SQL block. The bind call also specifies the type of data"]
#[doc = "which is being bound, and may also indicate the method by which data will be"]
#[doc = "provided at runtime."]
#[doc = "This function also implicitly allocates the bind handle indicated by the bindp"]
#[doc = "parameter."]
#[doc = "Data in an OCI application can be bound to placeholders statically or"]
#[doc = "dynamically. Binding is static when all the IN bind data and the OUT bind"]
#[doc = "buffers are well-defined just before the execute. Binding is dynamic when the"]
#[doc = "IN bind data and the OUT bind buffers are provided by the application on"]
#[doc = "demand at execute time to the client library. Dynamic binding is indicated by"]
#[doc = "setting the mode parameter of this call to OCI_DATA_AT_EXEC."]
#[doc = "Related Functions: For more information about dynamic binding, see"]
#[doc = "the section \"Runtime Data Allocation and Piecewise Operations\" on"]
#[doc = "page 5-16."]
#[doc = "Both OCIBindByName() and OCIBindByPos() take as a parameter a bind handle,"]
#[doc = "which is implicitly allocated by the bind call A separate bind handle is"]
#[doc = "allocated for each placeholder the application is binding."]
#[doc = "Additional bind calls may be required to specify particular attributes"]
#[doc = "necessary when binding certain data types or handling input data in certain"]
#[doc = "ways:"]
#[doc = "If arrays of structures are being utilized, OCIBindArrayOfStruct() must"]
#[doc = "be called to set up the necessary skip parameters."]
#[doc = "If data is being provided dynamically at runtime, and the application"]
#[doc = "will be using user-defined callback functions, OCIBindDynamic() must"]
#[doc = "be called to register the callbacks."]
#[doc = "If a named data type is being bound, OCIBindObject() must be called to"]
#[doc = "specify additional necessary information."]
#[doc = "Parameters"]
#[doc = "stmth (IN/OUT) - the statement handle to the SQL or PL/SQL statement"]
#[doc = "being processed."]
#[doc = "bindp (IN/OUT) - a pointer to a pointer to a bind handle which is implicitly"]
#[doc = "allocated by this call.  The bind handle  maintains all the bind information"]
#[doc = "for this particular input value. The handle is feed implicitly when the"]
#[doc = "statement handle is deallocated."]
#[doc = "errhp (IN/OUT) - an error handle which can be passed to OCIErrorGet() for"]
#[doc = "diagnostic information in the event of an error."]
#[doc = "placeholder (IN) - the placeholder attributes are specified by name if"]
#[doc = "ocibindn() is being called."]
#[doc = "placeh_len (IN) - the length of the placeholder name specified in placeholder."]
#[doc = "valuep (IN/OUT) - a pointer to a data value or an array of data values of the"]
#[doc = "type specified in the dty parameter. An array of data values can be specified"]
#[doc = "for mapping into a PL/SQL table or for providing data for SQL multiple-row"]
#[doc = "operations. When an array of bind values is provided, this is called an array"]
#[doc = "bind in OCI terms. Additional attributes of the array bind (not bind to a"]
#[doc = "column of ARRAY type) are set up in OCIBindArrayOfStruct() call."]
#[doc = "For a REF, named data type  bind, the valuep parameter is used only for IN"]
#[doc = "bind data. The pointers to OUT buffers are set in the pgvpp parameter"]
#[doc = "initialized by OCIBindObject(). For named data type and REF binds, the bind"]
#[doc = "values are unpickled into the Object Cache. The OCI object navigational calls"]
#[doc = "can then be used to navigate the objects and the refs in the Object Cache."]
#[doc = "If the OCI_DATA_AT_EXEC mode is specified in the mode parameter, valuep"]
#[doc = "is ignored for all data types. OCIBindArrayOfStruct() cannot be used and"]
#[doc = "OCIBindDynamic() must be invoked to provide callback functions if desired."]
#[doc = "value_sz (IN) - the size of a data value. In the case of an array bind, this is"]
#[doc = "the maximum size of any element possible with the actual sizes being specified"]
#[doc = "in the alenp parameter."]
#[doc = "If the OCI_DATA_AT_EXEC mode is specified, valuesz defines the maximum"]
#[doc = "size of the data that can be ever provided at runtime for data types other than"]
#[doc = "named data types or REFs."]
#[doc = "dty (IN) - the data type of the value(s) being bound. Named data types"]
#[doc = "(SQLT_NTY) and REFs (SQLT_REF) are valid only if the application has been"]
#[doc = "initialized in object mode. For named data types, or REFs, additional calls"]
#[doc = "must be made with the bind handle to set up the datatype-specific attributes."]
#[doc = "indp (IN/OUT) - pointer to an indicator variable or array. For scalar data"]
#[doc = "types, this is a pointer to sb2 or an array of sb2s. For named data types,"]
#[doc = "this pointer is ignored and the actual pointer to the indicator structure or"]
#[doc = "an array of indicator structures is initialized by OCIBindObject()."]
#[doc = "Ignored for dynamic binds."]
#[doc = "See the section \"Indicator Variables\" on page 2-43 for more information about"]
#[doc = "indicator variables."]
#[doc = "alenp (IN/OUT) - pointer to array of actual lengths of array elements. Each"]
#[doc = "element in alenp is the length of the data in the corresponding element in the"]
#[doc = "bind value array before and after the execute. This parameter is ignored for"]
#[doc = "dynamic binds."]
#[doc = "rcodep (OUT) - pointer to array of column level return codes. This parameter"]
#[doc = "is ignored for dynamic binds."]
#[doc = "maxarr_len (IN) - the maximum possible number of elements of type dty in a"]
#[doc = "PL/SQL binds. This parameter is not required for non-PL/SQL binds. If"]
#[doc = "maxarr_len is non-zero, then either OCIBindDynamic() or"]
#[doc = "OCIBindArrayOfStruct() can be invoked to set up additional bind attributes."]
#[doc = "curelep(IN/OUT) - a pointer to the actual number of elements. This parameter"]
#[doc = "is only required for PL/SQL binds."]
#[doc = "mode (IN) - the valid modes for this parameter are:"]
#[doc = "OCI_DEFAULT. This is default mode."]
#[doc = "OCI_DATA_AT_EXEC. When this mode is selected, the value_sz"]
#[doc = "parameter defines the maximum size of the data that can be ever"]
#[doc = "provided at runtime. The application must be ready to provide the OCI"]
#[doc = "library runtime IN data buffers at any time and any number of times."]
#[doc = "Runtime data is provided in one of the two ways:"]
#[doc = "callbacks using a user-defined function which must be registered"]
#[doc = "with a subsequent call to OCIBindDynamic()."]
#[doc = "a polling mechanism using calls supplied by the OCI. This mode"]
#[doc = "is assumed if no callbacks are defined."]
#[doc = "For more information about using the OCI_DATA_AT_EXEC mode, see"]
#[doc = "the section \"Runtime Data Allocation and Piecewise Operations\" on"]
#[doc = "page 5-16."]
#[doc = "When the allocated buffers are not required any more, they should be"]
#[doc = "freed by the client."]
#[doc = "Related Functions"]
#[doc = "OCIBindDynamic(), OCIBindObject(), OCIBindArrayOfStruct(), OCIAttrGet()"]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = "-------------------------------OCIBindByPos-----------------------------------"]
#[doc = ""]
#[doc = ""]
#[doc = "OCIBindByPos()"]
#[doc = "Name"]
#[doc = "OCI Bind by Position"]
#[doc = "Purpose"]
#[doc = "Creates an association between a program variable and a placeholder in a SQL"]
#[doc = "statement or PL/SQL block."]
#[doc = "Syntax"]
#[doc = "sword OCIBindByPos ("]
#[doc = "OCIStmt      *stmtp,"]
#[doc = "OCIBind      **bindp,"]
#[doc = "OCIError     *errhp,"]
#[doc = "ub4          position,"]
#[doc = "void        *valuep,"]
#[doc = "sb4          value_sz,"]
#[doc = "ub2          dty,"]
#[doc = "void        *indp,"]
#[doc = "ub2          *alenp,"]
#[doc = "ub2          *rcodep,"]
#[doc = "ub4          maxarr_len,"]
#[doc = "ub4          *curelep,"]
#[doc = "ub4          mode);"]
#[doc = ""]
#[doc = "Description"]
#[doc = "This call is used to perform a basic bind operation. The bind creates an"]
#[doc = "association between the address of a program variable and a placeholder in a"]
#[doc = "SQL statement or PL/SQL block. The bind call also specifies the type of data"]
#[doc = "which is being bound, and may also indicate the method by which data will be"]
#[doc = "provided at runtime."]
#[doc = "This function also implicitly allocates the bind handle indicated by the bindp"]
#[doc = "parameter."]
#[doc = "Data in an OCI application can be bound to placeholders statically or"]
#[doc = "dynamically. Binding is static when all the IN bind data and the OUT bind"]
#[doc = "buffers are well-defined just before the execute. Binding is dynamic when the"]
#[doc = "IN bind data and the OUT bind buffers are provided by the application on"]
#[doc = "demand at execute time to the client library. Dynamic binding is indicated by"]
#[doc = "setting the mode parameter of this call to OCI_DATA_AT_EXEC."]
#[doc = "Related Functions: For more information about dynamic binding, see"]
#[doc = "the section \"Runtime Data Allocation and Piecewise Operations\" on"]
#[doc = "page 5-16"]
#[doc = "Both OCIBindByName() and OCIBindByPos() take as a parameter a bind handle,"]
#[doc = "which is implicitly allocated by the bind call A separate bind handle is"]
#[doc = "allocated for each placeholder the application is binding."]
#[doc = "Additional bind calls may be required to specify particular attributes"]
#[doc = "necessary when binding certain data types or handling input data in certain"]
#[doc = "ways:"]
#[doc = "If arrays of structures are being utilized, OCIBindArrayOfStruct() must"]
#[doc = "be called to set up the necessary skip parameters."]
#[doc = "If data is being provided dynamically at runtime, and the application"]
#[doc = "will be using user-defined callback functions, OCIBindDynamic() must"]
#[doc = "be called to register the callbacks."]
#[doc = "If a named data type is being bound, OCIBindObject() must be called to"]
#[doc = "specify additional necessary information."]
#[doc = "Parameters"]
#[doc = "stmth (IN/OUT) - the statement handle to the SQL or PL/SQL statement"]
#[doc = "being processed."]
#[doc = "bindp (IN/OUT) - a pointer to a pointer to a bind handle which is implicitly"]
#[doc = "allocated by this call.  The bind handle  maintains all the bind information"]
#[doc = "for this particular input value. The handle is feed implicitly when the"]
#[doc = "statement handle is deallocated."]
#[doc = "errhp (IN/OUT) - an error handle which can be passed to OCIErrorGet() for"]
#[doc = "diagnostic information in the event of an error."]
#[doc = "position (IN) - the placeholder attributes are specified by position if"]
#[doc = "ocibindp() is being called."]
#[doc = "valuep (IN/OUT) - a pointer to a data value or an array of data values of the"]
#[doc = "type specified in the dty parameter. An array of data values can be specified"]
#[doc = "for mapping into a PL/SQL table or for providing data for SQL multiple-row"]
#[doc = "operations. When an array of bind values is provided, this is called an array"]
#[doc = "bind in OCI terms. Additional attributes of the array bind (not bind to a"]
#[doc = "column of ARRAY type) are set up in OCIBindArrayOfStruct() call."]
#[doc = "For a REF, named data type  bind, the valuep parameter is used only for IN"]
#[doc = "bind data. The pointers to OUT buffers are set in the pgvpp parameter"]
#[doc = "initialized by OCIBindObject(). For named data type and REF binds, the bind"]
#[doc = "values are unpickled into the Object Cache. The OCI object navigational calls"]
#[doc = "can then be used to navigate the objects and the refs in the Object Cache."]
#[doc = "If the OCI_DATA_AT_EXEC mode is specified in the mode parameter, valuep"]
#[doc = "is ignored for all data types. OCIBindArrayOfStruct() cannot be used and"]
#[doc = "OCIBindDynamic() must be invoked to provide callback functions if desired."]
#[doc = "value_sz (IN) - the size of a data value. In the case of an array bind, this is"]
#[doc = "the maximum size of any element possible with the actual sizes being specified"]
#[doc = "in the alenp parameter."]
#[doc = "If the OCI_DATA_AT_EXEC mode is specified, valuesz defines the maximum"]
#[doc = "size of the data that can be ever provided at runtime for data types other than"]
#[doc = "named data types or REFs."]
#[doc = "dty (IN) - the data type of the value(s) being bound. Named data types"]
#[doc = "(SQLT_NTY) and REFs (SQLT_REF) are valid only if the application has been"]
#[doc = "initialized in object mode. For named data types, or REFs, additional calls"]
#[doc = "must be made with the bind handle to set up the datatype-specific attributes."]
#[doc = "indp (IN/OUT) - pointer to an indicator variable or array. For scalar data"]
#[doc = "types, this is a pointer to sb2 or an array of sb2s. For named data types,"]
#[doc = "this pointer is ignored and the actual pointer to the indicator structure or"]
#[doc = "an array of indicator structures is initialized by OCIBindObject(). Ignored"]
#[doc = "for dynamic binds."]
#[doc = "See the section \"Indicator Variables\" on page 2-43 for more information about"]
#[doc = "indicator variables."]
#[doc = "alenp (IN/OUT) - pointer to array of actual lengths of array elements. Each"]
#[doc = "element in alenp is the length of the data in the corresponding element in the"]
#[doc = "bind value array before and after the execute. This parameter is ignored for"]
#[doc = "dynamic binds."]
#[doc = "rcodep (OUT) - pointer to array of column level return codes. This parameter"]
#[doc = "is ignored for dynamic binds."]
#[doc = "maxarr_len (IN) - the maximum possible number of elements of type dty in a"]
#[doc = "PL/SQL binds. This parameter is not required for non-PL/SQL binds. If"]
#[doc = "maxarr_len is non-zero, then either OCIBindDynamic() or"]
#[doc = "OCIBindArrayOfStruct() can be invoked to set up additional bind attributes."]
#[doc = "curelep(IN/OUT) - a pointer to the actual number of elements. This parameter"]
#[doc = "is only required for PL/SQL binds."]
#[doc = "mode (IN) - the valid modes for this parameter are:"]
#[doc = "OCI_DEFAULT. This is default mode."]
#[doc = "OCI_DATA_AT_EXEC. When this mode is selected, the value_sz"]
#[doc = "parameter defines the maximum size of the data that can be ever"]
#[doc = "provided at runtime. The application must be ready to provide the OCI"]
#[doc = "library runtime IN data buffers at any time and any number of times."]
#[doc = "Runtime data is provided in one of the two ways:"]
#[doc = "callbacks using a user-defined function which must be registered"]
#[doc = "with a subsequent call to OCIBindDynamic() ."]
#[doc = "a polling mechanism using calls supplied by the OCI. This mode"]
#[doc = "is assumed if no callbacks are defined."]
#[doc = "For more information about using the OCI_DATA_AT_EXEC mode, see"]
#[doc = "the section \"Runtime Data Allocation and Piecewise Operations\" on"]
#[doc = "page 5-16."]
#[doc = "When the allocated buffers are not required any more, they should be"]
#[doc = "freed by the client."]
#[doc = "Related Functions"]
#[doc = "OCIBindDynamic(), OCIBindObject(), OCIBindArrayOfStruct(), OCIAttrGet()"]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = "-------------------------------OCIBindDynamic---------------------------------"]
#[doc = ""]
#[doc = "OCIBindDynamic()"]
#[doc = "Name"]
#[doc = "OCI Bind Dynamic Attributes"]
#[doc = "Purpose"]
#[doc = "This call is used to register user callbacks for dynamic data allocation."]
#[doc = "Syntax"]
#[doc = "sword OCIBindDynamic( OCIBind     *bindp,"]
#[doc = "OCIError    *errhp,"]
#[doc = "void       *ictxp,"]
#[doc = "OCICallbackInBind         (icbfp)("]
#[doc = "void            *ictxp,"]
#[doc = "OCIBind          *bindp,"]
#[doc = "ub4              iter,"]
#[doc = "ub4              index,"]
#[doc = "void            **bufpp,"]
#[doc = "ub4              *alenp,"]
#[doc = "ub1              *piecep,"]
#[doc = "void            **indp ),"]
#[doc = "void       *octxp,"]
#[doc = "OCICallbackOutBind         (ocbfp)("]
#[doc = "void            *octxp,"]
#[doc = "OCIBind          *bindp,"]
#[doc = "ub4              iter,"]
#[doc = "ub4              index,"]
#[doc = "void            **bufp,"]
#[doc = "ub4              **alenpp,"]
#[doc = "ub1              *piecep,"]
#[doc = "void            **indpp,"]
#[doc = "ub2              **rcodepp)   );"]
#[doc = "Comments"]
#[doc = "This call is used to register user-defined callback functions for providing"]
#[doc = "data for an UPDATE or INSERT if OCI_DATA_AT_EXEC mode was specified in a"]
#[doc = "previous call to OCIBindByName() or OCIBindByPos()."]
#[doc = "The callback function pointers must return OCI_CONTINUE if it the call is"]
#[doc = "successful. Any return code other than OCI_CONTINUE signals that the client"]
#[doc = "wishes to abort processing immediately."]
#[doc = "For more information about the OCI_DATA_AT_EXEC mode, see the section"]
#[doc = "\"Runtime Data Allocation and Piecewise Operations\" on page 5-16."]
#[doc = "Parameters"]
#[doc = "bindp (IN/OUT) - a bind handle returned by a call to OCIBindByName() or"]
#[doc = "OCIBindByPos()."]
#[doc = "errhp (IN/OUT) - an error handle which can be passed to OCIErrorGet() for"]
#[doc = "diagnostic information in the event of an error."]
#[doc = "ictxp (IN) - the context pointer required by the call back function icbfp."]
#[doc = "icbfp (IN) - the callback function which returns a pointer to the IN bind"]
#[doc = "value or piece at run time. The callback takes in the following parameters."]
#[doc = "ictxp (IN/OUT) - the context pointer for this callback function."]
#[doc = "bindp (IN) - the bind handle passed in to uniquely identify this bind"]
#[doc = "variable."]
#[doc = "iter (IN) - 1-based execute iteration value."]
#[doc = "index (IN) - index of the current array, for an array bind. 1 based not"]
#[doc = "greater than curele parameter of the bind call."]
#[doc = "index (IN) - index of the current array, for an array bind. This parameter"]
#[doc = "is 1-based, and may not be greater than curele parameter of the bind call."]
#[doc = "bufpp (OUT) - the pointer to the buffer."]
#[doc = "piecep (OUT) - which piece of the bind value. This can be one of the"]
#[doc = "following values - OCI_ONE_PIECE, OCI_FIRST_PIECE,"]
#[doc = "OCI_NEXT_PIECE and OCI_LAST_PIECE."]
#[doc = "indp (OUT) - contains the indicator value. This is apointer to either an"]
#[doc = "sb2 value or a pointer to an indicator structure for binding named data"]
#[doc = "types."]
#[doc = "indszp (OUT) - contains the indicator value size. A pointer containing"]
#[doc = "the size of either an sb2 or an indicator structure pointer."]
#[doc = "octxp (IN) - the context pointer required by the callback function ocbfp."]
#[doc = "ocbfp (IN) - the callback function which returns a pointer to the OUT bind"]
#[doc = "value or piece at run time. The callback takes in the following parameters."]
#[doc = "octxp (IN/OUT) - the context pointer for this call back function."]
#[doc = "bindp (IN) - the bind handle passed in to uniquely identify this bind"]
#[doc = "variable."]
#[doc = "iter (IN) - 1-based execute iteration value."]
#[doc = "index (IN) - index of the current array, for an array bind. This parameter"]
#[doc = "is 1-based, and must not be greater than curele parameter of the bind call."]
#[doc = "bufpp (OUT) - a pointer to a buffer to write the bind value/piece."]
#[doc = "buflp (OUT) - returns the buffer size."]
#[doc = "alenpp (OUT) - a pointer to a storage for OCI to fill in the size of the bind"]
#[doc = "value/piece after it has been read."]
#[doc = "piecep (IN/OUT) - which piece of the bind value. It will be set by the"]
#[doc = "library to be one of the following values - OCI_ONE_PIECE or"]
#[doc = "OCI_NEXT_PIECE. The callback function can leave it unchanged or set"]
#[doc = "it to OCI_FIRST_PIECE or OCI_LAST_PIECE. By default -"]
#[doc = "OCI_ONE_PIECE."]
#[doc = "indpp (OUT) - returns a pointer to contain the indicator value which"]
#[doc = "either an sb2 value or a pointer to an indicator structure for named data"]
#[doc = "types."]
#[doc = "indszpp (OUT) - returns a pointer to return the size of the indicator"]
#[doc = "value which is either size of an sb2 or size of an indicator structure."]
#[doc = "rcodepp (OUT) - returns a pointer to contains the return code."]
#[doc = "Related Functions"]
#[doc = "OCIAttrGet()"]
#[doc = ""]
#[doc = ""]
#[doc = "---------------------------------OCIBindObject--------------------------------"]
#[doc = ""]
#[doc = ""]
#[doc = "OCIBindObject()"]
#[doc = "Name"]
#[doc = "OCI Bind Object"]
#[doc = "Purpose"]
#[doc = "This function sets up additional attributes which are required for a named"]
#[doc = "data type (object)  bind."]
#[doc = "Syntax"]
#[doc = "sword OCIBindObject ( OCIBind          *bindp,"]
#[doc = "OCIError         *errhp,"]
#[doc = "const OCIType    *type,"]
#[doc = "void            **pgvpp,"]
#[doc = "ub4              *pvszsp,"]
#[doc = "void            **indpp,"]
#[doc = "ub4              *indszp, );"]
#[doc = "Comments"]
#[doc = "This function sets up additional attributes which binding a named data type"]
#[doc = "or a REF. An error will be returned if this function is called when the OCI"]
#[doc = "environment has been initialized in non-object mode."]
#[doc = "This call takes as a paramter a type descriptor object (TDO) of datatype"]
#[doc = "OCIType for the named data type being defined.  The TDO can be retrieved"]
#[doc = "with a call to OCITypeByName()."]
#[doc = "If the OCI_DATA_AT_EXEC mode was specified in ocibindn() or ocibindp(), the"]
#[doc = "pointers to the IN buffers are obtained either using the callback icbfp"]
#[doc = "registered in the OCIBindDynamic() call or by the OCIStmtSetPieceInfo() call."]
#[doc = "The buffers are dynamically allocated for the OUT data and the pointers to"]
#[doc = "these buffers are returned either by calling ocbfp() registered by the"]
#[doc = "OCIBindDynamic() or by setting the pointer to the buffer in the buffer passed"]
#[doc = "in by OCIStmtSetPieceInfo() called when OCIStmtExecute() returned"]
#[doc = "OCI_NEED_DATA. The memory of these client library- allocated buffers must be"]
#[doc = "freed when not in use anymore by using the OCIObjectFreee() call."]
#[doc = "Parameters"]
#[doc = "bindp ( IN/OUT) - the bind handle returned by the call to OCIBindByName()"]
#[doc = "or OCIBindByPos()."]
#[doc = "errhp ( IN/OUT) - an error handle which can be passed to OCIErrorGet() for"]
#[doc = "diagnostic information in the event of an error."]
#[doc = "type ( IN) - points to the TDO which describes the type of the program"]
#[doc = "variable being bound. Retrieved by calling OCITypeByName()."]
#[doc = "pgvpp ( IN/OUT) - points to a pointer to the program variable buffer. For an"]
#[doc = "array, pgvpp points to an array of pointers. When the bind variable is also an"]
#[doc = "OUT variable, the OUT Named Data Type value or REF is allocated"]
#[doc = "(unpickled) in the Object Cache, and a pointer to the value or REF is returned,"]
#[doc = "At the end of execute, when all OUT values have been received, pgvpp points"]
#[doc = "to an array of pointer(s) to these newly allocated named data types in the"]
#[doc = "object cache."]
#[doc = "pgvpp is ignored if the OCI_DATA_AT_EXEC mode is set. Then the Named"]
#[doc = "Data Type buffers are requested at runtime. For static array binds, skip"]
#[doc = "factors may be specified using the OCIBindArrayOfStruct() call. The skip"]
#[doc = "factors are used to compute the address of the next pointer to the value, the"]
#[doc = "indicator structure and their sizes."]
#[doc = "pvszsp ( IN/OUT) - points to the size of the program variable. The size of the"]
#[doc = "named data type is not required on input. For an array, pvszsp is an array of"]
#[doc = "ub4s. On return, for OUT bind variables, this points to size(s) of the Named"]
#[doc = "Data Types and REFs received. pvszsp is ignored if the OCI_DATA_AT_EXEC"]
#[doc = "mode is set. Then the size of the buffer is taken at runtime."]
#[doc = "indpp ( IN/OUT) - points to a pointer to the program variable buffer"]
#[doc = "containing the parallel indicator structure. For an array, points to an array"]
#[doc = "of pointers. When the bind variable is also an OUT bind variable, memory is"]
#[doc = "allocated in the object cache, to store the unpickled OUT indicator values. At"]
#[doc = "the end of the execute when all OUT values have been received, indpp points"]
#[doc = "to the pointer(s) to these newly allocated indicator structure(s)."]
#[doc = "indpp is ignored if the OCI_DATA_AT_EXEC mode is set. Then the indicator"]
#[doc = "is requested at runtime."]
#[doc = "indszp ( IN/OUT) - points to the size of the IN indicator structure program"]
#[doc = "variable. For an array, it is an array of sb2s. On return for OUT bind"]
#[doc = "variables, this points to size(s) of the received OUT indicator structures."]
#[doc = "indszp is ignored if the OCI_DATA_AT_EXEC mode is set. Then the indicator"]
#[doc = "size is requested at runtime."]
#[doc = "Related Functions"]
#[doc = "OCIAttrGet()"]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = "----------------------------------OCIBreak------------------------------------"]
#[doc = ""]
#[doc = ""]
#[doc = "OCIBreak()"]
#[doc = "Name"]
#[doc = "OCI Break"]
#[doc = "Purpose"]
#[doc = "This call performs an immediate (asynchronous) abort of any currently"]
#[doc = "executing OCI function that is associated with a server ."]
#[doc = "Syntax"]
#[doc = "sword OCIBreak ( void      *hndlp,"]
#[doc = "OCIError   *errhp);"]
#[doc = "Comments"]
#[doc = "This call performs an immediate (asynchronous) abort of any currently"]
#[doc = "executing OCI function that is associated with a server. It is normally used"]
#[doc = "to stop a long-running OCI call being processed on the server."]
#[doc = "This call can take either the service context handle or the server context"]
#[doc = "handle as a parameter to identify the function to be aborted."]
#[doc = "Parameters"]
#[doc = "hndlp (IN) - the service context handle or the server context handle."]
#[doc = "errhp (IN) - an error handle which can be passed to OCIErrorGet() for"]
#[doc = "diagnostic information in the event of an error."]
#[doc = "Related Functions"]
#[doc = ""]
#[doc = "-----------------------------OCIConnectionPoolCreate --------------------------"]
#[doc = "Name:"]
#[doc = "OCIConnectionPoolCreate"]
#[doc = ""]
#[doc = "Purpose:"]
#[doc = "Creates the connections in the pool"]
#[doc = ""]
#[doc = "Syntax:"]
#[doc = "OCIConnectionPoolCreate (OCIEnv *envhp, OCIError *errhp, OCICPool *poolhp,"]
#[doc = "OraText **poolName, sb4 *poolNameLen,"]
#[doc = "const Oratext *dblink, sb4 dblinkLen,"]
#[doc = "ub4 connMin, ub4 connMax, ub4 connIncr,"]
#[doc = "const OraText *poolUsername, sb4 poolUserLen,"]
#[doc = "const OraText *poolPassword, sb4 poolPassLen,"]
#[doc = "ub4 mode)"]
#[doc = "Comments:"]
#[doc = "This call is used to create a connection pool. conn_min connections"]
#[doc = "to the database are started on calling OCIConnectionPoolCreate."]
#[doc = ""]
#[doc = "Parameters:"]
#[doc = "envhp (IN/OUT)  - A pointer to the environment where the Conencton Pool"]
#[doc = "is to be created"]
#[doc = "errhp (IN/OUT)  - An error handle which can be passed to OCIErrorGet()."]
#[doc = "poolhp (IN/OUT) - An uninitialiazed pool handle."]
#[doc = "poolName (OUT) - The connection pool name."]
#[doc = "poolNameLen (OUT) - The length of the connection pool name"]
#[doc = "dblink (IN/OUT) - Specifies the database(server) to connect. This will also"]
#[doc = "be used as the default pool name."]
#[doc = "dblinkLen (IN)  - The length of the string pointed to by dblink."]
#[doc = "connMin (IN)    - Specifies the minimum number of connections in the"]
#[doc = "Connection Pool at any instant."]
#[doc = "connMin number of connections are started when"]
#[doc = "OCIConnectionPoolCreate() is called."]
#[doc = "connMax (IN)    - Specifies the maximum number of connections that can be"]
#[doc = "opened to the database. Once this value is reached, no"]
#[doc = "more connections are opened."]
#[doc = "connIncr (IN)   - Allows application to set the next increment for"]
#[doc = "connections to be opened to the database if the current"]
#[doc = "number of connections are less than conn_max."]
#[doc = "poolUsername (IN/OUT) - Connection pooling requires an implicit proxy"]
#[doc = "session and this attribute provides a username"]
#[doc = "for that session."]
#[doc = "poolUserLen (IN) - This represents the length of pool_username."]
#[doc = "poolPassword (IN/OUT) - The password for the parameter pool_username passed"]
#[doc = "above."]
#[doc = "poolPassLen (IN) - This represents the length of pool_password."]
#[doc = ""]
#[doc = "mode (IN) - The modes supported are OCI_DEFAULT and"]
#[doc = "OCI_CPOOL_REINITIALIZE"]
#[doc = ""]
#[doc = "Related Functions"]
#[doc = "OCIConnectionPoolDestroy()"]
#[doc = ""]
#[doc = "---------------------------------------------------------------------------"]
#[doc = ""]
#[doc = "----------------------------OCIConnectionPoolDestroy-------------------------"]
#[doc = "Name:"]
#[doc = "OCIConnectionPoolDestroy"]
#[doc = ""]
#[doc = "Purpose:"]
#[doc = "Terminates the connections in the pool"]
#[doc = ""]
#[doc = "Syntax:"]
#[doc = "OCIConnectionPoolDestroy (OCICPool *poolhp, OCIError *errhp, ub4 mode)"]
#[doc = ""]
#[doc = "Comments:"]
#[doc = "On calling OCIConnectionPoolDestroy, all the open connections in the pool"]
#[doc = "are closed and the pool is destroyed."]
#[doc = ""]
#[doc = "Parameters:"]
#[doc = "poolhp (IN/OUT) - An initialiazed pool handle."]
#[doc = "errhp (IN/OUT)  - An error handle which can be passed to OCIErrorGet()."]
#[doc = "mode (IN)       - Currently, OCIConnectionPoolDestroy() will support only"]
#[doc = "the OCI_DEFAULT mode."]
#[doc = ""]
#[doc = "Related Functions:"]
#[doc = "OCIConnectionPoolCreate()"]
#[doc = ""]
#[doc = "-----------------------------------------------------------------------------"]
#[doc = "----------------------------OCISessionPoolCreate-----------------------------"]
#[doc = "Name:"]
#[doc = "OCISessionPoolCreate"]
#[doc = ""]
#[doc = "Purpose:"]
#[doc = "Creates the sessions in the session pool."]
#[doc = ""]
#[doc = "Syntax:"]
#[doc = "sword OCISessionPoolCreate (OCIEnv *envhp, OCIError *errhp, OCISpool *spoolhp,"]
#[doc = "OraText **poolName, ub4 *poolNameLen,"]
#[doc = "const OraText *connStr, ub4 connStrLen,"]
#[doc = "ub4 sessMin, ub4 sessMax, ub4 sessIncr,"]
#[doc = "OraText *userid,  ub4 useridLen,"]
#[doc = "OraText *password, ub4 passwordLen,"]
#[doc = "ub4 mode)"]
#[doc = ""]
#[doc = "Comments:"]
#[doc = "When OCISessionPoolCreate is called, a session pool is initialized for"]
#[doc = "the associated environment and the database specified by the"]
#[doc = "connStr parameter. This pool is named uniquely and the name"]
#[doc = "is returned to the user in the poolname parameter."]
#[doc = ""]
#[doc = "Parameters:"]
#[doc = "envhp (IN/OUT) - A pointer to the environment handle in which the session"]
#[doc = "pool needs to be created."]
#[doc = "errhp (IN/OUT) - An error handle which can be passed to OCIErrorGet()."]
#[doc = "spoolhp (IN/OUT) - A pointer to the session pool handle that is created."]
#[doc = "poolName (OUT) - Session pool name returned to the user."]
#[doc = "poolNameLen (OUT) - Length of the PoolName"]
#[doc = "connStr (IN) - The TNS alias of the database to connect to."]
#[doc = "connStrLen (IN) - Length of the connStr."]
#[doc = "sessMin (IN) - Specifies the minimum number of sessions in the Session Pool."]
#[doc = "These are the number of sessions opened in the beginning, if"]
#[doc = "in Homogeneous mode. Else, the parameter is ignored."]
#[doc = "sessMax (IN) - Specifies the maximum number of sessions in the Session Pool."]
#[doc = "Once this value is reached, no more sessions are opened,"]
#[doc = "unless the OCI_ATTR_SPOOL_FORCEGET is set."]
#[doc = "userid (IN) - Specifies the userid with which to start up the sessions."]
#[doc = "useridLen (IN) - Length of userid."]
#[doc = "password (IN) - Specifies the password for the corresponding userid."]
#[doc = "passwordLen (IN) - Specifies the length of the password"]
#[doc = "mode(IN) - May be OCI_DEFAULT, OCI_SPC_SPOOL_REINITIALIZE, or"]
#[doc = "OCI_SPC_SPOOL_HOMOGENEOUS."]
#[doc = ""]
#[doc = "Returns:"]
#[doc = "SUCCESS - If pool could be allocated and created successfully."]
#[doc = "ERROR - If above conditions could not be met."]
#[doc = ""]
#[doc = "Related Functions:"]
#[doc = "OCISessionPoolDestroy()"]
#[doc = "-----------------------------------------------------------------------------"]
#[doc = "-----------------------------OCISessionPoolDestroy---------------------------"]
#[doc = "Name:"]
#[doc = "OCISessionPoolDestroy"]
#[doc = ""]
#[doc = "Purpose:"]
#[doc = "Terminates all the sessions in the session pool."]
#[doc = ""]
#[doc = "Syntax:"]
#[doc = "sword OCISessionPoolDestroy (OCISPool *spoolhp, OCIError *errhp, ub4 mode)"]
#[doc = ""]
#[doc = "Comments:"]
#[doc = "spoolhp (IN/OUT) - The pool handle of the session pool to be destroyed."]
#[doc = "errhp (IN/OUT) - An error handle which can be passed to OCIErrorGet()."]
#[doc = "mode (IN) - Currently only OCI_DEFAULT mode is supported."]
#[doc = ""]
#[doc = "Returns:"]
#[doc = "SUCCESS - All the sessions could be closed."]
#[doc = "ERROR - If the above condition is not met."]
#[doc = ""]
#[doc = "Related Functions:"]
#[doc = "OCISessionPoolCreate()"]
#[doc = "-----------------------------------------------------------------------------"]
#[doc = "-------------------------------OCISessionGet---------------------------------"]
#[doc = "Name:"]
#[doc = "OCISessionGet"]
#[doc = ""]
#[doc = "Purpose:"]
#[doc = "Get a session. This could be from a session pool, connection pool or"]
#[doc = "a new standalone session."]
#[doc = ""]
#[doc = "Syntax:"]
#[doc = "sword OCISessionGet(OCIenv *envhp, OCIError *errhp, OCISvcCtx **svchp,"]
#[doc = "OCIAuthInfo *authhp,"]
#[doc = "OraText *poolName, ub4 poolName_len,"]
#[doc = "const OraText *tagInfo, ub4 tagInfo_len,"]
#[doc = "OraText **retTagInfo, ub4 *retTagInfo_len,"]
#[doc = "boolean *found,"]
#[doc = "ub4 mode)"]
#[doc = ""]
#[doc = "Comments:"]
#[doc = "envhp (IN/OUT) - OCI environment handle."]
#[doc = "errhp (IN/OUT) - OCI error handle to be passed to OCIErrorGet()."]
#[doc = "svchp (IN/OUT) - Address of an OCI service context pointer. This will be"]
#[doc = "filled with a server and session handle, attached to the"]
#[doc = "pool."]
#[doc = "authhp (IN/OUT) - OCI Authentication Information handle."]
#[doc = "poolName (IN) - This indicates the session/connection pool to get the"]
#[doc = "session/connection from in the OCI_SPOOL/OCI_CPOOL mode."]
#[doc = "In the OCI_DEFAULT mode it refers to the connect string."]
#[doc = "poolName_len (IN) - length of poolName."]
#[doc = "tagInfo (IN) - indicates the tag of the session that the user wants. If the"]
#[doc = "user wants a default session, he must specify a NULL here."]
#[doc = "Only used for Session Pooling."]
#[doc = "tagInfo_len (IN) - the length of tagInfo."]
#[doc = "retTagInfo (OUT) - This indicates the type of session that is returned to"]
#[doc = "the user. Only used for Session Pooling."]
#[doc = "retTagInfo_len (OUT) - the length of retTagInfo."]
#[doc = "found (OUT) - set to true if the user gets a session he had requested, else"]
#[doc = "set to false. Only used for Session Pooling."]
#[doc = "mode (IN) - The supported modes are OCI_DEFAULT, OCI_CRED_PROXY and"]
#[doc = "OCI_GET_SPOOL_MATCHANY, OCI_SPOOL and OCI_CPOOL. OCI_SPOOL and"]
#[doc = "OCI_CPOOL are mutually exclusive."]
#[doc = ""]
#[doc = "Returns:"]
#[doc = "SUCCESS -  if a session was successfully returned into svchp."]
#[doc = "SUCCESS_WITH_INFO - if a session was successfully returned into svchp and the"]
#[doc = "total number of sessions > maxsessions. Only valid for"]
#[doc = "Session Pooling."]
#[doc = "ERROR - If a session could not be retrieved."]
#[doc = ""]
#[doc = "Related Functions:"]
#[doc = "OCISessionRelease()"]
#[doc = "-----------------------------------------------------------------------------"]
#[doc = "---------------------------OCISessionRelease---------------------------------"]
#[doc = "Name:"]
#[doc = "OCISessionRelease"]
#[doc = ""]
#[doc = "Purpose:"]
#[doc = "Release the session."]
#[doc = ""]
#[doc = "Syntax:"]
#[doc = "sword OCISessionRelease ( OCISvcCtx *svchp, OCIError *errhp,"]
#[doc = "OraText *tag, ub4 tag_len,"]
#[doc = "ub4 mode);"]
#[doc = ""]
#[doc = "Comments:"]
#[doc = "svchp (IN/OUT) - The service context associated with the session/connection."]
#[doc = "errhp (IN/OUT) - OCI error handle to be passed to OCIErrorGet()."]
#[doc = "tag (IN) - Only used for Session Pooling."]
#[doc = "This parameter will be ignored unless mode OCI_RLS_SPOOL_RETAG is"]
#[doc = "specified. In this case, the session is labelled with this tag and"]
#[doc = "returned to the pool. If this is NULL, then the session is untagged."]
#[doc = "tag_len (IN) - Length of the tag. This is ignored unless mode"]
#[doc = "OCI_RLS_SPOOL_RETAG is set."]
#[doc = "mode (IN) - The supported modes are OCI_DEFAULT, OCI_RLS_SPOOL_DROPSESS,"]
#[doc = "OCI_RLS_SPOOL_RETAG. The last 2 are only valid for Session Pooling."]
#[doc = "When OCI_RLS_SPOOL_DROPSESS is specified, the session"]
#[doc = "will be removed from the session pool. If OCI_RLS_SPOOL_RETAG"]
#[doc = "is set, the tag on the session will be altered. If this mode is"]
#[doc = "not set, the tag and tag_len parameters will be ignored."]
#[doc = ""]
#[doc = "Returns:"]
#[doc = "ERROR - If the session could not be released successfully."]
#[doc = "SUCCESS - In all other cases."]
#[doc = ""]
#[doc = "Related Functions:"]
#[doc = "OCISessionGet()."]
#[doc = "-----------------------------------------------------------------------------"]
#[doc = "------------------------------OCIDateTimeAssign --------------------------"]
#[doc = "sword OCIDateTimeAssign(void *hndl, OCIError *err, const OCIDateTime *from,"]
#[doc = "OCIDateTime *to);"]
#[doc = "NAME: OCIDateTimeAssign - OCIDateTime Assignment"]
#[doc = "PARAMETERS:"]
#[doc = "hndl (IN) - Session/Env handle."]
#[doc = "err (IN/OUT) - error handle. If there is an error, it is"]
#[doc = "recorded in 'err' and this function returns OCI_ERROR."]
#[doc = "The error recorded in 'err' can be retrieved by calling"]
#[doc = "OCIErrorGet()."]
#[doc = "from (IN) - datetime to be assigned"]
#[doc = "to (OUT) - lhs of assignment"]
#[doc = "DESCRIPTION:"]
#[doc = "Performs date assignment. The type of the output will be same as that"]
#[doc = "of input"]
#[doc = ""]
#[doc = "------------------------------OCIDateTimeCheck----------------------------"]
#[doc = "sword OCIDateTimeCheck(void *hndl, OCIError *err, const OCIDateTime *date,"]
#[doc = "ub4 *valid );"]
#[doc = "NAME: OCIDateTimeCheck - OCIDateTime CHecK if the given date is valid"]
#[doc = "PARAMETERS:"]
#[doc = "hndl (IN) - Session/Env handle."]
#[doc = "err (IN/OUT) - error handle. If there is an error, it is"]
#[doc = "recorded in 'err' and this function returns OCI_ERROR."]
#[doc = "The error recorded in 'err' can be retrieved by calling"]
#[doc = "OCIErrorGet()."]
#[doc = "date (IN) - date to be checked"]
#[doc = "valid (OUT) -  returns zero for a valid date, otherwise"]
#[doc = "the ORed combination of all error bits specified below:"]
#[doc = "Macro name                   Bit number      Error"]
#[doc = "----------                   ----------      -----"]
#[doc = "OCI_DATE_INVALID_DAY         0x1             Bad day"]
#[doc = "OCI_DATE_DAY_BELOW_VALID     0x2             Bad DAy Low/high bit (1=low)"]
#[doc = "OCI_DATE_INVALID_MONTH       0x4             Bad MOnth"]
#[doc = "OCI_DATE_MONTH_BELOW_VALID   0x8             Bad MOnth Low/high bit (1=low)"]
#[doc = "OCI_DATE_INVALID_YEAR        0x10            Bad YeaR"]
#[doc = "OCI_DATE_YEAR_BELOW_VALID    0x20            Bad YeaR Low/high bit (1=low)"]
#[doc = "OCI_DATE_INVALID_HOUR        0x40            Bad HouR"]
#[doc = "OCI_DATE_HOUR_BELOW_VALID    0x80            Bad HouR Low/high bit (1=low)"]
#[doc = "OCI_DATE_INVALID_MINUTE      0x100           Bad MiNute"]
#[doc = "OCI_DATE_MINUTE_BELOW_VALID  0x200           Bad MiNute Low/high bit (1=low)"]
#[doc = "OCI_DATE_INVALID_SECOND      0x400           Bad SeCond"]
#[doc = "OCI_DATE_SECOND_BELOW_VALID  0x800           bad second Low/high bit (1=low)"]
#[doc = "OCI_DATE_DAY_MISSING_FROM_1582 0x1000        Day is one of those \"missing\""]
#[doc = "from 1582"]
#[doc = "OCI_DATE_YEAR_ZERO           0x2000          Year may not equal zero"]
#[doc = "OCI_DATE_INVALID_TIMEZONE    0x4000          Bad Timezone"]
#[doc = "OCI_DATE_INVALID_FORMAT      0x8000          Bad date format input"]
#[doc = ""]
#[doc = "So, for example, if the date passed in was 2/0/1990 25:61:10 in"]
#[doc = "(month/day/year hours:minutes:seconds format), the error returned"]
#[doc = "would be OCI_DATE_INVALID_DAY | OCI_DATE_DAY_BELOW_VALID |"]
#[doc = "OCI_DATE_INVALID_HOUR | OCI_DATE_INVALID_MINUTE"]
#[doc = ""]
#[doc = "DESCRIPTION:"]
#[doc = "Check if the given date is valid."]
#[doc = "RETURNS:"]
#[doc = "OCI_SUCCESS if the function completes successfully."]
#[doc = "OCI_INVALID_HANDLE if 'err' is NULL."]
#[doc = "OCI_ERROR if"]
#[doc = "'date' and 'valid' pointers are NULL pointers"]
#[doc = ""]
#[doc = "------------------------------- OCIDateTimeCompare----------------------------"]
#[doc = "sword OCIDateTimeCompare(void *hndl, OCIError *err, const OCIDateTime *date1,"]
#[doc = "const OCIDateTime *date2,  sword *result );"]
#[doc = "NAME: OCIDateTimeCompare - OCIDateTime CoMPare dates"]
#[doc = "PARAMETERS:"]
#[doc = "hndl (IN) - Session/Env handle."]
#[doc = "err (IN/OUT) - error handle. If there is an error, it is"]
#[doc = "recorded in 'err' and this function returns OCI_ERROR."]
#[doc = "The error recorded in 'err' can be retrieved by calling"]
#[doc = "OCIErrorGet()."]
#[doc = "date1, date2 (IN) - dates to be compared"]
#[doc = "result (OUT) - comparison result, 0 if equal, -1 if date1 < date2,"]
#[doc = "1 if date1 > date2"]
#[doc = "DESCRIPTION:"]
#[doc = "The function OCIDateCompare compares two dates. It returns -1 if"]
#[doc = "date1 is smaller than date2, 0 if they are equal, and 1 if date1 is"]
#[doc = "greater than date2."]
#[doc = "RETURNS:"]
#[doc = "OCI_SUCCESS if the function completes successfully."]
#[doc = "OCI_INVALID_HANDLE if 'err' is NULL."]
#[doc = "OCI_ERROR if"]
#[doc = "invalid date"]
#[doc = "input dates are not mutually comparable"]
#[doc = ""]
#[doc = "------------------------------OCIDateTimeConvert----------------------"]
#[doc = "sword OCIDateTimeConvert(void *hndl, OCIError *err, OCIDateTime *indate,"]
#[doc = "OCIDateTime *outdate);"]
#[doc = "NAME: OCIDateTimeConvert - Conversion between different DATETIME types"]
#[doc = "PARAMETERS:"]
#[doc = "hndl (IN) - Session/Env handle."]
#[doc = "err (IN/OUT) - error handle. If there is an error, it is"]
#[doc = "recorded in 'err' and this function returns OCI_ERROR."]
#[doc = "The error recorded in 'err' can be retrieved by calling"]
#[doc = "OCIErrorGet()."]
#[doc = "indate (IN) - pointer to input date"]
#[doc = "outdate (OUT) - pointer to output datetime"]
#[doc = "DESCRIPTION: Converts one datetime type to another. The result type is"]
#[doc = "the type of the 'outdate' descriptor."]
#[doc = "RETURNS:"]
#[doc = "OCI_SUCCESS if the function completes successfully."]
#[doc = "OCI_INVALID_HANDLE if 'err' is NULL."]
#[doc = "OCI_ERROR if"]
#[doc = "conversion not possible."]
#[doc = ""]
#[doc = "---------------------------- OCIDateTimeFromText-----------------------"]
#[doc = "sword OCIDateTimeFromText(void *hndl, OCIError *err, const OraText *date_str,"]
#[doc = "size_t d_str_length, const OraText *fmt, ub1 fmt_length,"]
#[doc = "const OraText *lang_name, size_t lang_length, OCIDateTime *date );"]
#[doc = "NAME: OCIDateTimeFromText - OCIDateTime convert String FROM Date"]
#[doc = "PARAMETERS:"]
#[doc = "hndl (IN) - Session/Env handle. If Session Handle is passed, the"]
#[doc = "conversion takes place in session NLS_LANGUAGE and"]
#[doc = "session NLS_CALENDAR, otherwise the default is used."]
#[doc = "err (IN/OUT) - error handle. If there is an error, it is"]
#[doc = "recorded in 'err' and this function returns OCI_ERROR."]
#[doc = "The error recorded in 'err' can be retrieved by calling"]
#[doc = "OCIErrorGet()."]
#[doc = "date_str (IN) - input string to be converted to Oracle date"]
#[doc = "d_str_length (IN) - size of the input string, if the length is -1"]
#[doc = "then 'date_str' is treated as a null terminated  string"]
#[doc = "fmt (IN) - conversion format; if 'fmt' is a null pointer, then"]
#[doc = "the string is expected to be in the default format for"]
#[doc = "the datetime type."]
#[doc = "fmt_length (IN) - length of the 'fmt' parameter"]
#[doc = "lang_name (IN) - language in which the names and abbreviations of"]
#[doc = "days and months are specified, if null i.e. (OraText *)0,"]
#[doc = "the default language of session is used,"]
#[doc = "lang_length (IN) - length of the 'lang_name' parameter"]
#[doc = "date (OUT) - given string converted to date"]
#[doc = "DESCRIPTION:"]
#[doc = "Converts the given string to Oracle datetime type set in the"]
#[doc = "OCIDateTime descriptor according to the specified format. Refer to"]
#[doc = "\"TO_DATE\" conversion function described in \"Oracle SQL Language"]
#[doc = "Reference Manual\" for a description of format."]
#[doc = "RETURNS:"]
#[doc = "OCI_SUCCESS if the function completes successfully."]
#[doc = "OCI_INVALID_HANDLE if 'err' is NULL."]
#[doc = "OCI_ERROR if"]
#[doc = "invalid format"]
#[doc = "unknown language"]
#[doc = "invalid input string"]
#[doc = ""]
#[doc = "--------------------------- OCIDateTimeGetDate-------------------------"]
#[doc = "sword OCIDateTimeGetDate(void *hndl, OCIError *err,  const OCIDateTime *date,"]
#[doc = "sb2 *year, ub1 *month, ub1 *day );"]
#[doc = "NAME: OCIDateTimeGetDate - OCIDateTime Get Date (year, month, day)"]
#[doc = "portion of DATETIME."]
#[doc = "PARAMETERS:"]
#[doc = "hndl (IN) - Session/Env handle."]
#[doc = "err (IN/OUT) - error handle. If there is an error, it is"]
#[doc = "recorded in 'err' and this function returns OCI_ERROR."]
#[doc = "The error recorded in 'err' can be retrieved by calling"]
#[doc = "OCIErrorGet()."]
#[doc = "datetime (IN) - Pointer to OCIDateTime"]
#[doc = "year      (OUT) - year value"]
#[doc = "month     (OUT) - month value"]
#[doc = "day       (OUT) - day value"]
#[doc = ""]
#[doc = "--------------------------- OCIDateTimeGetTime ------------------------"]
#[doc = "sword OCIDateTimeGetTime(void *hndl, OCIError *err, OCIDateTime *datetime,"]
#[doc = "ub1 *hour, ub1 *minute, ub1 *sec, ub4 *fsec);"]
#[doc = "NAME: OCIDateTimeGetTime - OCIDateTime Get Time (hour, min, second,"]
#[doc = "fractional second)  of DATETIME."]
#[doc = "PARAMETERS:"]
#[doc = "hndl (IN) - Session/Env handle."]
#[doc = "err (IN/OUT) - error handle. If there is an error, it is"]
#[doc = "recorded in 'err' and this function returns OCI_ERROR."]
#[doc = "The error recorded in 'err' can be retrieved by calling"]
#[doc = "OCIErrorGet()."]
#[doc = "datetime (IN) - Pointer to OCIDateTime"]
#[doc = "hour      (OUT) - hour value"]
#[doc = "minute       (OUT) - minute value"]
#[doc = "sec       (OUT) - second value"]
#[doc = "fsec      (OUT) - Fractional Second value"]
#[doc = ""]
#[doc = "--------------------------- OCIDateTimeGetTimeZoneOffset ----------------------"]
#[doc = "sword OCIDateTimeGetTimeZoneOffset(void *hndl,OCIError *err,const"]
#[doc = "OCIDateTime *datetime,sb1 *hour,sb1  *minute);"]
#[doc = ""]
#[doc = "NAME: OCIDateTimeGetTimeZoneOffset - OCIDateTime Get TimeZone (hour, minute)"]
#[doc = "portion of DATETIME."]
#[doc = "PARAMETERS:"]
#[doc = "hndl (IN) - Session/Env handle."]
#[doc = "err (IN/OUT) - error handle. If there is an error, it is"]
#[doc = "recorded in 'err' and this function returns OCI_ERROR."]
#[doc = "The error recorded in 'err' can be retrieved by calling"]
#[doc = "OCIErrorGet()."]
#[doc = "datetime (IN) - Pointer to OCIDateTime"]
#[doc = "hour      (OUT) - TimeZone Hour value"]
#[doc = "minute     (OUT) - TimeZone Minute value"]
#[doc = ""]
#[doc = "--------------------------- OCIDateTimeSysTimeStamp---------------------"]
#[doc = "sword OCIDateTimeSysTimeStamp(void *hndl, OCIError *err,"]
#[doc = "OCIDateTime *sys_date );"]
#[doc = ""]
#[doc = "NAME: OCIDateTimeSysTimeStamp - Returns system date/time as a TimeStamp with"]
#[doc = "timezone"]
#[doc = "PARAMETERS:"]
#[doc = "hndl (IN) - Session/Env handle."]
#[doc = "err (IN/OUT) - error handle. If there is an error, it is"]
#[doc = "recorded in 'err' and this function returns OCI_ERROR."]
#[doc = "The error recorded in 'err' can be retrieved by calling"]
#[doc = "OCIErrorGet()."]
#[doc = "sys_date (OUT) - Pointer to output timestamp"]
#[doc = ""]
#[doc = "DESCRIPTION:"]
#[doc = "Gets the system current date and time as a timestamp with timezone"]
#[doc = "RETURNS:"]
#[doc = "OCI_SUCCESS if the function completes successfully."]
#[doc = "OCI_INVALID_HANDLE if 'err' is NULL."]
#[doc = ""]
#[doc = ""]
#[doc = "------------------------------OCIDateTimeIntervalAdd----------------------"]
#[doc = "sword OCIDateTimeIntervalAdd(void *hndl, OCIError *err, OCIDateTime *datetime,"]
#[doc = "OCIInterval *inter, OCIDateTime *outdatetime);"]
#[doc = "NAME: OCIDateTimeIntervalAdd - Adds an interval to datetime"]
#[doc = "PARAMETERS:"]
#[doc = "hndl (IN) - Session/Env handle."]
#[doc = "err (IN/OUT) - error handle. If there is an error, it is"]
#[doc = "recorded in 'err' and this function returns OCI_ERROR."]
#[doc = "The error recorded in 'err' can be retrieved by calling"]
#[doc = "OCIErrorGet()."]
#[doc = "datetime (IN) - pointer to input datetime"]
#[doc = "inter    (IN) - pointer to interval"]
#[doc = "outdatetime (IN) - pointer to output datetime. The output datetime"]
#[doc = "will be of same type as input datetime"]
#[doc = "DESCRIPTION:"]
#[doc = "Adds an interval to a datetime to produce a resulting datetime"]
#[doc = "RETURNS:"]
#[doc = "OCI_SUCCESS if the function completes successfully."]
#[doc = "OCI_INVALID_HANDLE if 'err' is NULL."]
#[doc = "OCI_ERROR if:"]
#[doc = "resulting date is before Jan 1, -4713"]
#[doc = "resulting date is after Dec 31, 9999"]
#[doc = ""]
#[doc = "------------------------------OCIDateTimeIntervalSub----------------------"]
#[doc = "sword OCIDateTimeIntervalSub(void *hndl, OCIError *err, OCIDateTime *datetime,"]
#[doc = "OCIInterval *inter, OCIDateTime *outdatetime);"]
#[doc = "NAME: OCIDateTimeIntervalSub - Subtracts an interval from a datetime"]
#[doc = "PARAMETERS:"]
#[doc = "hndl (IN) - Session/Env handle."]
#[doc = "err (IN/OUT) - error handle. If there is an error, it is"]
#[doc = "recorded in 'err' and this function returns OCI_ERROR."]
#[doc = "The error recorded in 'err' can be retrieved by calling"]
#[doc = "OCIErrorGet()."]
#[doc = "datetime (IN) - pointer to input datetime"]
#[doc = "inter    (IN) - pointer to interval"]
#[doc = "outdatetime (IN) - pointer to output datetime. The output datetime"]
#[doc = "will be of same type as input datetime"]
#[doc = "DESCRIPTION:"]
#[doc = "Subtracts an interval from a datetime and stores the result in a"]
#[doc = "datetime"]
#[doc = "RETURNS:"]
#[doc = "OCI_SUCCESS if the function completes successfully."]
#[doc = "OCI_INVALID_HANDLE if 'err' is NULL."]
#[doc = "OCI_ERROR if:"]
#[doc = "resulting date is before Jan 1, -4713"]
#[doc = "resulting date is after Dec 31, 9999"]
#[doc = ""]
#[doc = "--------------------------- OCIDateTimeConstruct-------------------------"]
#[doc = "sword OCIDateTimeConstruct(void  *hndl,OCIError *err,OCIDateTime *datetime,"]
#[doc = "sb2 year,ub1 month,ub1 day,ub1 hour,ub1 min,ub1 sec,ub4 fsec,"]
#[doc = "OraText  *timezone,size_t timezone_length);"]
#[doc = ""]
#[doc = "NAME: OCIDateTimeConstruct - Construct an OCIDateTime. Only the relevant"]
#[doc = "fields for the OCIDateTime descriptor types are used."]
#[doc = "PARAMETERS:"]
#[doc = "hndl (IN) - Session/Env handle."]
#[doc = "err (IN/OUT) - error handle. If there is an error, it is"]
#[doc = "recorded in 'err' and this function returns OCI_ERROR."]
#[doc = "The error recorded in 'err' can be retrieved by calling"]
#[doc = "OCIErrorGet()."]
#[doc = "datetime (IN) - Pointer to OCIDateTime"]
#[doc = "year      (IN) - year value"]
#[doc = "month     (IN) - month value"]
#[doc = "day       (IN) - day value"]
#[doc = "hour      (IN) - hour value"]
#[doc = "min       (IN) - minute value"]
#[doc = "sec       (IN) - second value"]
#[doc = "fsec      (IN) - Fractional Second value"]
#[doc = "timezone  (IN) - Timezone string"]
#[doc = "timezone_length(IN) - Length of timezone string"]
#[doc = ""]
#[doc = "DESCRIPTION:"]
#[doc = "Constructs a DateTime descriptor. The type of the datetime is the"]
#[doc = "type of the OCIDateTime descriptor. Only the relevant fields based"]
#[doc = "on the type are used. For Types with timezone, the date and time"]
#[doc = "fields are assumed to be in the local time of the specified timezone."]
#[doc = "If timezone is not specified, then session default timezone is"]
#[doc = "assumed."]
#[doc = "RETURNS:"]
#[doc = "OCI_SUCCESS if the function completes successfully."]
#[doc = "OCI_ERROR if datetime is not valid."]
#[doc = ""]
#[doc = "------------------------------OCIDateTimeSubtract-----------------------"]
#[doc = "sword OCIDateTimeSubtract(void *hndl, OCIError *err, OCIDateTime *indate1,"]
#[doc = "OCIDateTime *indate2, OCIInterval *inter);"]
#[doc = "NAME: OCIDateTimeSubtract - subtracts two datetimes to return an interval"]
#[doc = "PARAMETERS:"]
#[doc = "hndl (IN) - Session/Env handle."]
#[doc = "err (IN/OUT) - error handle. If there is an error, it is"]
#[doc = "recorded in 'err' and this function returns OCI_ERROR."]
#[doc = "The error recorded in 'err' can be retrieved by calling"]
#[doc = "OCIErrorGet()."]
#[doc = "indate1(IN) - pointer to subtrahend"]
#[doc = "indate2(IN) - pointer to minuend"]
#[doc = "inter  (OUT) - pointer to output interval"]
#[doc = "DESCRIPTION:"]
#[doc = "Takes two datetimes as input and stores their difference in an"]
#[doc = "interval. The type of the interval is the type of the 'inter'"]
#[doc = "descriptor."]
#[doc = "RETURNS:"]
#[doc = "OCI_SUCCESS if the function completes successfully."]
#[doc = "OCI_INVALID_HANDLE if 'err' is NULL."]
#[doc = "OCI_ERROR if"]
#[doc = "datetimes are not comparable."]
#[doc = ""]
#[doc = "--------------------------- OCIDateTimeToText--------------------------"]
#[doc = "sword OCIDateTimeToText(void *hndl, OCIError *err, const OCIDateTime *date,"]
#[doc = "const OraText *fmt, ub1 fmt_length, ub1 fsprec,"]
#[doc = "const OraText *lang_name, size_t lang_length,"]
#[doc = "ub4 *buf_size, OraText *buf );"]
#[doc = "NAME: OCIDateTimeToText - OCIDateTime convert date TO String"]
#[doc = "PARAMETERS:"]
#[doc = "hndl (IN) - Session/Env handle. If Session Handle is passed, the"]
#[doc = "conversion takes place in session NLS_LANGUAGE and"]
#[doc = "session NLS_CALENDAR, otherwise the default is used."]
#[doc = "err (IN/OUT) - error handle. If there is an error, it is"]
#[doc = "recorded in 'err' and this function returns OCI_ERROR."]
#[doc = "The error recorded in 'err' can be retrieved by calling"]
#[doc = "OCIErrorGet()."]
#[doc = "date (IN) - Oracle datetime to be converted"]
#[doc = "fmt (IN) - conversion format, if null string pointer (OraText*)0, then"]
#[doc = "the date is converted to a character string in the"]
#[doc = "default format for that type."]
#[doc = "fmt_length (IN) - length of the 'fmt' parameter"]
#[doc = "fsprec (IN) - specifies the fractional second precision in which the"]
#[doc = "fractional seconds is returned."]
#[doc = "lang_name (IN) - specifies the language in which the names and"]
#[doc = "abbreviations of months and days are returned;"]
#[doc = "default language of session is used if 'lang_name'"]
#[doc = "is null i.e. (OraText *)0"]
#[doc = "lang_length (IN) - length of the 'nls_params' parameter"]
#[doc = "buf_size (IN/OUT) - size of the buffer; size of the resulting string"]
#[doc = "is returned via this parameter"]
#[doc = "buf (OUT) - buffer into which the converted string is placed"]
#[doc = "DESCRIPTION:"]
#[doc = "Converts the given date to a string according to the specified format."]
#[doc = "Refer to \"TO_DATE\" conversion function described in"]
#[doc = "\"Oracle SQL Language Reference Manual\" for a description of format"]
#[doc = "and NLS arguments. The converted null-terminated date string is"]
#[doc = "stored in the buffer 'buf'."]
#[doc = "RETURNS:"]
#[doc = "OCI_SUCCESS if the function completes successfully."]
#[doc = "OCI_INVALID_HANDLE if 'err' is NULL."]
#[doc = "OCI_ERROR if"]
#[doc = "buffer too small"]
#[doc = "invalid format"]
#[doc = "unknown language"]
#[doc = "overflow error"]
#[doc = ""]
#[doc = "----------------------------OCIDateTimeGetTimeZoneName------------------------"]
#[doc = "sword OCIDateTimeGetTimeZoneName(void *hndl,"]
#[doc = "OCIError *err,"]
#[doc = "const OCIDateTime *datetime,"]
#[doc = "ub1 *buf,"]
#[doc = "ub4 *buflen);"]
#[doc = "NAME OCIDateTimeGetTimeZoneName - OCI DateTime Get the Time Zone Name"]
#[doc = "PARAMETERS:"]
#[doc = "hndl (IN)      - Session/Env handle."]
#[doc = "err (IN/OUT)   - error handle. If there is an error, it is"]
#[doc = "recorded in 'err' and this function returns OCI_ERROR."]
#[doc = "The error recorded in 'err' can be retrieved by calling"]
#[doc = "OCIErrorGet()."]
#[doc = "datetime (IN)   - Pointer to an OCIDateTime."]
#[doc = "buf (OUT)       - User allocated storage for name string."]
#[doc = "buflen (IN/OUT) - length of buf on input, length of name on out"]
#[doc = "DESCRIPTION:"]
#[doc = "Returns either the timezone region name or the absolute hour and minute"]
#[doc = "offset. If the DateTime was created with a region id then the region"]
#[doc = "name will be returned in the buf.  If the region id is zero, then the"]
#[doc = "hour and minute offset is returned as \"[-]HH:MM\"."]
#[doc = "RETURNS:"]
#[doc = "OCI_SUCCESS if the function completes successfully."]
#[doc = "OCI_INVALID_HANDLE if 'err' is NULL."]
#[doc = "OCI_ERROR if"]
#[doc = "buffer too small"]
#[doc = "error retrieving timezone data"]
#[doc = "invalid region"]
#[doc = "invalid LdiDateTime type"]
#[doc = ""]
#[doc = "---------------------------------OCIDateTimeToArray----------------------------"]
#[doc = "sword OCIDateTimeToArray(void *hndl,"]
#[doc = "OCIError *err,"]
#[doc = "const OCIDateTime *datetime,"]
#[doc = "const OCIInterval *reftz,"]
#[doc = "ub1 *outarray,"]
#[doc = "ub4 *len"]
#[doc = "ub1 *fsprec);"]
#[doc = "NAME OCIDateTimeToArray - OCI DateTime convert To Array format"]
#[doc = "PARAMETERS:"]
#[doc = "hndl (IN)      - Session/Env handle."]
#[doc = "err (IN/OUT)   - error handle. If there is an error, it is"]
#[doc = "recorded in 'err' and this function returns OCI_ERROR."]
#[doc = "The error recorded in 'err' can be retrieved by calling"]
#[doc = "OCIErrorGet()."]
#[doc = "datetime (IN)   - Pointer to OCIDateTime to be converted."]
#[doc = "outarray (OUT)  - Result array storage"]
#[doc = "len (OUT)        - pointer to  length of outarray."]
#[doc = "fsprec (IN)     - Number of fractional seconds digits."]
#[doc = "DESCRIPTION:"]
#[doc = "Returns an array representing the input DateTime descriptor."]
#[doc = "RETURNS:"]
#[doc = "OCI_SUCCESS if the function completes successfully."]
#[doc = "OCI_INVALID_HANDLE if 'err' is NULL."]
#[doc = "OCI_ERROR if"]
#[doc = "buffer too small"]
#[doc = "error retrieving timezone data"]
#[doc = "invalid region"]
#[doc = "invalid LdiDateTime type"]
#[doc = ""]
#[doc = "--------------------------------OCIDateTimeFromArray---------------------------"]
#[doc = "sword OCIDateTimeFromArray(void *hndl,"]
#[doc = "OCIError *err,"]
#[doc = "ub1 *inarray,"]
#[doc = "ub4 len"]
#[doc = "ub1 type"]
#[doc = "OCIDateTime *datetime,"]
#[doc = "OCIInterval *reftz,"]
#[doc = "ub1 fsprec);"]
#[doc = "NAME OCIDateTimeFromArray - OCI DateTime convert From Array format"]
#[doc = "PARAMETERS:"]
#[doc = "hndl (IN)      - Session/Env handle."]
#[doc = "err (IN/OUT)   - error handle. If there is an error, it is"]
#[doc = "recorded in 'err' and this function returns OCI_ERROR."]
#[doc = "The error recorded in 'err' can be retrieved by calling"]
#[doc = "OCIErrorGet()."]
#[doc = "inarray (IN)   - Pointer to input array representtion of DateTime"]
#[doc = "len (IN)       - len of inarray."]
#[doc = "type (IN)      - One of SQLT_DATE, SQLT_TIME, SQLT_TIME_TZ, SQLT_TIMESTAMP,"]
#[doc = "SQLT_TIMESTAMP_TZ, or SQLT_TIMESTAMP_LTZ."]
#[doc = "datetime (OUT) - Pointer to the result OCIDateTime."]
#[doc = "reftz (IN)     - timezone interval used with SQLT_TIMESTAMP_LTZ."]
#[doc = "fsprec (IN)    - fractionl seconds digits of precision (0-9)."]
#[doc = "DESCRIPTION:"]
#[doc = "Returns a pointer to an OCIDateTime of type type converted from"]
#[doc = "the inarray."]
#[doc = "RETURNS:"]
#[doc = "OCI_SUCCESS if the function completes successfully."]
#[doc = "OCI_INVALID_HANDLE if 'err' is NULL."]
#[doc = "OCI_ERROR if"]
#[doc = "buffer too small"]
#[doc = "error retrieving timezone data"]
#[doc = "invalid region"]
#[doc = "invalid LdiDateTime type"]
#[doc = ""]
#[doc = "----------------------------------OCIRowidToChar-----------------------------"]
#[doc = "Name"]
#[doc = "OCIRowidToChar"]
#[doc = ""]
#[doc = "Purpose"]
#[doc = "Converts physical/logical (universal) ROWID to chracter extended (Base 64)"]
#[doc = "representation into user provided buffer outbfp of length outbflp. After"]
#[doc = "execution outbflp contains amount of bytes converted.In case of truncation"]
#[doc = "error, outbflp contains required size to make this conversion successful"]
#[doc = "and returns ORA-1405."]
#[doc = ""]
#[doc = "Syntax"]
#[doc = "sword OCIRowidToChar( OCIRowid *rowidDesc,"]
#[doc = "OraText *outbfp,"]
#[doc = "ub2 *outbflp,"]
#[doc = "OCIError *errhp)"]
#[doc = ""]
#[doc = "Comments"]
#[doc = "After this conversion, ROWID in character format can be bound using"]
#[doc = "OCIBindByPos or OCIBindByName call and used to query a row at a"]
#[doc = "desired ROWID."]
#[doc = ""]
#[doc = "Parameters"]
#[doc = "rowidDesc (IN)   - rowid DESCriptor which is allocated from OCIDescritorAlloc"]
#[doc = "and populated by a prior SQL statement execution"]
#[doc = "outbfp (OUT)     - pointer to the buffer where converted rowid in character"]
#[doc = "representation is stored after successful execution."]
#[doc = "outbflp (IN/OUT) - pointer to output buffer length variable."]
#[doc = "Before execution (IN mode) *outbflp contains the size of"]
#[doc = "outbfp, after execution (OUT mode) *outbflp contains amount"]
#[doc = "of bytes converted. In an event of truncation during"]
#[doc = "conversion *outbflp contains the required length to make"]
#[doc = "conversion successful."]
#[doc = "errhp (IN/OUT)   - an error handle which can be passed to OCIErrorGet() for"]
#[doc = "diagnostic information in the event of an error."]
#[doc = ""]
#[doc = "------------------------------OCIDefineArrayOfStruct--------------------------"]
#[doc = ""]
#[doc = ""]
#[doc = "OCIDefineArrayOfStruct()"]
#[doc = "Name"]
#[doc = "OCI Define for Array of Structures"]
#[doc = "Purpose"]
#[doc = "This call specifies additional attributes necessary for a static array define."]
#[doc = "Syntax"]
#[doc = "sword OCIDefineArrayOfStruct ( OCIDefine   *defnp,"]
#[doc = "OCIError    *errhp,"]
#[doc = "ub4         pvskip,"]
#[doc = "ub4         indskip,"]
#[doc = "ub4         rlskip,"]
#[doc = "ub4         rcskip );"]
#[doc = "Comments"]
#[doc = "This call specifies additional attributes necessary for an array define,"]
#[doc = "used in an array of structures (multi-row, multi-column) fetch."]
#[doc = "For more information about skip parameters, see the section \"Skip Parameters\""]
#[doc = "on page 4-17."]
#[doc = "Parameters"]
#[doc = "defnp (IN) - the handle to the define structure which was returned by a call"]
#[doc = "to OCIDefineByPos()."]
#[doc = "errhp (IN) - an error handle which can be passed to OCIErrorGet() for"]
#[doc = "diagnostic information in the event of an error."]
#[doc = "pvskip (IN) - skip parameter for the next data value."]
#[doc = "indskip (IN) - skip parameter for the next indicator location."]
#[doc = "rlskip (IN) - skip parameter for the next return length value."]
#[doc = "rcskip (IN) - skip parameter for the next return code."]
#[doc = "Related Functions"]
#[doc = "OCIAttrGet()"]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = "OCIDefineByPos()"]
#[doc = "Name"]
#[doc = "OCI Define By Position"]
#[doc = "Purpose"]
#[doc = "Associates an item in a select-list with the type and output data buffer."]
#[doc = "Syntax"]
#[doc = "sb4 OCIDefineByPos ("]
#[doc = "OCIStmt     *stmtp,"]
#[doc = "OCIDefine   **defnp,"]
#[doc = "OCIError    *errhp,"]
#[doc = "ub4         position,"]
#[doc = "void       *valuep,"]
#[doc = "sb4         value_sz,"]
#[doc = "ub2         dty,"]
#[doc = "void       *indp,"]
#[doc = "ub2         *rlenp,"]
#[doc = "ub2         *rcodep,"]
#[doc = "ub4         mode );"]
#[doc = "Comments"]
#[doc = "This call defines an output buffer which will receive data retreived from"]
#[doc = "Oracle. The define is a local step which is necessary when a SELECT statement"]
#[doc = "returns data to your OCI application."]
#[doc = "This call also implicitly allocates the define handle for the select-list item."]
#[doc = "Defining attributes of a column for a fetch is done in one or more calls. The"]
#[doc = "first call is to OCIDefineByPos(), which defines the minimal attributes"]
#[doc = "required to specify the fetch."]
#[doc = "This call takes as a parameter a define handle, which must have been"]
#[doc = "previously allocated with a call to OCIHandleAlloc()."]
#[doc = "Following the call to OCIDefineByPos() additional define calls may be"]
#[doc = "necessary for certain data types or fetch modes:"]
#[doc = "A call to OCIDefineArrayOfStruct() is necessary to set up skip parameters"]
#[doc = "for an array fetch of multiple columns."]
#[doc = "A call to OCIDefineObject() is necessary to set up the appropriate"]
#[doc = "attributes of a named data type fetch. In this case the data buffer pointer"]
#[doc = "in ocidefn() is ignored."]
#[doc = "Both OCIDefineArrayOfStruct() and OCIDefineObject() must be called"]
#[doc = "after ocidefn() in order to fetch multiple rows with a column of named"]
#[doc = "data types."]
#[doc = "For a LOB define, the buffer pointer must be a lob locator of type"]
#[doc = "OCILobLocator , allocated by the OCIDescAlloc() call. LOB locators, and not"]
#[doc = "LOB values, are always returned for a LOB column. LOB values can then be"]
#[doc = "fetched using OCI LOB calls on the fetched locator."]
#[doc = "For NCHAR (fixed and varying length), the buffer pointer must point to an"]
#[doc = "array of bytes sufficient for holding the required NCHAR characters."]
#[doc = "Nested table columns are defined and fetched like any other named data type."]
#[doc = "If the mode parameter is this call is set to OCI_DYNAMIC_FETCH, the client"]
#[doc = "application can fetch data dynamically at runtime."]
#[doc = "Runtime data can be provided in one of two ways:"]
#[doc = "callbacks using a user-defined function which must be registered with a"]
#[doc = "subsequent call to OCIDefineDynamic(). When the client library needs a"]
#[doc = "buffer to return the fetched data, the callback will be invoked and the"]
#[doc = "runtime buffers provided will return a piece or the whole data."]
#[doc = "a polling mechanism using calls supplied by the OCI. This mode is"]
#[doc = "assumed if no callbacks are defined. In this case, the fetch call returns the"]
#[doc = "OCI_NEED_DATA error code, and a piecewise polling method is used"]
#[doc = "to provide the data."]
#[doc = "Related Functions: For more information about using the"]
#[doc = "OCI_DYNAMIC_FETCH mode, see the section \"Runtime Data"]
#[doc = "Allocation and Piecewise Operations\" on page 5-16 of Volume 1.."]
#[doc = "For more information about the define step, see the section \"Defining\""]
#[doc = "on page 2-30."]
#[doc = "Parameters"]
#[doc = "stmtp (IN) - a handle to the requested SQL query operation."]
#[doc = "defnp (IN/OUT) - a pointer to a pointer to a define handle which is implicitly"]
#[doc = "allocated by this call.  This handle is used to  store the define information"]
#[doc = "for this column."]
#[doc = "errhp (IN) - an error handle which can be passed to OCIErrorGet() for"]
#[doc = "diagnostic information in the event of an error."]
#[doc = "position (IN) - the position of this value in the select list. Positions are"]
#[doc = "1-based and are numbered from left to right. For example, in the SELECT"]
#[doc = "statement"]
#[doc = "SELECT empno, ssn, mgrno FROM employees;"]
#[doc = "empno is at position 1, ssn is at position 2, and mgrno is at position 3."]
#[doc = "valuep (IN/OUT) - a pointer to a buffer or an array of buffers of the type"]
#[doc = "specified in the dty parameter. A number of buffers can be specified when"]
#[doc = "results for more than one row are desired in a single fetch call."]
#[doc = "value_sz (IN) - the size of each valuep buffer in bytes. If the data is stored"]
#[doc = "internally in VARCHAR2 format, the number of characters desired, if different"]
#[doc = "from the buffer size in bytes, may be additionally specified by the using"]
#[doc = "OCIAttrSet()."]
#[doc = "In an NLS conversion environment, a truncation error will be generated if the"]
#[doc = "number of bytes specified is insufficient to handle the number of characters"]
#[doc = "desired."]
#[doc = "dty (IN) - the data type. Named data type (SQLT_NTY) and REF (SQLT_REF)"]
#[doc = "are valid only if the environment has been intialized with in object mode."]
#[doc = "indp - pointer to an indicator variable or array. For scalar data types,"]
#[doc = "pointer to sb2 or an array of sb2s. Ignored for named data types. For named"]
#[doc = "data types, a pointer to a named data type indicator structure or an array of"]
#[doc = "named data type indicator structures is associated by a subsequent"]
#[doc = "OCIDefineObject() call."]
#[doc = "See the section \"Indicator Variables\" on page 2-43 for more information about"]
#[doc = "indicator variables."]
#[doc = "rlenp (IN/OUT) - pointer to array of length of data fetched. Each element in"]
#[doc = "rlenp is the length of the data in the corresponding element in the row after"]
#[doc = "the fetch."]
#[doc = "rcodep (OUT) - pointer to array of column-level return codes"]
#[doc = "mode (IN) - the valid modes are:"]
#[doc = "OCI_DEFAULT. This is the default mode."]
#[doc = "OCI_DYNAMIC_FETCH. For applications requiring dynamically"]
#[doc = "allocated data at the time of fetch, this mode must be used. The user may"]
#[doc = "additionally call OCIDefineDynamic() to set up a callback function that"]
#[doc = "will be invoked to receive the dynamically allocated buffers and to set"]
#[doc = "up the memory allocate/free callbacks and the context for the callbacks."]
#[doc = "valuep and value_sz are ignored in this mode."]
#[doc = "Related Functions"]
#[doc = "OCIDefineArrayOfStruct(), OCIDefineDynamic(), OCIDefineObject()"]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = "OCIDefineDynamic()"]
#[doc = "Name"]
#[doc = "OCI Define Dynamic Fetch Attributes"]
#[doc = "Purpose"]
#[doc = "This call is used to set the additional attributes required if the"]
#[doc = "OCI_DYNAMIC_FETCH mode was selected in OCIDefineByPos()."]
#[doc = "Syntax"]
#[doc = "sword OCIDefineDynamic( OCIDefine   *defnp,"]
#[doc = "OCIError    *errhp,"]
#[doc = "void       *octxp,"]
#[doc = "OCICallbackDefine (ocbfp)("]
#[doc = "void             *octxp,"]
#[doc = "OCIDefine         *defnp,"]
#[doc = "ub4               iter,"]
#[doc = "void             **bufpp,"]
#[doc = "ub4               **alenpp,"]
#[doc = "ub1               *piecep,"]
#[doc = "void             **indpp,"]
#[doc = "ub2               **rcodep)  );"]
#[doc = "Comments"]
#[doc = "This call is used to set the additional attributes required if the"]
#[doc = "OCI_DYNAMIC_FETCH mode has been selected in a call to"]
#[doc = "OCIDefineByPos()."]
#[doc = "When the OCI_DYNAMIC_FETCH mode is selected, buffers will be"]
#[doc = "dynamically allocated for REF, and named data type, values to receive the"]
#[doc = "data. The pointers to these buffers will be returned."]
#[doc = "If OCI_DYNAMIC_FETCH mode was selected, and the call to"]
#[doc = "OCIDefineDynamic() is skipped, then the application can fetch data piecewise"]
#[doc = "using OCI calls."]
#[doc = "For more information about OCI_DYNAMIC_FETCH mode, see the section"]
#[doc = "\"Runtime Data Allocation and Piecewise Operations\" on page 5-16."]
#[doc = "Parameters"]
#[doc = "defnp (IN/OUT) - the handle to a define structure returned by a call to"]
#[doc = "OCIDefineByPos()."]
#[doc = "errhp (IN/OUT) - an error handle which can be passed to OCIErrorGet() for"]
#[doc = "diagnostic information in the event of an error."]
#[doc = "octxp (IN) - points to a context for the callback function."]
#[doc = "ocbfp (IN) - points to a callback function. This is invoked at runtime to get"]
#[doc = "a pointer to the buffer into which the fetched data or a piece of it will be"]
#[doc = "retreived. The callback also specifies the indicator, the return code and the"]
#[doc = "lengths of the data piece and indicator. The callback has the following"]
#[doc = "parameters:"]
#[doc = "octxp (IN) - a context pointer passed as an argument to all the callback"]
#[doc = "functions."]
#[doc = "defnp (IN) - the define handle."]
#[doc = "iter (IN) - which row of this current fetch."]
#[doc = "bufpp (OUT) - returns a pointer to a buffer to store the column value, ie."]
#[doc = "bufp points to some appropriate storage for the column value."]
#[doc = "alenpp (OUT) - returns a pointer to the length of the buffer. *alenpp"]
#[doc = "contains the size of the buffer after return from callback. Gets set to"]
#[doc = "actual data size after fetch."]
#[doc = "piecep (IN/OUT) - returns a piece value, as follows:"]
#[doc = "The IN value can be OCI_ONE_PIECE, OCI_FIRST_PIECE or"]
#[doc = "OCI_NEXT_PIECE."]
#[doc = "The OUT value can be OCI_ONE_PIECE if the IN value was"]
#[doc = "OCI_ONE_PIECE."]
#[doc = "The OUT value can be OCI_ONE_PIECE or OCI_FIRST_PIECE if"]
#[doc = "the IN value was OCI_FIRST_PIECE."]
#[doc = "The OUT value can only be OCI_NEXT_PIECE or"]
#[doc = "OCI_LAST_PIECE if the IN value was OCI_NEXT_PIECE."]
#[doc = "indpp (IN) - indicator variable pointer"]
#[doc = "rcodep (IN) - return code variable pointer"]
#[doc = "Related Functions"]
#[doc = "OCIAttrGet()"]
#[doc = "OCIDefineObject()"]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = "OCIDefineObject()"]
#[doc = "Name"]
#[doc = "OCI Define Named Data Type attributes"]
#[doc = "Purpose"]
#[doc = "Sets up additional attributes necessary for a Named Data Type define."]
#[doc = "Syntax"]
#[doc = "sword OCIDefineObject ( OCIDefine       *defnp,"]
#[doc = "OCIError        *errhp,"]
#[doc = "const OCIType   *type,"]
#[doc = "void           **pgvpp,"]
#[doc = "ub4             *pvszsp,"]
#[doc = "void           **indpp,"]
#[doc = "ub4             *indszp );"]
#[doc = "Comments"]
#[doc = "This call sets up additional attributes necessary for a Named Data Type define."]
#[doc = "An error will be returned if this function is called when the OCI environment"]
#[doc = "has been initialized in non-Object mode."]
#[doc = "This call takes as a paramter a type descriptor object (TDO) of datatype"]
#[doc = "OCIType for the named data type being defined.  The TDO can be retrieved"]
#[doc = "with a call to OCITypeByName()."]
#[doc = "See the description of OCIInitialize() on page 13 - 43 for more information"]
#[doc = "about initializing the OCI process environment."]
#[doc = "Parameters"]
#[doc = "defnp (IN/OUT) - a define handle previously allocated in a call to"]
#[doc = "OCIDefineByPos()."]
#[doc = "errhp (IN/OUT) - an error handle which can be passed to OCIErrorGet() for"]
#[doc = "diagnostic information in the event of an error."]
#[doc = "type (IN, optional) - points to the Type Descriptor Object (TDO) which"]
#[doc = "describes the type of the program variable. Only used for program variables"]
#[doc = "of type SQLT_NTY. This parameter is optional, and may be passed as NULL"]
#[doc = "if it is not being used."]
#[doc = "pgvpp (IN/OUT) - points to a pointer to a program variable buffer. For an"]
#[doc = "array, pgvpp points to an array of pointers. Memory for the fetched named data"]
#[doc = "type instance(s) is dynamically allocated in the object cache. At the end of"]
#[doc = "the fetch when all the values have been received, pgvpp points to the"]
#[doc = "pointer(s) to these newly allocated named data type instance(s). The"]
#[doc = "application must call OCIObjectMarkDel() to deallocate the named data type"]
#[doc = "instance(s) when they are no longer needed."]
#[doc = "pvszsp (IN/OUT) - points to the size of the program variable. For an array, it"]
#[doc = "is an array of ub4s. On return points to the size(s) of unpickled fetched"]
#[doc = "values."]
#[doc = "indpp (IN/OUT) - points to a pointer to the program variable buffer"]
#[doc = "containing the parallel indicator structure. For an array, points to an array"]
#[doc = "of pointers. Memory is allocated to store the indicator structures in the"]
#[doc = "object cache. At the end of the fetch when all values have been received,"]
#[doc = "indpp points to the pointer(s) to these newly allocated indicator structure(s)."]
#[doc = "indszp (IN/OUT) - points to the size(s) of the indicator structure program"]
#[doc = "variable. For an array, it is an array of ub4s. On return points to the size(s)"]
#[doc = "of the unpickled fetched indicator values."]
#[doc = "Related Functions"]
#[doc = "OCIAttrGet()"]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = "OCIDescAlloc()"]
#[doc = "Name"]
#[doc = "OCI Get DESCriptor or lob locator"]
#[doc = "Purpose"]
#[doc = "Allocates storage to hold certain data types. The descriptors can be used as"]
#[doc = "bind or define variables."]
#[doc = "Syntax"]
#[doc = "sword OCIDescAlloc ( const void   *parenth,"]
#[doc = "void         **descpp,"]
#[doc = "ub4           type,"]
#[doc = "size_t        xtramem_sz,"]
#[doc = "void         **usrmempp);"]
#[doc = "Comments"]
#[doc = "Returns a pointer to an allocated and initialized structure, corresponding to"]
#[doc = "the type specified in type. A non-NULL descriptor or LOB locator is returned"]
#[doc = "on success. No diagnostics are available on error."]
#[doc = "This call returns OCI_SUCCESS if successful, or OCI_INVALID_HANDLE if"]
#[doc = "an out-of-memory error occurs."]
#[doc = "Parameters"]
#[doc = "parenth (IN) - an environment handle."]
#[doc = "descpp (OUT) - returns a descriptor or LOB locator of desired type."]
#[doc = "type (IN) - specifies the type of descriptor or LOB locator to be allocated."]
#[doc = "The specific types are:"]
#[doc = "OCI_DTYPE_SNAP - specifies generation of snapshot descriptor of C"]
#[doc = "type - OCISnapshot"]
#[doc = "OCI_DTYPE_LOB - specifies generation of a LOB data type locator of C"]
#[doc = "type - OCILobLocator"]
#[doc = "OCI_DTYPE_RSET - specifies generation of a descriptor of C type"]
#[doc = "OCIResult that references a result set (a number of rows as a result of a"]
#[doc = "query). This descriptor is bound to a bind variable of data type"]
#[doc = "SQLT_RSET (result set). The descriptor has to be converted into a"]
#[doc = "statement handle using a function - OCIResultSetToStmt() - which can"]
#[doc = "then be passed to OCIDefineByPos() and OCIStmtFetch() to retrieve the"]
#[doc = "rows of the result set."]
#[doc = "OCI_DTYPE_ROWID - specifies generation of a ROWID descriptor of C"]
#[doc = "type OCIRowid."]
#[doc = "OCI_DTYPE_COMPLEXOBJECTCOMP - specifies generation of a"]
#[doc = "complex object retrieval descriptor of C type"]
#[doc = "OCIComplexObjectComp."]
#[doc = "xtramemsz (IN) - specifies an amount of user memory to be allocated for use"]
#[doc = "by the application."]
#[doc = "usrmempp (OUT) - returns a pointer to the user memory of size xtramemsz"]
#[doc = "allocated by the call for the user."]
#[doc = "Related Functions"]
#[doc = "OCIDescFree()"]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = "OCIDescFree()"]
#[doc = "Name"]
#[doc = "OCI Free DESCriptor"]
#[doc = "Purpose"]
#[doc = "Deallocates a previously allocated descriptor."]
#[doc = "Syntax"]
#[doc = "sword OCIDescFree ( void    *descp,"]
#[doc = "ub4      type);"]
#[doc = "Comments"]
#[doc = "This call frees up storage associated with the descriptor, corresponding to the"]
#[doc = "type specified in type. Returns OCI_SUCCESS or OCI_INVALID_HANDLE."]
#[doc = "All descriptors must be explicitly deallocated. OCI will not deallocate a"]
#[doc = "descriptor if the environment handle is deallocated."]
#[doc = "Parameters"]
#[doc = "descp (IN) - an allocated descriptor."]
#[doc = "type (IN) - specifies the type of storage to be freed. The specific types are:"]
#[doc = "OCI_DTYPE_SNAP - snapshot descriptor"]
#[doc = "OCI_DTYPE_LOB - a LOB data type descriptor"]
#[doc = "OCI_DTYPE_RSET - a descriptor that references a result set (a number"]
#[doc = "of rows as a result of a query)."]
#[doc = "OCI_DTYPE_ROWID - a ROWID descriptor"]
#[doc = "OCI_DTYPE_COMPLEXOBJECTCOMP - a complex object retrieval"]
#[doc = "descriptor"]
#[doc = "Related Functions"]
#[doc = "OCIDescAlloc()"]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = "OCIDescribeAny()"]
#[doc = "Name"]
#[doc = "OCI DeSCribe Any"]
#[doc = "Purpose"]
#[doc = "Describes existing schema objects."]
#[doc = "Syntax"]
#[doc = "sword OCIDescribeAny ( OCISvcCtx     *svchp,"]
#[doc = "OCIError      *errhp,"]
#[doc = "void         *objptr,"]
#[doc = "ub4           objnm_len,"]
#[doc = "ub1           objptr_typ,"]
#[doc = "ub1           info_level,"]
#[doc = "ub1           objtype,"]
#[doc = "OCIDesc       *dschp );"]
#[doc = "Comments"]
#[doc = "This is a generic describe call that describes existing schema objects: tables,"]
#[doc = "views, synonyms, procedures, functions, packages, sequences, and types. As a"]
#[doc = "result of this call, the describe handle is populated with the object-specific"]
#[doc = "attributes which can be obtained through an OCIAttrGet() call."]
#[doc = "An OCIParamGet() on the describe handle returns a parameter descriptor for a"]
#[doc = "specified position. Parameter positions begin with 1. Calling OCIAttrGet() on"]
#[doc = "the parameter descriptor returns the specific attributes of a stored procedure"]
#[doc = "or function parameter or a table column descriptor as the case may be."]
#[doc = "These subsequent calls do not need an extra round trip to the server because"]
#[doc = "the entire schema object description cached on the client side by"]
#[doc = "OCIDescribeAny(). Calling OCIAttrGet() on the describe handle can also return"]
#[doc = "the total number of positions."]
#[doc = "See the section \"Describing\" on page 2-33 for more information about describe"]
#[doc = "operations."]
#[doc = "Parameters"]
#[doc = "TO BE UPDATED"]
#[doc = "svchp (IN/OUT) - a service context handle."]
#[doc = "errhp (IN/OUT) - an error handle which can be passed to OCIErrorGet() for"]
#[doc = "diagnostic information in the event of an error."]
#[doc = "objptr (IN) - the name of the object (a null-terminated string) to be"]
#[doc = "described. Only procedure or function names are valid when connected to an"]
#[doc = "Oracle7 Server."]
#[doc = "objptr_len (IN) - the length of the string. Must be non-zero."]
#[doc = "objptr_typ (IN) - Must be OCI_OTYPE_NAME, OCI_OTYPE_REF, or OCI_OTYPE_PTR."]
#[doc = "info_level (IN) - reserved for future extensions. Pass OCI_DEFAULT."]
#[doc = "objtype (IN/OUT) - object type."]
#[doc = "dschp (IN/OUT) - a describe handle that is populated with describe"]
#[doc = "information about the object after the call."]
#[doc = "Related Functions"]
#[doc = "OCIAttrGet()"]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = "OCIEnvCreate()"]
#[doc = "Name"]
#[doc = "OCI ENVironment CREATE"]
#[doc = "Purpose"]
#[doc = "This function creates and initializes an environment for the rest of"]
#[doc = "the OCI functions to work under.  This call is a replacement for both"]
#[doc = "the OCIInitialize and OCIEnvInit calls."]
#[doc = "Syntax"]
#[doc = "sword OCIEnvCreate  ( OCIEnv        **envhpp,"]
#[doc = "ub4           mode,"]
#[doc = "const void   *ctxp,"]
#[doc = "const void   *(*malocfp)"]
#[doc = "(void *ctxp,"]
#[doc = "size_t size),"]
#[doc = "const void   *(*ralocfp)"]
#[doc = "(void *ctxp,"]
#[doc = "void *memptr,"]
#[doc = "size_t newsize),"]
#[doc = "const void    (*mfreefp)"]
#[doc = "( void *ctxp,"]
#[doc = "void *memptr))"]
#[doc = "size_t    xtramemsz,"]
#[doc = "void     **usrmempp );"]
#[doc = ""]
#[doc = "Comments"]
#[doc = "This call creates an environment for all the OCI calls using the modes"]
#[doc = "specified by the user. This call can be used instead of the two calls"]
#[doc = "OCIInitialize and OCIEnvInit. This function returns an environment handle"]
#[doc = "which is then used by the remaining OCI functions. There can be multiple"]
#[doc = "environments in OCI each with its own environment modes.  This function"]
#[doc = "also performs any process level initialization if required by any mode."]
#[doc = "For example if the user wants to initialize an environment as OCI_THREADED,"]
#[doc = "then all libraries that are used by OCI are also initialized in the"]
#[doc = "threaded mode."]
#[doc = ""]
#[doc = "This call should be invoked before anny other OCI call and should be used"]
#[doc = "instead of the OCIInitialize and OCIEnvInit calls. This is the recommended"]
#[doc = "call, although OCIInitialize and OCIEnvInit calls will still be supported"]
#[doc = "for backward compatibility."]
#[doc = ""]
#[doc = "envpp (OUT) - a pointer to a handle to the environment."]
#[doc = "mode (IN) - specifies initialization of the mode. The valid modes are:"]
#[doc = "OCI_DEFAULT - default mode."]
#[doc = "OCI_THREADED - threaded environment. In this mode, internal data"]
#[doc = "structures are protected from concurrent accesses by multiple threads."]
#[doc = "OCI_OBJECT - will use navigational object interface."]
#[doc = "ctxp (IN) - user defined context for the memory call back routines."]
#[doc = "malocfp (IN) - user-defined memory allocation function. If mode is"]
#[doc = "OCI_THREADED, this memory allocation routine must be thread safe."]
#[doc = "ctxp - context pointer for the user-defined memory allocation function."]
#[doc = "size - size of memory to be allocated by the user-defined memory"]
#[doc = "allocation function"]
#[doc = "ralocfp (IN) - user-defined memory re-allocation function. If mode is"]
#[doc = "OCI_THREADED, this memory allocation routine must be thread safe."]
#[doc = "ctxp - context pointer for the user-defined memory reallocation"]
#[doc = "function."]
#[doc = "memp - pointer to memory block"]
#[doc = "newsize - new size of memory to be allocated"]
#[doc = "mfreefp (IN) - user-defined memory free function. If mode is"]
#[doc = "OCI_THREADED, this memory free routine must be thread safe."]
#[doc = "ctxp - context pointer for the user-defined memory free function."]
#[doc = "memptr - pointer to memory to be freed"]
#[doc = "xtramemsz (IN) - specifies the amount of user memory to be allocated."]
#[doc = "usrmempp (OUT) - returns a pointer to the user memory of size xtramemsz"]
#[doc = "allocated by the call for the user."]
#[doc = ""]
#[doc = "Example"]
#[doc = ""]
#[doc = "Related Functions"]
#[doc = "OCIInitialize, OCIEnvInit"]
#[doc = ""]
#[doc = "OCIEnvNlsCreate()"]
#[doc = "Name"]
#[doc = "OCI ENVironment CREATE with NLS info"]
#[doc = "Purpose"]
#[doc = "This function does almost everything OCIEnvCreate does, plus enabling setting"]
#[doc = "of charset and ncharset programmatically, except OCI_UTF16 mode."]
#[doc = "Syntax"]
#[doc = "sword OCIEnvNlsCreate(OCIEnv        **envhpp,"]
#[doc = "ub4           mode,"]
#[doc = "void         *ctxp,"]
#[doc = "void         *(*malocfp)"]
#[doc = "(void *ctxp,"]
#[doc = "size_t size),"]
#[doc = "void         *(*ralocfp)"]
#[doc = "(void *ctxp,"]
#[doc = "void *memptr,"]
#[doc = "size_t newsize),"]
#[doc = "void          (*mfreefp)"]
#[doc = "(void *ctxp,"]
#[doc = "void *memptr),"]
#[doc = "size_t        xtramemsz,"]
#[doc = "void         **usrmempp,"]
#[doc = "ub2           charset,"]
#[doc = "ub2           ncharset)"]
#[doc = "Comments"]
#[doc = "The charset and ncharset must be both zero or non-zero."]
#[doc = "The parameters have the same meaning as the ones in OCIEnvCreate()."]
#[doc = "When charset or ncharset is non-zero, the corresponding character set will"]
#[doc = "be used to replace the ones specified in NLS_LANG or NLS_NCHAR. Moreover,"]
#[doc = "OCI_UTF16ID is allowed to be set as charset and ncharset."]
#[doc = "On the other hand, OCI_UTF16 mode is deprecated with this function."]
#[doc = "Applications can achieve the same effects by setting"]
#[doc = "both charset and ncharset as OCI_UTF16ID."]
#[doc = ""]
#[doc = ""]
#[doc = "OCIEnvInit()"]
#[doc = "Name"]
#[doc = "OCI INITialize environment"]
#[doc = "Purpose"]
#[doc = "This call initializes the OCI environment handle."]
#[doc = "Syntax"]
#[doc = "sword OCIEnvInit ( OCIEnv    **envp,"]
#[doc = "ub4       mode,"]
#[doc = "size_t    xtramemsz,"]
#[doc = "void     **usrmempp );"]
#[doc = "Comments"]
#[doc = "Initializes the OCI environment handle. No changes are done on an initialized"]
#[doc = "handle. If OCI_ERROR or OCI_SUCCESS_WITH_INFO is returned, the"]
#[doc = "environment handle can be used to obtain ORACLE specific errors and"]
#[doc = "diagnostics."]
#[doc = "This call is processed locally, without a server round-trip."]
#[doc = "Parameters"]
#[doc = "envpp (OUT) - a pointer to a handle to the environment."]
#[doc = "mode (IN) - specifies initialization of an environment mode. The only valid"]
#[doc = "mode is OCI_DEFAULT for default mode"]
#[doc = "xtramemsz (IN) - specifies the amount of user memory to be allocated."]
#[doc = "usrmempp (OUT) - returns a pointer to the user memory of size xtramemsz"]
#[doc = "allocated by the call for the user."]
#[doc = "Example"]
#[doc = "See the description of OCISessionBegin() on page 13-84 for an example showing"]
#[doc = "the use of OCIEnvInit()."]
#[doc = "Related Functions"]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = "OCIErrorGet()"]
#[doc = "Name"]
#[doc = "OCI Get Diagnostic Record"]
#[doc = "Purpose"]
#[doc = "Returns an error message in the buffer provided and an ORACLE error."]
#[doc = "Syntax"]
#[doc = "sword OCIErrorGet ( void      *hndlp,"]
#[doc = "ub4        recordno,"]
#[doc = "OraText       *sqlstate,"]
#[doc = "ub4        *errcodep,"]
#[doc = "OraText       *bufp,"]
#[doc = "ub4        bufsiz,"]
#[doc = "ub4        type );"]
#[doc = "Comments"]
#[doc = "Returns an error message in the buffer provided and an ORACLE error."]
#[doc = "Currently does not support SQL state. This call can be called a multiple"]
#[doc = "number of times if there are more than one diagnostic record for an error."]
#[doc = "The error handle is originally allocated with a call to OCIHandleAlloc()."]
#[doc = "Parameters"]
#[doc = "hndlp (IN) - the error handle, in most cases, or the environment handle (for"]
#[doc = "errors on OCIEnvInit(), OCIHandleAlloc())."]
#[doc = "recordno (IN) - indicates the status record from which the application seeks"]
#[doc = "info. Starts from 1."]
#[doc = "sqlstate (OUT) - Not supported in Version 8.0."]
#[doc = "errcodep (OUT) - an ORACLE Error is returned."]
#[doc = "bufp (OUT) - the error message text is returned."]
#[doc = "bufsiz (IN) - the size of the buffer provide to get the error message."]
#[doc = "type (IN) - the type of the handle."]
#[doc = "Related Functions"]
#[doc = "OCIHandleAlloc()"]
#[doc = ""]
#[doc = "OCIExtractInit"]
#[doc = "Name"]
#[doc = "OCI Extract Initialize"]
#[doc = "Purpose"]
#[doc = "This function initializes the parameter manager."]
#[doc = "Syntax"]
#[doc = "sword OCIExtractInit(void *hndl, OCIError *err);"]
#[doc = "Comments"]
#[doc = "It must be called before calling any other parameter manager routine. The NLS"]
#[doc = "information is stored inside the parameter manager context and used in"]
#[doc = "subsequent calls to OCIExtract routines."]
#[doc = "Returns OCI_SUCCESS, OCI_INVALID_HANDLE, or OCI_ERROR"]
#[doc = "Parameters"]
#[doc = "hndl (IN/OUT) - The OCI environment or session handle."]
#[doc = "err (IN/OUT) - The OCI error handle. If there is an error, it is recorded in"]
#[doc = "err and this function returns OCI_ERROR. Diagnostic information"]
#[doc = "can be obtained by calling OCIErrorGet()."]
#[doc = "Related Functions"]
#[doc = "OCIExtractTerm()"]
#[doc = ""]
#[doc = "OCIExtractTerm"]
#[doc = "Name"]
#[doc = "OCI Extract Terminate"]
#[doc = "Purpose"]
#[doc = "This function releases all dynamically allocated storage and may perform"]
#[doc = "other internal bookkeeping functions."]
#[doc = "Syntax"]
#[doc = "sword OCIExtractTerm(void *hndl, OCIError *err);"]
#[doc = "Comments"]
#[doc = "It must be called when the parameter manager is no longer being used."]
#[doc = "Returns OCI_SUCCESS, OCI_INVALID_HANDLE, or OCI_ERROR"]
#[doc = "Parameters"]
#[doc = "hndl (IN/OUT) - The OCI environment or session handle."]
#[doc = "err (IN/OUT) - The OCI error handle. If there is an error, it is recorded in"]
#[doc = "err and this function returns OCI_ERROR. Diagnostic information"]
#[doc = "can be obtained by calling OCIErrorGet()."]
#[doc = "Related Functions"]
#[doc = "OCIExtractInit()"]
#[doc = ""]
#[doc = "OCIExtractReset"]
#[doc = "Name"]
#[doc = "OCI Extract Reset"]
#[doc = "Purpose"]
#[doc = "The memory currently used for parameter storage, key definition storage, and"]
#[doc = "parameter value lists is freed and the structure is reinitialized."]
#[doc = "Syntax"]
